;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Thu Oct 31 13:36:27 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/MainApp2.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2R3\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("EnableInterrupts")
	.dwattr $C$DW$1, DW_AT_linkage_name("EnableInterrupts")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\Functions2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x27)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("UpdateSysTimer")
	.dwattr $C$DW$2, DW_AT_linkage_name("UpdateSysTimer")

	.gmember  ".text:CanAxisIsPosition"
	.endgroup
	.group    "DisableRs485Tx_1", 1
	.gmember  ".text:DisableRs485Tx_1"
	.endgroup
	.group    "DisableRs485Tx_2", 1
	.gmember  ".text:DisableRs485Tx_2"
	.endgroup
	.group    "EnableRs485Tx_1", 1
	.gmember  ".text:EnableRs485Tx_1"
	.endgroup
	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "ForceMotorOffAndBrakeRelease", 1
	.gmember  ".text:ForceMotorOffAndBrakeRelease"
	.endgroup
	.group    "ForceMotorOnBrake", 1
	.gmember  ".text:ForceMotorOnBrake"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "InitSuctionNoMonitor", 1
	.gmember  ".text:InitSuctionNoMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsMotorReady", 1
	.gmember  ".text:IsMotorReady"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetBrakeActionAutomatic", 1
	.gmember  ".text:SetBrakeActionAutomatic"
	.endgroup
	.group    "SetCanAxisDisableAutoBrake", 1
	.gmember  ".text:SetCanAxisDisableAutoBrake"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetCanAxisReferenceMode", 1
	.gmember  ".text:SetCanAxisReferenceMode"
	.endgroup
	.group    "SetCanAxisWheelTracksSteering", 1
	.gmember  ".text:SetCanAxisWheelTracksSteering"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetUserManualSpeedTarget", 1
	.gmember  ".text:SetUserManualSpeedTarget"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "StopSuctionNoMonitor", 1
	.gmember  ".text:StopSuctionNoMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$716	.dwtag  DW_TAG_member
	.dwattr $C$DW$716, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$716, DW_AT_name("I2tCntr")
	.dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$716, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$716, DW_AT_decl_line(0x108)
	.dwattr $C$DW$716, DW_AT_decl_column(0x18)

$C$DW$717	.dwtag  DW_TAG_member
	.dwattr $C$DW$717, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$717, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$717, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$717, DW_AT_decl_line(0x109)
	.dwattr $C$DW$717, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$718	.dwtag  DW_TAG_member
	.dwattr $C$DW$718, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$718, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$718, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$718, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$718, DW_AT_decl_column(0x0e)

$C$DW$719	.dwtag  DW_TAG_member
	.dwattr $C$DW$719, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$719, DW_AT_name("IPC_STS")
	.dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$719, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$719, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$719, DW_AT_decl_column(0x0e)

$C$DW$720	.dwtag  DW_TAG_member
	.dwattr $C$DW$720, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$720, DW_AT_name("IPC_SET")
	.dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$720, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$720, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$720, DW_AT_decl_column(0x0e)

$C$DW$721	.dwtag  DW_TAG_member
	.dwattr $C$DW$721, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$721, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$721, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$721, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$721, DW_AT_decl_column(0x0e)

$C$DW$722	.dwtag  DW_TAG_member
	.dwattr $C$DW$722, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$722, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$722, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$722, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$722, DW_AT_decl_column(0x0e)

$C$DW$723	.dwtag  DW_TAG_member
	.dwattr $C$DW$723, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$723, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$723, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$723, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$723, DW_AT_decl_column(0x0e)

$C$DW$724	.dwtag  DW_TAG_member
	.dwattr $C$DW$724, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$724, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$724, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$724, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$724, DW_AT_decl_column(0x0e)

$C$DW$725	.dwtag  DW_TAG_member
	.dwattr $C$DW$725, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$725, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$725, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$725, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$725, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$726	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$726, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$726)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$727	.dwtag  DW_TAG_member
	.dwattr $C$DW$727, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$727, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$727, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$727, DW_AT_decl_line(0xed)
	.dwattr $C$DW$727, DW_AT_decl_column(0x0e)

$C$DW$728	.dwtag  DW_TAG_member
	.dwattr $C$DW$728, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$728, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$728, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$728, DW_AT_decl_line(0xee)
	.dwattr $C$DW$728, DW_AT_decl_column(0x0e)

$C$DW$729	.dwtag  DW_TAG_member
	.dwattr $C$DW$729, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$729, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$729, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$729, DW_AT_decl_line(0xef)
	.dwattr $C$DW$729, DW_AT_decl_column(0x0e)

$C$DW$730	.dwtag  DW_TAG_member
	.dwattr $C$DW$730, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$730, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$730, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$730, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$731	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$731, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$731)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$732	.dwtag  DW_TAG_member
	.dwattr $C$DW$732, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$732, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$732, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$732, DW_AT_decl_column(0x0e)

$C$DW$733	.dwtag  DW_TAG_member
	.dwattr $C$DW$733, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$733, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$733, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$733, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$733, DW_AT_decl_column(0x0e)

$C$DW$734	.dwtag  DW_TAG_member
	.dwattr $C$DW$734, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$734, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$734, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$734, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$734, DW_AT_decl_column(0x0e)

$C$DW$735	.dwtag  DW_TAG_member
	.dwattr $C$DW$735, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$735, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$735, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$735, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$735, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$736	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$736, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$736)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$737	.dwtag  DW_TAG_member
	.dwattr $C$DW$737, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$737, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$737, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$737, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$737, DW_AT_decl_column(0x0e)

$C$DW$738	.dwtag  DW_TAG_member
	.dwattr $C$DW$738, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$738, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$738, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$738, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$738, DW_AT_decl_column(0x0e)

$C$DW$739	.dwtag  DW_TAG_member
	.dwattr $C$DW$739, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$739, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$739, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$739, DW_AT_decl_line(0xff)
	.dwattr $C$DW$739, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$740	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$740, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$740)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$741, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$741, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$741, DW_AT_decl_line(0x122)
	.dwattr $C$DW$741, DW_AT_decl_column(0x23)

$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$742, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$742, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$742, DW_AT_decl_line(0x123)
	.dwattr $C$DW$742, DW_AT_decl_column(0x23)

$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$743, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$743, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$743, DW_AT_decl_line(0x124)
	.dwattr $C$DW$743, DW_AT_decl_column(0x23)

$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$744, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$744, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$744, DW_AT_decl_line(0x125)
	.dwattr $C$DW$744, DW_AT_decl_column(0x23)

$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$745, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$745, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$745, DW_AT_decl_line(0x126)
	.dwattr $C$DW$745, DW_AT_decl_column(0x23)

$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$746, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$746, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$746, DW_AT_decl_line(0x127)
	.dwattr $C$DW$746, DW_AT_decl_column(0x23)

$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$747, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$747, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$747, DW_AT_decl_line(0x128)
	.dwattr $C$DW$747, DW_AT_decl_column(0x23)

$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$748, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$748, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$748, DW_AT_decl_line(0x129)
	.dwattr $C$DW$748, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$294	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$294
$C$DW$T$294	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$294, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$294, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$294, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$294, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$294


$C$DW$TU$295	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$295
$C$DW$749	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$294)

$C$DW$T$295	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$295, DW_AT_type(*$C$DW$749)

	.dwendtag $C$DW$TU$295


$C$DW$TU$296	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$296

$C$DW$T$296	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$295)
	.dwattr $C$DW$T$296, DW_AT_byte_size(0x78)
$C$DW$750	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$750, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$296

	.dwendtag $C$DW$TU$296


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$751, DW_AT_name("index")
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$751, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$751, DW_AT_decl_line(0x79)
	.dwattr $C$DW$751, DW_AT_decl_column(0x20)

$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$752, DW_AT_name("subindex")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$752, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$752, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$752, DW_AT_decl_column(0x20)

$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$753, DW_AT_name("data_type")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$753, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$753, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$753, DW_AT_decl_column(0x20)

$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$754, DW_AT_name("data_len")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$754, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$754, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$754, DW_AT_decl_column(0x17)

$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$755, DW_AT_name("isset")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$755, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$755, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$755, DW_AT_decl_column(0x17)

$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$756, DW_AT_name("unused")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$756, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$756, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$756, DW_AT_decl_column(0x17)

$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$757, DW_AT_name("counter")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$757, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$757, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$757, DW_AT_decl_column(0x1f)

$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$758, DW_AT_name("errcode")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$758, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$758, DW_AT_decl_line(0x80)
	.dwattr $C$DW$758, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$759, DW_AT_name("Unused")
	.dwattr $C$DW$759, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$759, DW_AT_bit_size(0x01)
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$759, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$759, DW_AT_decl_line(0x58)
	.dwattr $C$DW$759, DW_AT_decl_column(0x16)

$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$760, DW_AT_name("RebootPsCntr")
	.dwattr $C$DW$760, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$760, DW_AT_bit_size(0x04)
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$760, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$760, DW_AT_decl_line(0x59)
	.dwattr $C$DW$760, DW_AT_decl_column(0x16)

$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$761, DW_AT_name("ManipulatorAxesReboot")
	.dwattr $C$DW$761, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$761, DW_AT_bit_size(0x03)
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$761, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$761, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$761, DW_AT_decl_column(0x16)

$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$762, DW_AT_name("Rsvd")
	.dwattr $C$DW$762, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$762, DW_AT_bit_size(0x08)
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$762, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$762, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$762, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$41

	.dwendtag $C$DW$TU$41


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$763, DW_AT_name("rsvd2")
	.dwattr $C$DW$763, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$763, DW_AT_bit_size(0x05)
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$763, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$763, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$763, DW_AT_decl_column(0x16)

$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$764, DW_AT_name("StoEnabled")
	.dwattr $C$DW$764, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$764, DW_AT_bit_size(0x01)
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$764, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$764, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$764, DW_AT_decl_column(0x16)

$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$765, DW_AT_name("StopCan")
	.dwattr $C$DW$765, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$765, DW_AT_bit_size(0x01)
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$765, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$765, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$765, DW_AT_decl_column(0x16)

$C$DW$766	.dwtag  DW_TAG_member
	.dwattr $C$DW$766, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$766, DW_AT_name("LeftPinCmd")
	.dwattr $C$DW$766, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$766, DW_AT_bit_size(0x02)
	.dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$766, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$766, DW_AT_decl_line(0x20)
	.dwattr $C$DW$766, DW_AT_decl_column(0x16)

$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$767, DW_AT_name("RightPinCmd")
	.dwattr $C$DW$767, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$767, DW_AT_bit_size(0x02)
	.dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$767, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$767, DW_AT_decl_line(0x21)
	.dwattr $C$DW$767, DW_AT_decl_column(0x16)

$C$DW$768	.dwtag  DW_TAG_member
	.dwattr $C$DW$768, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$768, DW_AT_name("CommRestart")
	.dwattr $C$DW$768, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$768, DW_AT_bit_size(0x01)
	.dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$768, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$768, DW_AT_decl_line(0x22)
	.dwattr $C$DW$768, DW_AT_decl_column(0x16)

$C$DW$769	.dwtag  DW_TAG_member
	.dwattr $C$DW$769, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$769, DW_AT_name("ObsoleteLaserPsOn")
	.dwattr $C$DW$769, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$769, DW_AT_bit_size(0x01)
	.dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$769, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$769, DW_AT_decl_line(0x23)
	.dwattr $C$DW$769, DW_AT_decl_column(0x16)

$C$DW$770	.dwtag  DW_TAG_member
	.dwattr $C$DW$770, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$770, DW_AT_name("RecorderTimeBasis")
	.dwattr $C$DW$770, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$770, DW_AT_bit_size(0x01)
	.dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$770, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$770, DW_AT_decl_line(0x24)
	.dwattr $C$DW$770, DW_AT_decl_column(0x16)

$C$DW$771	.dwtag  DW_TAG_member
	.dwattr $C$DW$771, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$771, DW_AT_name("testRs485")
	.dwattr $C$DW$771, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$771, DW_AT_bit_size(0x02)
	.dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$771, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$771, DW_AT_decl_line(0x25)
	.dwattr $C$DW$771, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$772	.dwtag  DW_TAG_member
	.dwattr $C$DW$772, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$772, DW_AT_name("rsvd")
	.dwattr $C$DW$772, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$772, DW_AT_bit_size(0x09)
	.dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$772, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$772, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$772, DW_AT_decl_column(0x16)

$C$DW$773	.dwtag  DW_TAG_member
	.dwattr $C$DW$773, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$773, DW_AT_name("WheelArmExist")
	.dwattr $C$DW$773, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$773, DW_AT_bit_size(0x01)
	.dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$773, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$773, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$773, DW_AT_decl_column(0x16)

$C$DW$774	.dwtag  DW_TAG_member
	.dwattr $C$DW$774, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$774, DW_AT_name("ManipType")
	.dwattr $C$DW$774, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$774, DW_AT_bit_size(0x06)
	.dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$774, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$774, DW_AT_decl_line(0x30)
	.dwattr $C$DW$774, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$47	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$47

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x3e)
$C$DW$775	.dwtag  DW_TAG_member
	.dwattr $C$DW$775, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$775, DW_AT_name("AxesActive")
	.dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$775, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$775, DW_AT_decl_line(0x88)
	.dwattr $C$DW$775, DW_AT_decl_column(0x17)

$C$DW$776	.dwtag  DW_TAG_member
	.dwattr $C$DW$776, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$776, DW_AT_name("ObsoletePumpsOn")
	.dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$776, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$776, DW_AT_decl_line(0x89)
	.dwattr $C$DW$776, DW_AT_decl_column(0x20)

$C$DW$777	.dwtag  DW_TAG_member
	.dwattr $C$DW$777, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$777, DW_AT_name("StateResetCnt")
	.dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$777, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$777, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$777, DW_AT_decl_column(0x20)

$C$DW$778	.dwtag  DW_TAG_member
	.dwattr $C$DW$778, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$778, DW_AT_name("PackDir")
	.dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$778, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$778, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$778, DW_AT_decl_column(0x20)

$C$DW$779	.dwtag  DW_TAG_member
	.dwattr $C$DW$779, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$779, DW_AT_name("ControlWord")
	.dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$779, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$779, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$779, DW_AT_decl_column(0x20)

$C$DW$780	.dwtag  DW_TAG_member
	.dwattr $C$DW$780, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$780, DW_AT_name("ResetMotors")
	.dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$780, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$780, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$780, DW_AT_decl_column(0x20)

$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$781, DW_AT_name("ForceManualBrakeMode")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$781, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$781, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$781, DW_AT_decl_column(0x20)

$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$782, DW_AT_name("ManualBrakeReleaseCmd")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$782, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$782, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$782, DW_AT_decl_column(0x20)

$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$783, DW_AT_name("PinMotorCurrentAmp")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$783, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$783, DW_AT_decl_line(0x90)
	.dwattr $C$DW$783, DW_AT_decl_column(0x17)

$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$784, DW_AT_name("PalletAngle")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$784, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$784, DW_AT_decl_line(0x91)
	.dwattr $C$DW$784, DW_AT_decl_column(0x17)

$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$785, DW_AT_name("Flexmm")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$785, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$785, DW_AT_decl_line(0x92)
	.dwattr $C$DW$785, DW_AT_decl_column(0x17)

$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$786, DW_AT_name("DoorAngle")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$786, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$786, DW_AT_decl_line(0x93)
	.dwattr $C$DW$786, DW_AT_decl_column(0x20)

$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$787, DW_AT_name("GoToCntr")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$787, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$787, DW_AT_decl_line(0x94)
	.dwattr $C$DW$787, DW_AT_decl_column(0x17)

$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$286)
	.dwattr $C$DW$788, DW_AT_name("PsCmd")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$788, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$788, DW_AT_decl_line(0x95)
	.dwattr $C$DW$788, DW_AT_decl_column(0x1f)

$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$789, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$789, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$789, DW_AT_decl_line(0x96)
	.dwattr $C$DW$789, DW_AT_decl_column(0x20)

$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$790, DW_AT_name("bSerialFlashOwner")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$790, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$790, DW_AT_decl_line(0x97)
	.dwattr $C$DW$790, DW_AT_decl_column(0x20)

$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$791, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$791, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x98)
	.dwattr $C$DW$791, DW_AT_decl_column(0x20)

$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$792, DW_AT_name("MalinkiSetCmd")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$792, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x99)
	.dwattr $C$DW$792, DW_AT_decl_column(0x17)

$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$793, DW_AT_name("ObsoletePdCommandPdo")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$793, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$793, DW_AT_decl_column(0x1f)

$C$DW$794	.dwtag  DW_TAG_member
	.dwattr $C$DW$794, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$794, DW_AT_name("AssumedPackagePositionX")
	.dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$794, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$794, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$794, DW_AT_decl_column(0x0b)

$C$DW$795	.dwtag  DW_TAG_member
	.dwattr $C$DW$795, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$795, DW_AT_name("AssumedPackagePositionY")
	.dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$795, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$795, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$795, DW_AT_decl_column(0x0b)

$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$796, DW_AT_name("bGrantNeckControl")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$796, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$796, DW_AT_decl_column(0x0b)

$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$797, DW_AT_name("bGrantWheelControl")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$797, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$797, DW_AT_decl_column(0x17)

$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$798, DW_AT_name("NeckAngle")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$798, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$798, DW_AT_decl_column(0x17)

$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$799, DW_AT_name("PlatRoll")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$799, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$799, DW_AT_decl_column(0x17)

$C$DW$800	.dwtag  DW_TAG_member
	.dwattr $C$DW$800, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$800, DW_AT_name("PlatPitch")
	.dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$800, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$800, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$800, DW_AT_decl_column(0x17)

$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$801, DW_AT_name("RobotPositionM")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$801, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$801, DW_AT_decl_column(0x17)

$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$802, DW_AT_name("NeckIncidenceAngle")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$802, DW_AT_decl_column(0x17)

$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$803, DW_AT_name("WheelArmTiltCompensation")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$803, DW_AT_decl_column(0x17)

$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$804, DW_AT_name("PackageSide")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$804, DW_AT_decl_column(0x17)

$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$805, DW_AT_name("SlaveStatus")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$805, DW_AT_decl_column(0x24)

$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$806, DW_AT_name("rsvd")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$806, DW_AT_decl_column(0x17)

$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$807, DW_AT_name("LifeCheck")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$807, DW_AT_decl_column(0x20)

$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$285)
	.dwattr $C$DW$808, DW_AT_name("ModeWord")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$808, DW_AT_decl_column(0x21)

$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$279)
	.dwattr $C$DW$809, DW_AT_name("ConfigWord")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$809, DW_AT_decl_column(0x23)

$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$810, DW_AT_name("Checksum")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0xab)
	.dwattr $C$DW$810, DW_AT_decl_column(0x20)

$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$811, DW_AT_name("InternalBufOffset")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0xac)
	.dwattr $C$DW$811, DW_AT_decl_column(0x20)

$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$812, DW_AT_name("InterBufCnt")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$812, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0xad)
	.dwattr $C$DW$812, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$47

	.dwendtag $C$DW$TU$47


$C$DW$TU$48	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$48

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x400)
$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$813, DW_AT_name("USlaveObject")
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0x84)
	.dwattr $C$DW$813, DW_AT_decl_column(0x0a)

$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$814, DW_AT_name("ActCmd")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$814, DW_AT_decl_column(0x0a)

$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$815, DW_AT_name("Spare")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$815, DW_AT_decl_column(0x0b)

$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$816, DW_AT_name("DataBlock")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$816, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$48

	.dwendtag $C$DW$TU$48


$C$DW$TU$49	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$49

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x0a)
$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$817, DW_AT_name("index")
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$817, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$817, DW_AT_decl_column(0x20)

$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$818, DW_AT_name("subindex")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$818, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$818, DW_AT_decl_column(0x20)

$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$819, DW_AT_name("data_type")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$819, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$819, DW_AT_decl_column(0x17)

$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$820, DW_AT_name("data_len")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$820, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$820, DW_AT_decl_column(0x17)

$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$821, DW_AT_name("isset")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$821, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$821, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$821, DW_AT_decl_column(0x17)

$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$822, DW_AT_name("unused")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$822, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$822, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$822, DW_AT_decl_column(0x17)

$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$823, DW_AT_name("counter")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$823, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$823, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$823, DW_AT_decl_column(0x1f)

$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$824, DW_AT_name("errcode")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$824, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$824, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$824, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$49

	.dwendtag $C$DW$TU$49


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x1a)
$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$825, DW_AT_name("msg")
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$825, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$825, DW_AT_decl_line(0xff)
	.dwattr $C$DW$825, DW_AT_decl_column(0x0e)

$C$DW$826	.dwtag  DW_TAG_member
	.dwattr $C$DW$826, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$826, DW_AT_name("buf")
	.dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$826, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$826, DW_AT_decl_line(0x100)
	.dwattr $C$DW$826, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$827	.dwtag  DW_TAG_member
	.dwattr $C$DW$827, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$827, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$827, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$827, DW_AT_bit_size(0x01)
	.dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$827, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$827, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$827, DW_AT_decl_column(0x1a)

$C$DW$828	.dwtag  DW_TAG_member
	.dwattr $C$DW$828, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$828, DW_AT_name("ManipType")
	.dwattr $C$DW$828, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$828, DW_AT_bit_size(0x06)
	.dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$828, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$828, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$828, DW_AT_decl_column(0x1a)

$C$DW$829	.dwtag  DW_TAG_member
	.dwattr $C$DW$829, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$829, DW_AT_name("Homed")
	.dwattr $C$DW$829, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$829, DW_AT_bit_size(0x01)
	.dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$829, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$829, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$829, DW_AT_decl_column(0x1a)

$C$DW$830	.dwtag  DW_TAG_member
	.dwattr $C$DW$830, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$830, DW_AT_name("Individual")
	.dwattr $C$DW$830, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$830, DW_AT_bit_size(0x01)
	.dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$830, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$830, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$830, DW_AT_decl_column(0x1a)

$C$DW$831	.dwtag  DW_TAG_member
	.dwattr $C$DW$831, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$831, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$831, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$831, DW_AT_bit_size(0x01)
	.dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$831, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$831, DW_AT_decl_line(0xca)
	.dwattr $C$DW$831, DW_AT_decl_column(0x1a)

$C$DW$832	.dwtag  DW_TAG_member
	.dwattr $C$DW$832, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$832, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$832, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$832, DW_AT_bit_size(0x01)
	.dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$832, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$832, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$832, DW_AT_decl_column(0x1a)

$C$DW$833	.dwtag  DW_TAG_member
	.dwattr $C$DW$833, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$833, DW_AT_name("rsvd")
	.dwattr $C$DW$833, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$833, DW_AT_bit_size(0x05)
	.dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$833, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$833, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$833, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$53	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$53

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
$C$DW$834	.dwtag  DW_TAG_member
	.dwattr $C$DW$834, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$834, DW_AT_name("lo")
	.dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$834, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$834, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$834, DW_AT_decl_column(0x18)

$C$DW$835	.dwtag  DW_TAG_member
	.dwattr $C$DW$835, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$835, DW_AT_name("hi")
	.dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$835, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$835, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$835, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$53

	.dwendtag $C$DW$TU$53


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
$C$DW$836	.dwtag  DW_TAG_member
	.dwattr $C$DW$836, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$836, DW_AT_name("PumpCmd")
	.dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$836, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$836, DW_AT_decl_line(0x106)
	.dwattr $C$DW$836, DW_AT_decl_column(0x17)

$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$837, DW_AT_name("LaserCmd")
	.dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$837, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$837, DW_AT_decl_line(0x107)
	.dwattr $C$DW$837, DW_AT_decl_column(0x17)

$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$287)
	.dwattr $C$DW$838, DW_AT_name("PsStatus")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$838, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$838, DW_AT_decl_line(0x108)
	.dwattr $C$DW$838, DW_AT_decl_column(0x21)

$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$280)
	.dwattr $C$DW$839, DW_AT_name("CoreId")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$839, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$839, DW_AT_decl_line(0x109)
	.dwattr $C$DW$839, DW_AT_decl_column(0x1f)

$C$DW$840	.dwtag  DW_TAG_member
	.dwattr $C$DW$840, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$840, DW_AT_name("LaserDistance")
	.dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$840, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$840, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$840, DW_AT_decl_column(0x17)

$C$DW$841	.dwtag  DW_TAG_member
	.dwattr $C$DW$841, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$841, DW_AT_name("ManipulatorX")
	.dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$841, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$841, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$841, DW_AT_decl_column(0x17)

$C$DW$842	.dwtag  DW_TAG_member
	.dwattr $C$DW$842, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$842, DW_AT_name("ManipulatorY")
	.dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$842, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$842, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$842, DW_AT_decl_column(0x17)

$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$843, DW_AT_name("ManipulatorAngleRad")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$843, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$843, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$843, DW_AT_decl_column(0x17)

$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$844, DW_AT_name("LifeTracker")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$844, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$844, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$844, DW_AT_decl_column(0x20)

$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$845, DW_AT_name("AxisReadout")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$845, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$845, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$845, DW_AT_decl_column(0x17)

$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$846, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0x110)
	.dwattr $C$DW$846, DW_AT_decl_column(0x17)

$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$847, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0x111)
	.dwattr $C$DW$847, DW_AT_decl_column(0x17)

$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$848, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0x112)
	.dwattr $C$DW$848, DW_AT_decl_column(0x17)

$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$849, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0x113)
	.dwattr $C$DW$849, DW_AT_decl_column(0x17)

$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$850, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0x114)
	.dwattr $C$DW$850, DW_AT_decl_column(0x17)

$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$851, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$851, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$851, DW_AT_decl_line(0x115)
	.dwattr $C$DW$851, DW_AT_decl_column(0x17)

$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$852, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$852, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$852, DW_AT_decl_line(0x116)
	.dwattr $C$DW$852, DW_AT_decl_column(0x17)

$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$853, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$853, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$853, DW_AT_decl_line(0x117)
	.dwattr $C$DW$853, DW_AT_decl_column(0x17)

$C$DW$854	.dwtag  DW_TAG_member
	.dwattr $C$DW$854, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$854, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$854, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$854, DW_AT_decl_line(0x118)
	.dwattr $C$DW$854, DW_AT_decl_column(0x17)

$C$DW$855	.dwtag  DW_TAG_member
	.dwattr $C$DW$855, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$855, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$855, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$855, DW_AT_decl_line(0x119)
	.dwattr $C$DW$855, DW_AT_decl_column(0x17)

$C$DW$856	.dwtag  DW_TAG_member
	.dwattr $C$DW$856, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$856, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$856, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$856, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$856, DW_AT_decl_column(0x17)

$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$288)
	.dwattr $C$DW$857, DW_AT_name("SlaveStat")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$857, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$857, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$857, DW_AT_decl_column(0x26)

$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$858, DW_AT_name("IsOperational")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$858, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$858, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$858, DW_AT_decl_column(0x17)

$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$859, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$859, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$859, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$859, DW_AT_decl_column(0x17)

$C$DW$860	.dwtag  DW_TAG_member
	.dwattr $C$DW$860, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$860, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$860, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$860, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$860, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
$C$DW$861	.dwtag  DW_TAG_member
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$861, DW_AT_name("buf")
	.dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$861, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$861, DW_AT_decl_line(0x126)
	.dwattr $C$DW$861, DW_AT_decl_column(0x1b)

$C$DW$862	.dwtag  DW_TAG_member
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$862, DW_AT_name("flags")
	.dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$862, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$862, DW_AT_decl_line(0x127)
	.dwattr $C$DW$862, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
$C$DW$863	.dwtag  DW_TAG_member
	.dwattr $C$DW$863, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$863, DW_AT_name("RStatus")
	.dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$863, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$863, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$863, DW_AT_decl_column(0x25)

$C$DW$864	.dwtag  DW_TAG_member
	.dwattr $C$DW$864, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$864, DW_AT_name("RPinPos")
	.dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$864, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$864, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$864, DW_AT_decl_column(0x17)

$C$DW$865	.dwtag  DW_TAG_member
	.dwattr $C$DW$865, DW_AT_type(*$C$DW$T$291)
	.dwattr $C$DW$865, DW_AT_name("LStatus")
	.dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$865, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$865, DW_AT_decl_line(0x130)
	.dwattr $C$DW$865, DW_AT_decl_column(0x25)

$C$DW$866	.dwtag  DW_TAG_member
	.dwattr $C$DW$866, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$866, DW_AT_name("LPinPos")
	.dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$866, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$866, DW_AT_decl_line(0x131)
	.dwattr $C$DW$866, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
$C$DW$867	.dwtag  DW_TAG_member
	.dwattr $C$DW$867, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$867, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$867, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$867, DW_AT_decl_line(0x139)
	.dwattr $C$DW$867, DW_AT_decl_column(0x20)

$C$DW$868	.dwtag  DW_TAG_member
	.dwattr $C$DW$868, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$868, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$868, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$868, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$868, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0c)
$C$DW$869	.dwtag  DW_TAG_member
	.dwattr $C$DW$869, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$869, DW_AT_name("DataFromPd")
	.dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$869, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$869, DW_AT_decl_line(0x142)
	.dwattr $C$DW$869, DW_AT_decl_column(0x1f)

$C$DW$870	.dwtag  DW_TAG_member
	.dwattr $C$DW$870, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$870, DW_AT_name("Rsvd")
	.dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$870, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$870, DW_AT_decl_line(0x143)
	.dwattr $C$DW$870, DW_AT_decl_column(0x17)

$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$871, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$871, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$871, DW_AT_decl_line(0x144)
	.dwattr $C$DW$871, DW_AT_decl_column(0x18)

$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$872, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$872, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$872, DW_AT_decl_line(0x145)
	.dwattr $C$DW$872, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$63	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$63

$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x10)
$C$DW$873	.dwtag  DW_TAG_member
	.dwattr $C$DW$873, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$873, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$873, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$873, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$873, DW_AT_decl_column(0x21)

$C$DW$874	.dwtag  DW_TAG_member
	.dwattr $C$DW$874, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$874, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$874, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$874, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$874, DW_AT_decl_column(0x20)

$C$DW$875	.dwtag  DW_TAG_member
	.dwattr $C$DW$875, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$875, DW_AT_name("EEFVer")
	.dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$875, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$875, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$875, DW_AT_decl_column(0x20)

$C$DW$876	.dwtag  DW_TAG_member
	.dwattr $C$DW$876, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$876, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$876, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$876, DW_AT_decl_line(0x150)
	.dwattr $C$DW$876, DW_AT_decl_column(0x17)

$C$DW$877	.dwtag  DW_TAG_member
	.dwattr $C$DW$877, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$877, DW_AT_name("TrayRev")
	.dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$877, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$877, DW_AT_decl_line(0x151)
	.dwattr $C$DW$877, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$63

	.dwendtag $C$DW$TU$63


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x40a)
$C$DW$878	.dwtag  DW_TAG_member
	.dwattr $C$DW$878, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$878, DW_AT_name("USlaveObject")
	.dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$878, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$878, DW_AT_decl_line(0x101)
	.dwattr $C$DW$878, DW_AT_decl_column(0x0a)

$C$DW$879	.dwtag  DW_TAG_member
	.dwattr $C$DW$879, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$879, DW_AT_name("ActStatus")
	.dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$879, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$879, DW_AT_decl_line(0x123)
	.dwattr $C$DW$879, DW_AT_decl_column(0x0a)

$C$DW$880	.dwtag  DW_TAG_member
	.dwattr $C$DW$880, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$880, DW_AT_name("Records")
	.dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$880, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$880, DW_AT_decl_line(0x128)
	.dwattr $C$DW$880, DW_AT_decl_column(0x0b)

$C$DW$881	.dwtag  DW_TAG_member
	.dwattr $C$DW$881, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$881, DW_AT_name("WheelArm")
	.dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$881, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$881, DW_AT_decl_line(0x133)
	.dwattr $C$DW$881, DW_AT_decl_column(0x0b)

$C$DW$882	.dwtag  DW_TAG_member
	.dwattr $C$DW$882, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$882, DW_AT_name("UFlashToken")
	.dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$882, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$882, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$882, DW_AT_decl_column(0x0b)

$C$DW$883	.dwtag  DW_TAG_member
	.dwattr $C$DW$883, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$883, DW_AT_name("DataFromPd")
	.dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$883, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$883, DW_AT_decl_line(0x147)
	.dwattr $C$DW$883, DW_AT_decl_column(0x0b)

$C$DW$884	.dwtag  DW_TAG_member
	.dwattr $C$DW$884, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$884, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$884, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$884, DW_AT_decl_line(0x153)
	.dwattr $C$DW$884, DW_AT_decl_column(0x0b)

$C$DW$885	.dwtag  DW_TAG_member
	.dwattr $C$DW$885, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$885, DW_AT_name("RobotControl")
	.dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$885, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$885, DW_AT_decl_line(0x158)
	.dwattr $C$DW$885, DW_AT_decl_column(0x0b)

$C$DW$886	.dwtag  DW_TAG_member
	.dwattr $C$DW$886, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$886, DW_AT_name("Spare")
	.dwattr $C$DW$886, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$886, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$886, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$886, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$886, DW_AT_decl_column(0x0b)

$C$DW$887	.dwtag  DW_TAG_member
	.dwattr $C$DW$887, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$887, DW_AT_name("DataBlock")
	.dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$887, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$887, DW_AT_decl_line(0x160)
	.dwattr $C$DW$887, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$888	.dwtag  DW_TAG_member
	.dwattr $C$DW$888, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$888, DW_AT_name("WaitingForInitialGrip")
	.dwattr $C$DW$888, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$888, DW_AT_bit_size(0x01)
	.dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$888, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$888, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$888, DW_AT_decl_column(0x20)

$C$DW$889	.dwtag  DW_TAG_member
	.dwattr $C$DW$889, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$889, DW_AT_name("WaitingForFullGrip")
	.dwattr $C$DW$889, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$889, DW_AT_bit_size(0x01)
	.dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$889, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$889, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$889, DW_AT_decl_column(0x20)

$C$DW$890	.dwtag  DW_TAG_member
	.dwattr $C$DW$890, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$890, DW_AT_name("FullyGripped")
	.dwattr $C$DW$890, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$890, DW_AT_bit_size(0x01)
	.dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$890, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$890, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$890, DW_AT_decl_column(0x20)

$C$DW$891	.dwtag  DW_TAG_member
	.dwattr $C$DW$891, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$891, DW_AT_name("WaitingForRelease")
	.dwattr $C$DW$891, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$891, DW_AT_bit_size(0x01)
	.dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$891, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$891, DW_AT_decl_line(0x29f)
	.dwattr $C$DW$891, DW_AT_decl_column(0x20)

$C$DW$892	.dwtag  DW_TAG_member
	.dwattr $C$DW$892, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$892, DW_AT_name("Fullyreleased")
	.dwattr $C$DW$892, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$892, DW_AT_bit_size(0x01)
	.dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$892, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$892, DW_AT_decl_line(0x2a0)
	.dwattr $C$DW$892, DW_AT_decl_column(0x20)

$C$DW$893	.dwtag  DW_TAG_member
	.dwattr $C$DW$893, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$893, DW_AT_name("GripError")
	.dwattr $C$DW$893, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$893, DW_AT_bit_size(0x01)
	.dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$893, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$893, DW_AT_decl_line(0x2a1)
	.dwattr $C$DW$893, DW_AT_decl_column(0x20)

$C$DW$894	.dwtag  DW_TAG_member
	.dwattr $C$DW$894, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$894, DW_AT_name("ReleaseError")
	.dwattr $C$DW$894, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$894, DW_AT_bit_size(0x01)
	.dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$894, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$894, DW_AT_decl_line(0x2a2)
	.dwattr $C$DW$894, DW_AT_decl_column(0x20)

$C$DW$895	.dwtag  DW_TAG_member
	.dwattr $C$DW$895, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$895, DW_AT_name("spare1")
	.dwattr $C$DW$895, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$895, DW_AT_bit_size(0x09)
	.dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$895, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$895, DW_AT_decl_line(0x2a3)
	.dwattr $C$DW$895, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$66	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$66

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$896	.dwtag  DW_TAG_member
	.dwattr $C$DW$896, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$896, DW_AT_name("S_MAN_HOLDS_ACTIVE_STICKY")
	.dwattr $C$DW$896, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$896, DW_AT_bit_size(0x01)
	.dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$896, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$896, DW_AT_decl_line(0x2ab)
	.dwattr $C$DW$896, DW_AT_decl_column(0x20)

$C$DW$897	.dwtag  DW_TAG_member
	.dwattr $C$DW$897, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$897, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT")
	.dwattr $C$DW$897, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$897, DW_AT_bit_size(0x01)
	.dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$897, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$897, DW_AT_decl_line(0x2ac)
	.dwattr $C$DW$897, DW_AT_decl_column(0x20)

$C$DW$898	.dwtag  DW_TAG_member
	.dwattr $C$DW$898, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$898, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP")
	.dwattr $C$DW$898, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$898, DW_AT_bit_size(0x01)
	.dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$898, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$898, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$898, DW_AT_decl_column(0x20)

$C$DW$899	.dwtag  DW_TAG_member
	.dwattr $C$DW$899, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$899, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_STICKY")
	.dwattr $C$DW$899, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$899, DW_AT_bit_size(0x01)
	.dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$899, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$899, DW_AT_decl_line(0x2ae)
	.dwattr $C$DW$899, DW_AT_decl_column(0x20)

$C$DW$900	.dwtag  DW_TAG_member
	.dwattr $C$DW$900, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$900, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP_STICKY")
	.dwattr $C$DW$900, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$900, DW_AT_bit_size(0x01)
	.dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$900, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$900, DW_AT_decl_line(0x2af)
	.dwattr $C$DW$900, DW_AT_decl_column(0x20)

$C$DW$901	.dwtag  DW_TAG_member
	.dwattr $C$DW$901, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$901, DW_AT_name("S_MAN_HOLDS_INACTIVE")
	.dwattr $C$DW$901, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$901, DW_AT_bit_size(0x01)
	.dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$901, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$901, DW_AT_decl_line(0x2b0)
	.dwattr $C$DW$901, DW_AT_decl_column(0x20)

$C$DW$902	.dwtag  DW_TAG_member
	.dwattr $C$DW$902, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$902, DW_AT_name("spare1")
	.dwattr $C$DW$902, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$902, DW_AT_bit_size(0x01)
	.dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$902, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$902, DW_AT_decl_line(0x2b1)
	.dwattr $C$DW$902, DW_AT_decl_column(0x20)

$C$DW$903	.dwtag  DW_TAG_member
	.dwattr $C$DW$903, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$903, DW_AT_name("spare2")
	.dwattr $C$DW$903, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$903, DW_AT_bit_size(0x09)
	.dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$903, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$903, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$903, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x2aa)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$66

	.dwendtag $C$DW$TU$66


$C$DW$TU$67	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$67

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$904	.dwtag  DW_TAG_member
	.dwattr $C$DW$904, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$904, DW_AT_name("LaserMedianValid")
	.dwattr $C$DW$904, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$904, DW_AT_bit_size(0x01)
	.dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$904, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$904, DW_AT_decl_line(0x2bb)
	.dwattr $C$DW$904, DW_AT_decl_column(0x20)

$C$DW$905	.dwtag  DW_TAG_member
	.dwattr $C$DW$905, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$905, DW_AT_name("LedOn")
	.dwattr $C$DW$905, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$905, DW_AT_bit_size(0x01)
	.dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$905, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$905, DW_AT_decl_line(0x2bc)
	.dwattr $C$DW$905, DW_AT_decl_column(0x20)

$C$DW$906	.dwtag  DW_TAG_member
	.dwattr $C$DW$906, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$906, DW_AT_name("LaserOn")
	.dwattr $C$DW$906, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$906, DW_AT_bit_size(0x01)
	.dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$906, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$906, DW_AT_decl_line(0x2bd)
	.dwattr $C$DW$906, DW_AT_decl_column(0x20)

$C$DW$907	.dwtag  DW_TAG_member
	.dwattr $C$DW$907, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$907, DW_AT_name("PumpsOn")
	.dwattr $C$DW$907, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$907, DW_AT_bit_size(0x01)
	.dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$907, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$907, DW_AT_decl_line(0x2be)
	.dwattr $C$DW$907, DW_AT_decl_column(0x20)

$C$DW$908	.dwtag  DW_TAG_member
	.dwattr $C$DW$908, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$908, DW_AT_name("ReleaseValvesOn")
	.dwattr $C$DW$908, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$908, DW_AT_bit_size(0x01)
	.dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$908, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$908, DW_AT_decl_line(0x2bf)
	.dwattr $C$DW$908, DW_AT_decl_column(0x20)

$C$DW$909	.dwtag  DW_TAG_member
	.dwattr $C$DW$909, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$909, DW_AT_name("SolenoidValveOn1")
	.dwattr $C$DW$909, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$909, DW_AT_bit_size(0x01)
	.dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$909, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$909, DW_AT_decl_line(0x2c0)
	.dwattr $C$DW$909, DW_AT_decl_column(0x20)

$C$DW$910	.dwtag  DW_TAG_member
	.dwattr $C$DW$910, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$910, DW_AT_name("SolenoidValveOn2")
	.dwattr $C$DW$910, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$910, DW_AT_bit_size(0x01)
	.dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$910, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$910, DW_AT_decl_line(0x2c1)
	.dwattr $C$DW$910, DW_AT_decl_column(0x20)

$C$DW$911	.dwtag  DW_TAG_member
	.dwattr $C$DW$911, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$911, DW_AT_name("SolenoidValveOn3")
	.dwattr $C$DW$911, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$911, DW_AT_bit_size(0x01)
	.dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$911, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$911, DW_AT_decl_line(0x2c2)
	.dwattr $C$DW$911, DW_AT_decl_column(0x20)

$C$DW$912	.dwtag  DW_TAG_member
	.dwattr $C$DW$912, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$912, DW_AT_name("SolenoidValveOn4")
	.dwattr $C$DW$912, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$912, DW_AT_bit_size(0x01)
	.dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$912, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$912, DW_AT_decl_line(0x2c3)
	.dwattr $C$DW$912, DW_AT_decl_column(0x20)

$C$DW$913	.dwtag  DW_TAG_member
	.dwattr $C$DW$913, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$913, DW_AT_name("SolenoidValveOn5")
	.dwattr $C$DW$913, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$913, DW_AT_bit_size(0x01)
	.dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$913, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$913, DW_AT_decl_line(0x2c4)
	.dwattr $C$DW$913, DW_AT_decl_column(0x20)

