;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Tue Oct  8 21:28:16 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../F2838x_driverlib/driverlib/mcbsp.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2R3\CPU2")
;	C:\ti\ccs1250\ccs\tools\compiler\ti-cgt-c2000_22.6.1.LTS\bin\acia2000.exe -@C:\\Users\\yahal\\AppData\\Local\\Temp\\{6719057D-24EA-4230-B239-559CB05094C4} 
	.sect	".text:McBSP_disableLoopback"
	.clink

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("McBSP_disableLoopback")
	.dwattr $C$DW$1, DW_AT_low_pc(||McBSP_disableLoopback||)
	.dwattr $C$DW$1, DW_AT_high_pc(0x00)
	.dwattr $C$DW$1, DW_AT_linkage_name("McBSP_disableLoopback")

	.dwattr $C$DW$T$70, DW_AT_decl_line(0x154)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$70


$C$DW$TU$89	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$89
$C$DW$616	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$70)

$C$DW$T$89	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$616)

	.dwendtag $C$DW$TU$89


$C$DW$TU$86	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$86

$C$DW$T$86	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
$C$DW$617	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$617, DW_AT_name("MCBSP_PARTITION_BLOCK_0")
	.dwattr $C$DW$617, DW_AT_const_value(0x00)
	.dwattr $C$DW$617, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x140)
	.dwattr $C$DW$617, DW_AT_decl_column(0x05)

$C$DW$618	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$618, DW_AT_name("MCBSP_PARTITION_BLOCK_1")
	.dwattr $C$DW$618, DW_AT_const_value(0x01)
	.dwattr $C$DW$618, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x141)
	.dwattr $C$DW$618, DW_AT_decl_column(0x05)

$C$DW$619	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$619, DW_AT_name("MCBSP_PARTITION_BLOCK_2")
	.dwattr $C$DW$619, DW_AT_const_value(0x02)
	.dwattr $C$DW$619, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x142)
	.dwattr $C$DW$619, DW_AT_decl_column(0x05)

$C$DW$620	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$620, DW_AT_name("MCBSP_PARTITION_BLOCK_3")
	.dwattr $C$DW$620, DW_AT_const_value(0x03)
	.dwattr $C$DW$620, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x143)
	.dwattr $C$DW$620, DW_AT_decl_column(0x05)

$C$DW$621	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$621, DW_AT_name("MCBSP_PARTITION_BLOCK_4")
	.dwattr $C$DW$621, DW_AT_const_value(0x04)
	.dwattr $C$DW$621, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x144)
	.dwattr $C$DW$621, DW_AT_decl_column(0x05)

$C$DW$622	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$622, DW_AT_name("MCBSP_PARTITION_BLOCK_5")
	.dwattr $C$DW$622, DW_AT_const_value(0x05)
	.dwattr $C$DW$622, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x145)
	.dwattr $C$DW$622, DW_AT_decl_column(0x05)

$C$DW$623	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$623, DW_AT_name("MCBSP_PARTITION_BLOCK_6")
	.dwattr $C$DW$623, DW_AT_const_value(0x06)
	.dwattr $C$DW$623, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x146)
	.dwattr $C$DW$623, DW_AT_decl_column(0x05)

$C$DW$624	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$624, DW_AT_name("MCBSP_PARTITION_BLOCK_7")
	.dwattr $C$DW$624, DW_AT_const_value(0x07)
	.dwattr $C$DW$624, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x147)
	.dwattr $C$DW$624, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$86, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$86

	.dwendtag $C$DW$TU$86


$C$DW$TU$87	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$87
$C$DW$T$87	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$87, DW_AT_name("McBSP_PartitionBlock")
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x148)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$87


$C$DW$TU$88	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$88
$C$DW$625	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$87)

$C$DW$T$88	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$625)

	.dwendtag $C$DW$TU$88


$C$DW$TU$99	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$99

$C$DW$T$99	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x01)
$C$DW$626	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$626, DW_AT_name("MCBSP_PHASE_ONE_FRAME")
	.dwattr $C$DW$626, DW_AT_const_value(0x00)
	.dwattr $C$DW$626, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$626, DW_AT_decl_column(0x05)

$C$DW$627	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$627, DW_AT_name("MCBSP_PHASE_TWO_FRAME")
	.dwattr $C$DW$627, DW_AT_const_value(0x01)
	.dwattr $C$DW$627, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$627, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$99, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$99

	.dwendtag $C$DW$TU$99


$C$DW$TU$100	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$100
$C$DW$T$100	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$100, DW_AT_name("McBSP_DataPhaseFrame")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$100


$C$DW$TU$101	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$101
$C$DW$628	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$100)

$C$DW$T$101	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$628)

	.dwendtag $C$DW$TU$101


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$629, DW_AT_name("clockSRGSyncFlag")
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$629, DW_AT_decl_column(0x0a)

$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$630, DW_AT_name("clockSRGDivider")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$630, DW_AT_decl_column(0x0e)

$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$631, DW_AT_name("clockSourceTx")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$631, DW_AT_decl_column(0x19)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$632, DW_AT_name("clockSourceRx")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$632, DW_AT_decl_column(0x19)

$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$633, DW_AT_name("clockRxSRGSource")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1c)

$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$634, DW_AT_name("clockTxSRGSource")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1c)

$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$635, DW_AT_name("clockMCLKXPolarity")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1b)

$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$636, DW_AT_name("clockMCLKRPolarity")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$636, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$34

	.dwendtag $C$DW$TU$34


$C$DW$TU$103	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$103
$C$DW$T$103	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$103, DW_AT_name("McBSP_ClockParams")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$103, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$103


$C$DW$TU$104	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$104
$C$DW$637	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$103)

$C$DW$T$104	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$637)

	.dwendtag $C$DW$TU$104


$C$DW$TU$105	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$105
$C$DW$T$105	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$105, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$105


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x07)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$638, DW_AT_name("syncSRGSyncFSRFlag")
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$638, DW_AT_decl_column(0x0a)

$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$639, DW_AT_name("syncErrorDetect")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$639, DW_AT_decl_column(0x0a)

$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$640, DW_AT_name("syncClockDivider")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$640, DW_AT_decl_column(0x0e)

$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$641, DW_AT_name("syncPulseDivider")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x1f5)
	.dwattr $C$DW$641, DW_AT_decl_column(0x0e)

$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$642, DW_AT_name("syncSourceTx")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1d)

$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$643, DW_AT_name("syncIntSource")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$643, DW_AT_decl_column(0x25)

$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$644, DW_AT_name("syncFSXPolarity")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$644, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$41

	.dwendtag $C$DW$TU$41


$C$DW$TU$106	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$106
$C$DW$T$106	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$106, DW_AT_name("McBSP_TxFsyncParams")
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$106, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$106, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$T$106, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$106


$C$DW$TU$107	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$107
$C$DW$645	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$106)

$C$DW$T$107	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$645)

	.dwendtag $C$DW$TU$107


$C$DW$TU$108	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$108
$C$DW$T$108	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$108


$C$DW$TU$46	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$46

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x06)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$646, DW_AT_name("syncSRGSyncFSRFlag")
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x203)
	.dwattr $C$DW$646, DW_AT_decl_column(0x0a)

$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$647, DW_AT_name("syncErrorDetect")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0x204)
	.dwattr $C$DW$647, DW_AT_decl_column(0x0a)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$648, DW_AT_name("syncClockDivider")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0x205)
	.dwattr $C$DW$648, DW_AT_decl_column(0x0e)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$649, DW_AT_name("syncPulseDivider")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0x206)
	.dwattr $C$DW$649, DW_AT_decl_column(0x0e)

$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$650, DW_AT_name("syncSourceRx")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0x207)
	.dwattr $C$DW$650, DW_AT_decl_column(0x1d)

$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$651, DW_AT_name("syncFSRPolarity")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0x208)
	.dwattr $C$DW$651, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$46, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x202)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

	.dwendtag $C$DW$TU$46


$C$DW$TU$109	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$109
$C$DW$T$109	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$109, DW_AT_name("McBSP_RxFsyncParams")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$109, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x209)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$109


$C$DW$TU$110	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$110
$C$DW$652	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$109)

$C$DW$T$110	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$652)

	.dwendtag $C$DW$TU$110


$C$DW$TU$111	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$111
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$111


$C$DW$TU$57	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$57

$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x0b)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$653, DW_AT_name("loopbackModeFlag")
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0x213)
	.dwattr $C$DW$653, DW_AT_decl_column(0x0a)

$C$DW$654	.dwtag  DW_TAG_member
	.dwattr $C$DW$654, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$654, DW_AT_name("twoPhaseModeFlag")
	.dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$654, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$654, DW_AT_decl_line(0x214)
	.dwattr $C$DW$654, DW_AT_decl_column(0x0a)

$C$DW$655	.dwtag  DW_TAG_member
	.dwattr $C$DW$655, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$655, DW_AT_name("pinDelayEnableFlag")
	.dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$655, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$655, DW_AT_decl_line(0x215)
	.dwattr $C$DW$655, DW_AT_decl_column(0x0a)

$C$DW$656	.dwtag  DW_TAG_member
	.dwattr $C$DW$656, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$656, DW_AT_name("phase1FrameLength")
	.dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$656, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$656, DW_AT_decl_line(0x216)
	.dwattr $C$DW$656, DW_AT_decl_column(0x0e)

$C$DW$657	.dwtag  DW_TAG_member
	.dwattr $C$DW$657, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$657, DW_AT_name("phase2FrameLength")
	.dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$657, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$657, DW_AT_decl_line(0x217)
	.dwattr $C$DW$657, DW_AT_decl_column(0x0e)

$C$DW$658	.dwtag  DW_TAG_member
	.dwattr $C$DW$658, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$658, DW_AT_name("clockStopMode")
	.dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$658, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$658, DW_AT_decl_line(0x218)
	.dwattr $C$DW$658, DW_AT_decl_column(0x19)

$C$DW$659	.dwtag  DW_TAG_member
	.dwattr $C$DW$659, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$659, DW_AT_name("phase1WordLength")
	.dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$659, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$659, DW_AT_decl_line(0x219)
	.dwattr $C$DW$659, DW_AT_decl_column(0x1b)

$C$DW$660	.dwtag  DW_TAG_member
	.dwattr $C$DW$660, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$660, DW_AT_name("phase2WordLength")
	.dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$660, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$660, DW_AT_decl_line(0x21a)
	.dwattr $C$DW$660, DW_AT_decl_column(0x1b)

$C$DW$661	.dwtag  DW_TAG_member
	.dwattr $C$DW$661, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$661, DW_AT_name("compandingMode")
	.dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$661, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$661, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$661, DW_AT_decl_column(0x1a)

$C$DW$662	.dwtag  DW_TAG_member
	.dwattr $C$DW$662, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$662, DW_AT_name("dataDelayBits")
	.dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$662, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$662, DW_AT_decl_line(0x21c)
	.dwattr $C$DW$662, DW_AT_decl_column(0x19)

$C$DW$663	.dwtag  DW_TAG_member
	.dwattr $C$DW$663, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$663, DW_AT_name("interruptMode")
	.dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$663, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$663, DW_AT_decl_line(0x21d)
	.dwattr $C$DW$663, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x212)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$57

	.dwendtag $C$DW$TU$57


$C$DW$TU$112	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$112
$C$DW$T$112	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$112, DW_AT_name("McBSP_TxDataParams")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$112, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$112


$C$DW$TU$113	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$113
$C$DW$664	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$664, DW_AT_type(*$C$DW$T$112)

$C$DW$T$113	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$664)

	.dwendtag $C$DW$TU$113


$C$DW$TU$114	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$114
$C$DW$T$114	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$114, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$114


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
$C$DW$665	.dwtag  DW_TAG_member
	.dwattr $C$DW$665, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$665, DW_AT_name("loopbackModeFlag")
	.dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$665, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$665, DW_AT_decl_line(0x228)
	.dwattr $C$DW$665, DW_AT_decl_column(0x0a)

$C$DW$666	.dwtag  DW_TAG_member
	.dwattr $C$DW$666, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$666, DW_AT_name("twoPhaseModeFlag")
	.dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$666, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$666, DW_AT_decl_line(0x229)
	.dwattr $C$DW$666, DW_AT_decl_column(0x0a)

$C$DW$667	.dwtag  DW_TAG_member
	.dwattr $C$DW$667, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$667, DW_AT_name("phase1FrameLength")
	.dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$667, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$667, DW_AT_decl_line(0x22a)
	.dwattr $C$DW$667, DW_AT_decl_column(0x0e)

$C$DW$668	.dwtag  DW_TAG_member
	.dwattr $C$DW$668, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$668, DW_AT_name("phase2FrameLength")
	.dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$668, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$668, DW_AT_decl_line(0x22b)
	.dwattr $C$DW$668, DW_AT_decl_column(0x0e)

$C$DW$669	.dwtag  DW_TAG_member
	.dwattr $C$DW$669, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$669, DW_AT_name("clockStopMode")
	.dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$669, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$669, DW_AT_decl_line(0x22c)
	.dwattr $C$DW$669, DW_AT_decl_column(0x19)

$C$DW$670	.dwtag  DW_TAG_member
	.dwattr $C$DW$670, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$670, DW_AT_name("phase1WordLength")
	.dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$670, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$670, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$670, DW_AT_decl_column(0x1b)

$C$DW$671	.dwtag  DW_TAG_member
	.dwattr $C$DW$671, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$671, DW_AT_name("phase2WordLength")
	.dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$671, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$671, DW_AT_decl_line(0x22e)
	.dwattr $C$DW$671, DW_AT_decl_column(0x1b)

$C$DW$672	.dwtag  DW_TAG_member
	.dwattr $C$DW$672, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$672, DW_AT_name("compandingMode")
	.dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$672, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$672, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$672, DW_AT_decl_column(0x1a)

$C$DW$673	.dwtag  DW_TAG_member
	.dwattr $C$DW$673, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$673, DW_AT_name("dataDelayBits")
	.dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$673, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$673, DW_AT_decl_line(0x230)
	.dwattr $C$DW$673, DW_AT_decl_column(0x19)

$C$DW$674	.dwtag  DW_TAG_member
	.dwattr $C$DW$674, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$674, DW_AT_name("signExtMode")
	.dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$674, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$674, DW_AT_decl_line(0x231)
	.dwattr $C$DW$674, DW_AT_decl_column(0x1f)

$C$DW$675	.dwtag  DW_TAG_member
	.dwattr $C$DW$675, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$675, DW_AT_name("interruptMode")
	.dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$675, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$675, DW_AT_decl_line(0x232)
	.dwattr $C$DW$675, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x227)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$115	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$115
$C$DW$T$115	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$115, DW_AT_name("McBSP_RxDataParams")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$115, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x233)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$115


$C$DW$TU$116	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$116
$C$DW$676	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$676, DW_AT_type(*$C$DW$T$115)

$C$DW$T$116	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$676)

	.dwendtag $C$DW$TU$116


$C$DW$TU$117	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$117
$C$DW$T$117	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$T$117, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$117


$C$DW$TU$68	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$68

$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x06)
$C$DW$677	.dwtag  DW_TAG_member
	.dwattr $C$DW$677, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$677, DW_AT_name("channelCountTx")
	.dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$677, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$677, DW_AT_decl_line(0x24c)
	.dwattr $C$DW$677, DW_AT_decl_column(0x0e)

$C$DW$678	.dwtag  DW_TAG_member
	.dwattr $C$DW$678, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$678, DW_AT_name("ptrChannelsListTx")
	.dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$678, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$678, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$678, DW_AT_decl_column(0x0f)

$C$DW$679	.dwtag  DW_TAG_member
	.dwattr $C$DW$679, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$679, DW_AT_name("multichannelModeTx")
	.dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$679, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$679, DW_AT_decl_line(0x24f)
	.dwattr $C$DW$679, DW_AT_decl_column(0x19)

$C$DW$680	.dwtag  DW_TAG_member
	.dwattr $C$DW$680, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$680, DW_AT_name("partitionTx")
	.dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$680, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$680, DW_AT_decl_line(0x250)
	.dwattr $C$DW$680, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$68, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x24b)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

	.dwendtag $C$DW$TU$68


$C$DW$TU$118	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$118
$C$DW$T$118	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$118, DW_AT_name("McBSP_TxMultichannelParams")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$118, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$118, DW_AT_decl_line(0x251)
	.dwattr $C$DW$T$118, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$118


$C$DW$TU$119	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$119
$C$DW$681	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$681, DW_AT_type(*$C$DW$T$118)

$C$DW$T$119	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$681)

	.dwendtag $C$DW$TU$119


$C$DW$TU$120	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$120
$C$DW$T$120	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$120


$C$DW$TU$71	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$71

$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x06)
$C$DW$682	.dwtag  DW_TAG_member
	.dwattr $C$DW$682, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$682, DW_AT_name("channelCountRx")
	.dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$682, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$682, DW_AT_decl_line(0x23d)
	.dwattr $C$DW$682, DW_AT_decl_column(0x0e)

$C$DW$683	.dwtag  DW_TAG_member
	.dwattr $C$DW$683, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$683, DW_AT_name("ptrChannelsListRx")
	.dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$683, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$683, DW_AT_decl_line(0x23e)
	.dwattr $C$DW$683, DW_AT_decl_column(0x0f)

$C$DW$684	.dwtag  DW_TAG_member
	.dwattr $C$DW$684, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$684, DW_AT_name("multichannelModeRx")
	.dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$684, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$684, DW_AT_decl_line(0x240)
	.dwattr $C$DW$684, DW_AT_decl_column(0x19)

$C$DW$685	.dwtag  DW_TAG_member
	.dwattr $C$DW$685, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$685, DW_AT_name("partitionRx")
	.dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$685, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$685, DW_AT_decl_line(0x241)
	.dwattr $C$DW$685, DW_AT_decl_column(0x21)

	.dwattr $C$DW$T$71, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x23c)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$71

	.dwendtag $C$DW$TU$71


$C$DW$TU$121	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$121
$C$DW$T$121	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$121, DW_AT_name("McBSP_RxMultichannelParams")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$121, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$121, DW_AT_decl_line(0x242)
	.dwattr $C$DW$T$121, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$121


$C$DW$TU$122	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$122
$C$DW$686	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$686, DW_AT_type(*$C$DW$T$121)

$C$DW$T$122	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$686)

	.dwendtag $C$DW$TU$122


$C$DW$TU$123	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$123
$C$DW$T$123	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$T$123, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$123


$C$DW$TU$74	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$74

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x08)
$C$DW$687	.dwtag  DW_TAG_member
	.dwattr $C$DW$687, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$687, DW_AT_name("loopbackModeFlag")
	.dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$687, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$687, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$687, DW_AT_decl_column(0x0a)

$C$DW$688	.dwtag  DW_TAG_member
	.dwattr $C$DW$688, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$688, DW_AT_name("clockSRGDivider")
	.dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$688, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$688, DW_AT_decl_line(0x25c)
	.dwattr $C$DW$688, DW_AT_decl_column(0x0e)

$C$DW$689	.dwtag  DW_TAG_member
	.dwattr $C$DW$689, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$689, DW_AT_name("clockStopMode")
	.dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$689, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$689, DW_AT_decl_line(0x25d)
	.dwattr $C$DW$689, DW_AT_decl_column(0x19)

$C$DW$690	.dwtag  DW_TAG_member
	.dwattr $C$DW$690, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$690, DW_AT_name("wordLength")
	.dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$690, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$690, DW_AT_decl_line(0x25e)
	.dwattr $C$DW$690, DW_AT_decl_column(0x1b)

$C$DW$691	.dwtag  DW_TAG_member
	.dwattr $C$DW$691, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$691, DW_AT_name("spiMode")
	.dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$691, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$691, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$691, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$74, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x25a)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$74

	.dwendtag $C$DW$TU$74


$C$DW$TU$124	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$124
$C$DW$T$124	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$124, DW_AT_name("McBSP_SPIMasterModeParams")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$124, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x261)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x01)

	.dwendtag $C$DW$TU$124


$C$DW$TU$125	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$125
$C$DW$692	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$692, DW_AT_type(*$C$DW$T$124)

$C$DW$T$125	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$692)

	.dwendtag $C$DW$TU$125


$C$DW$TU$126	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$126
$C$DW$T$126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$126, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$126


$C$DW$TU$75	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$75

$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
$C$DW$693	.dwtag  DW_TAG_member
	.dwattr $C$DW$693, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$693, DW_AT_name("loopbackModeFlag")
	.dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$693, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$693, DW_AT_decl_line(0x26b)
	.dwattr $C$DW$693, DW_AT_decl_column(0x0a)

$C$DW$694	.dwtag  DW_TAG_member
	.dwattr $C$DW$694, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$694, DW_AT_name("clockStopMode")
	.dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$694, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$694, DW_AT_decl_line(0x26c)
	.dwattr $C$DW$694, DW_AT_decl_column(0x19)

$C$DW$695	.dwtag  DW_TAG_member
	.dwattr $C$DW$695, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$695, DW_AT_name("wordLength")
	.dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$695, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$695, DW_AT_decl_line(0x26d)
	.dwattr $C$DW$695, DW_AT_decl_column(0x1b)

$C$DW$696	.dwtag  DW_TAG_member
	.dwattr $C$DW$696, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$696, DW_AT_name("spiMode")
	.dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$696, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$696, DW_AT_decl_line(0x26e)
	.dwattr $C$DW$696, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$75, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x26a)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$75

	.dwendtag $C$DW$TU$75


$C$DW$TU$127	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$127
$C$DW$T$127	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$127, DW_AT_name("McBSP_SPISlaveModeParams")
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$127, DW_AT_decl_file("..\F2838x_driverlib\driverlib\mcbsp.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x270)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x01)

	.dwendtag $C$DW$TU$127


$C$DW$TU$128	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$128
$C$DW$697	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$697, DW_AT_type(*$C$DW$T$127)

$C$DW$T$128	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$697)

	.dwendtag $C$DW$TU$128


$C$DW$TU$129	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$129
$C$DW$T$129	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$129, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$129


$C$DW$TU$2	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$2
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

	.dwendtag $C$DW$TU$2


$C$DW$TU$4	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$4
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$4


$C$DW$TU$5	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$5
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$5


$C$DW$TU$6	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$6
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$6


$C$DW$TU$7	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$7
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

	.dwendtag $C$DW$TU$7


$C$DW$TU$8	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$8
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$8


$C$DW$TU$9	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$9
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$9


$C$DW$TU$10	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$10
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$10


$C$DW$TU$11	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$11
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)

	.dwendtag $C$DW$TU$11


$C$DW$TU$20	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$20
$C$DW$T$20	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$20, DW_AT_name("__uint16_t")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccs1250/ccs/tools/compiler/ti-cgt-c2000_22.6.1.LTS/include/machine/_types.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)

