;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Thu Oct 31 13:36:35 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/PsMgr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2R3\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("SetSysTimerTarget")
	.dwattr $C$DW$1, DW_AT_linkage_name("SetSysTimerTarget")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\TimerArr2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x43)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$9)

$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$13)


	.gmember  ".text:CanAxisIsPosition"
	.endgroup
	.group    "DisableRs485Tx_1", 1
	.gmember  ".text:DisableRs485Tx_1"
	.endgroup
	.group    "DisableRs485Tx_2", 1
	.gmember  ".text:DisableRs485Tx_2"
	.endgroup
	.group    "EnableRs485Tx_1", 1
	.gmember  ".text:EnableRs485Tx_1"
	.endgroup
	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "ForceMotorOffAndBrakeRelease", 1
	.gmember  ".text:ForceMotorOffAndBrakeRelease"
	.endgroup
	.group    "ForceMotorOnBrake", 1
	.gmember  ".text:ForceMotorOnBrake"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "InitSuctionNoMonitor", 1
	.gmember  ".text:InitSuctionNoMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsMotorReady", 1
	.gmember  ".text:IsMotorReady"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetBrakeActionAutomatic", 1
	.gmember  ".text:SetBrakeActionAutomatic"
	.endgroup
	.group    "SetCanAxisDisableAutoBrake", 1
	.gmember  ".text:SetCanAxisDisableAutoBrake"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetCanAxisReferenceMode", 1
	.gmember  ".text:SetCanAxisReferenceMode"
	.endgroup
	.group    "SetCanAxisWheelTracksSteering", 1
	.gmember  ".text:SetCanAxisWheelTracksSteering"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetUserManualSpeedTarget", 1
	.gmember  ".text:SetUserManualSpeedTarget"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "StopSuctionNoMonitor", 1
	.gmember  ".text:StopSuctionNoMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$367, DW_AT_name("I2tCntr")
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x108)
	.dwattr $C$DW$367, DW_AT_decl_column(0x18)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$368, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x109)
	.dwattr $C$DW$368, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$369, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$369, DW_AT_decl_column(0x0e)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$370, DW_AT_name("IPC_STS")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$370, DW_AT_decl_column(0x0e)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$371, DW_AT_name("IPC_SET")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$371, DW_AT_decl_column(0x0e)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$372, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$372, DW_AT_decl_column(0x0e)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$373, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$373, DW_AT_decl_column(0x0e)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$374, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$374, DW_AT_decl_column(0x0e)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$375, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$375, DW_AT_decl_column(0x0e)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$376, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$376, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$377	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$377)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$378, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0xed)
	.dwattr $C$DW$378, DW_AT_decl_column(0x0e)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$379, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0xee)
	.dwattr $C$DW$379, DW_AT_decl_column(0x0e)

$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$380, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0xef)
	.dwattr $C$DW$380, DW_AT_decl_column(0x0e)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$381, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$381, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$382	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$382)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$383, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0e)

$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$384, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$384, DW_AT_decl_column(0x0e)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$385, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$385, DW_AT_decl_column(0x0e)

$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$386, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$386, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$387	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$387)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$388, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$388, DW_AT_decl_column(0x0e)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$389, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$389, DW_AT_decl_column(0x0e)

$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$390, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0xff)
	.dwattr $C$DW$390, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$391	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$391)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$392, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x122)
	.dwattr $C$DW$392, DW_AT_decl_column(0x23)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$393, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x123)
	.dwattr $C$DW$393, DW_AT_decl_column(0x23)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$394, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x124)
	.dwattr $C$DW$394, DW_AT_decl_column(0x23)

$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$395, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x125)
	.dwattr $C$DW$395, DW_AT_decl_column(0x23)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$396, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x126)
	.dwattr $C$DW$396, DW_AT_decl_column(0x23)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$397, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x127)
	.dwattr $C$DW$397, DW_AT_decl_column(0x23)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$398, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x128)
	.dwattr $C$DW$398, DW_AT_decl_column(0x23)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$399, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x129)
	.dwattr $C$DW$399, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$212	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$212
$C$DW$T$212	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$212, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$212, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$212, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$212, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$212


$C$DW$TU$213	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$213
$C$DW$400	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$212)

$C$DW$T$213	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$400)

	.dwendtag $C$DW$TU$213


$C$DW$TU$214	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$214

$C$DW$T$214	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
	.dwattr $C$DW$T$214, DW_AT_byte_size(0x78)
$C$DW$401	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$401, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$214

	.dwendtag $C$DW$TU$214


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$402, DW_AT_name("index")
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x79)
	.dwattr $C$DW$402, DW_AT_decl_column(0x20)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$403, DW_AT_name("subindex")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$403, DW_AT_decl_column(0x20)

$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$404, DW_AT_name("data_type")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$404, DW_AT_decl_column(0x20)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$405, DW_AT_name("data_len")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$405, DW_AT_decl_column(0x17)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$406, DW_AT_name("isset")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$406, DW_AT_decl_column(0x17)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$407, DW_AT_name("unused")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$407, DW_AT_decl_column(0x17)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$408, DW_AT_name("counter")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$408, DW_AT_decl_column(0x1f)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$409, DW_AT_name("errcode")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x80)
	.dwattr $C$DW$409, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$410, DW_AT_name("Unused")
	.dwattr $C$DW$410, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$410, DW_AT_bit_size(0x01)
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x58)
	.dwattr $C$DW$410, DW_AT_decl_column(0x16)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$411, DW_AT_name("RebootPsCntr")
	.dwattr $C$DW$411, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$411, DW_AT_bit_size(0x04)
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x59)
	.dwattr $C$DW$411, DW_AT_decl_column(0x16)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$412, DW_AT_name("ManipulatorAxesReboot")
	.dwattr $C$DW$412, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$412, DW_AT_bit_size(0x03)
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$412, DW_AT_decl_column(0x16)

$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$413, DW_AT_name("Rsvd")
	.dwattr $C$DW$413, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$413, DW_AT_bit_size(0x08)
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$413, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$41

	.dwendtag $C$DW$TU$41


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$414, DW_AT_name("rsvd2")
	.dwattr $C$DW$414, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$414, DW_AT_bit_size(0x05)
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$414, DW_AT_decl_column(0x16)

$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$415, DW_AT_name("StoEnabled")
	.dwattr $C$DW$415, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$415, DW_AT_bit_size(0x01)
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$415, DW_AT_decl_column(0x16)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$416, DW_AT_name("StopCan")
	.dwattr $C$DW$416, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$416, DW_AT_bit_size(0x01)
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$416, DW_AT_decl_column(0x16)

$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$417, DW_AT_name("LeftPinCmd")
	.dwattr $C$DW$417, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$417, DW_AT_bit_size(0x02)
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x20)
	.dwattr $C$DW$417, DW_AT_decl_column(0x16)

$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$418, DW_AT_name("RightPinCmd")
	.dwattr $C$DW$418, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$418, DW_AT_bit_size(0x02)
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x21)
	.dwattr $C$DW$418, DW_AT_decl_column(0x16)

$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$419, DW_AT_name("CommRestart")
	.dwattr $C$DW$419, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$419, DW_AT_bit_size(0x01)
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x22)
	.dwattr $C$DW$419, DW_AT_decl_column(0x16)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$420, DW_AT_name("ObsoleteLaserPsOn")
	.dwattr $C$DW$420, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$420, DW_AT_bit_size(0x01)
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x23)
	.dwattr $C$DW$420, DW_AT_decl_column(0x16)

$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$421, DW_AT_name("RecorderTimeBasis")
	.dwattr $C$DW$421, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$421, DW_AT_bit_size(0x01)
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x24)
	.dwattr $C$DW$421, DW_AT_decl_column(0x16)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$422, DW_AT_name("testRs485")
	.dwattr $C$DW$422, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$422, DW_AT_bit_size(0x02)
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x25)
	.dwattr $C$DW$422, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$423, DW_AT_name("rsvd")
	.dwattr $C$DW$423, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$423, DW_AT_bit_size(0x09)
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$423, DW_AT_decl_column(0x16)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$424, DW_AT_name("WheelArmExist")
	.dwattr $C$DW$424, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$424, DW_AT_bit_size(0x01)
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$424, DW_AT_decl_column(0x16)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$425, DW_AT_name("ManipType")
	.dwattr $C$DW$425, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$425, DW_AT_bit_size(0x06)
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x30)
	.dwattr $C$DW$425, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$47	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$47

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x3e)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$426, DW_AT_name("AxesActive")
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x88)
	.dwattr $C$DW$426, DW_AT_decl_column(0x17)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$427, DW_AT_name("ObsoletePumpsOn")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x89)
	.dwattr $C$DW$427, DW_AT_decl_column(0x20)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$428, DW_AT_name("StateResetCnt")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$428, DW_AT_decl_column(0x20)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$429, DW_AT_name("PackDir")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$429, DW_AT_decl_column(0x20)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$430, DW_AT_name("ControlWord")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$430, DW_AT_decl_column(0x20)

$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$431, DW_AT_name("ResetMotors")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$431, DW_AT_decl_column(0x20)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$432, DW_AT_name("ForceManualBrakeMode")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$432, DW_AT_decl_column(0x20)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$433, DW_AT_name("ManualBrakeReleaseCmd")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$433, DW_AT_decl_column(0x20)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$434, DW_AT_name("PinMotorCurrentAmp")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x90)
	.dwattr $C$DW$434, DW_AT_decl_column(0x17)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$435, DW_AT_name("PalletAngle")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x91)
	.dwattr $C$DW$435, DW_AT_decl_column(0x17)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$436, DW_AT_name("Flexmm")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x92)
	.dwattr $C$DW$436, DW_AT_decl_column(0x17)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$437, DW_AT_name("DoorAngle")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x93)
	.dwattr $C$DW$437, DW_AT_decl_column(0x20)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$438, DW_AT_name("GoToCntr")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x94)
	.dwattr $C$DW$438, DW_AT_decl_column(0x17)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$204)
	.dwattr $C$DW$439, DW_AT_name("PsCmd")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x95)
	.dwattr $C$DW$439, DW_AT_decl_column(0x1f)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$440, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x96)
	.dwattr $C$DW$440, DW_AT_decl_column(0x20)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$441, DW_AT_name("bSerialFlashOwner")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x97)
	.dwattr $C$DW$441, DW_AT_decl_column(0x20)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$442, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x98)
	.dwattr $C$DW$442, DW_AT_decl_column(0x20)

$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$443, DW_AT_name("MalinkiSetCmd")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0x99)
	.dwattr $C$DW$443, DW_AT_decl_column(0x17)

$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$444, DW_AT_name("ObsoletePdCommandPdo")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$444, DW_AT_decl_column(0x1f)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$445, DW_AT_name("AssumedPackagePositionX")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$445, DW_AT_decl_column(0x0b)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$446, DW_AT_name("AssumedPackagePositionY")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$446, DW_AT_decl_column(0x0b)

$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$447, DW_AT_name("bGrantNeckControl")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$447, DW_AT_decl_column(0x0b)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$448, DW_AT_name("bGrantWheelControl")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$448, DW_AT_decl_column(0x17)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$449, DW_AT_name("NeckAngle")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$449, DW_AT_decl_column(0x17)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$450, DW_AT_name("PlatRoll")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$450, DW_AT_decl_column(0x17)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$451, DW_AT_name("PlatPitch")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$451, DW_AT_decl_column(0x17)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$452, DW_AT_name("RobotPositionM")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$452, DW_AT_decl_column(0x17)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$453, DW_AT_name("NeckIncidenceAngle")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$453, DW_AT_decl_column(0x17)

$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$454, DW_AT_name("WheelArmTiltCompensation")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$454, DW_AT_decl_column(0x17)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$455, DW_AT_name("PackageSide")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$455, DW_AT_decl_column(0x17)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$207)
	.dwattr $C$DW$456, DW_AT_name("SlaveStatus")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$456, DW_AT_decl_column(0x24)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$457, DW_AT_name("rsvd")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$457, DW_AT_decl_column(0x17)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$458, DW_AT_name("LifeCheck")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$458, DW_AT_decl_column(0x20)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$459, DW_AT_name("ModeWord")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$459, DW_AT_decl_column(0x21)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$460, DW_AT_name("ConfigWord")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$460, DW_AT_decl_column(0x23)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$461, DW_AT_name("Checksum")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0xab)
	.dwattr $C$DW$461, DW_AT_decl_column(0x20)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$462, DW_AT_name("InternalBufOffset")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0xac)
	.dwattr $C$DW$462, DW_AT_decl_column(0x20)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$463, DW_AT_name("InterBufCnt")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0xad)
	.dwattr $C$DW$463, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$47

	.dwendtag $C$DW$TU$47


$C$DW$TU$48	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$48

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x400)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$464, DW_AT_name("USlaveObject")
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x84)
	.dwattr $C$DW$464, DW_AT_decl_column(0x0a)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$465, DW_AT_name("ActCmd")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$465, DW_AT_decl_column(0x0a)

$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$466, DW_AT_name("Spare")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$466, DW_AT_decl_column(0x0b)

$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$467, DW_AT_name("DataBlock")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$467, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$48

	.dwendtag $C$DW$TU$48


$C$DW$TU$49	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$49

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x0a)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$468, DW_AT_name("index")
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$468, DW_AT_decl_column(0x20)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$469, DW_AT_name("subindex")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$469, DW_AT_decl_column(0x20)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$470, DW_AT_name("data_type")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$470, DW_AT_decl_column(0x17)

$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$471, DW_AT_name("data_len")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$471, DW_AT_decl_column(0x17)

$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$472, DW_AT_name("isset")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$472, DW_AT_decl_column(0x17)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$473, DW_AT_name("unused")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$473, DW_AT_decl_column(0x17)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$474, DW_AT_name("counter")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$474, DW_AT_decl_column(0x1f)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$475, DW_AT_name("errcode")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$475, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$49

	.dwendtag $C$DW$TU$49


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x1a)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$476, DW_AT_name("msg")
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0xff)
	.dwattr $C$DW$476, DW_AT_decl_column(0x0e)

$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$477, DW_AT_name("buf")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x100)
	.dwattr $C$DW$477, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$478, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$478, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$478, DW_AT_bit_size(0x01)
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$478, DW_AT_decl_column(0x1a)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$479, DW_AT_name("ManipType")
	.dwattr $C$DW$479, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$479, DW_AT_bit_size(0x06)
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$479, DW_AT_decl_column(0x1a)

$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$480, DW_AT_name("Homed")
	.dwattr $C$DW$480, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$480, DW_AT_bit_size(0x01)
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$480, DW_AT_decl_column(0x1a)

$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$481, DW_AT_name("Individual")
	.dwattr $C$DW$481, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$481, DW_AT_bit_size(0x01)
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$481, DW_AT_decl_column(0x1a)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$482, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$482, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$482, DW_AT_bit_size(0x01)
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0xca)
	.dwattr $C$DW$482, DW_AT_decl_column(0x1a)

$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$483, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$483, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$483, DW_AT_bit_size(0x01)
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$483, DW_AT_decl_column(0x1a)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$484, DW_AT_name("rsvd")
	.dwattr $C$DW$484, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$484, DW_AT_bit_size(0x05)
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$484, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$53	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$53

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$485, DW_AT_name("lo")
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$485, DW_AT_decl_column(0x18)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$486, DW_AT_name("hi")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$486, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$53

	.dwendtag $C$DW$TU$53


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$487, DW_AT_name("PumpCmd")
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x106)
	.dwattr $C$DW$487, DW_AT_decl_column(0x17)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$488, DW_AT_name("LaserCmd")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x107)
	.dwattr $C$DW$488, DW_AT_decl_column(0x17)

$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$205)
	.dwattr $C$DW$489, DW_AT_name("PsStatus")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x108)
	.dwattr $C$DW$489, DW_AT_decl_column(0x21)

$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$198)
	.dwattr $C$DW$490, DW_AT_name("CoreId")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x109)
	.dwattr $C$DW$490, DW_AT_decl_column(0x1f)

$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$491, DW_AT_name("LaserDistance")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$491, DW_AT_decl_column(0x17)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$492, DW_AT_name("ManipulatorX")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$492, DW_AT_decl_column(0x17)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$493, DW_AT_name("ManipulatorY")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$493, DW_AT_decl_column(0x17)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$494, DW_AT_name("ManipulatorAngleRad")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$494, DW_AT_decl_column(0x17)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$495, DW_AT_name("LifeTracker")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$495, DW_AT_decl_column(0x20)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$496, DW_AT_name("AxisReadout")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$496, DW_AT_decl_column(0x17)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$497, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x110)
	.dwattr $C$DW$497, DW_AT_decl_column(0x17)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$498, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x111)
	.dwattr $C$DW$498, DW_AT_decl_column(0x17)

$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$499, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x112)
	.dwattr $C$DW$499, DW_AT_decl_column(0x17)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$500, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x113)
	.dwattr $C$DW$500, DW_AT_decl_column(0x17)

$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$501, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0x114)
	.dwattr $C$DW$501, DW_AT_decl_column(0x17)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$502, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x115)
	.dwattr $C$DW$502, DW_AT_decl_column(0x17)

$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$503, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x116)
	.dwattr $C$DW$503, DW_AT_decl_column(0x17)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$504, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x117)
	.dwattr $C$DW$504, DW_AT_decl_column(0x17)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$505, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x118)
	.dwattr $C$DW$505, DW_AT_decl_column(0x17)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$506, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x119)
	.dwattr $C$DW$506, DW_AT_decl_column(0x17)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$507, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$507, DW_AT_decl_column(0x17)

$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$206)
	.dwattr $C$DW$508, DW_AT_name("SlaveStat")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$508, DW_AT_decl_column(0x26)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$509, DW_AT_name("IsOperational")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$509, DW_AT_decl_column(0x17)

$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$510, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$510, DW_AT_decl_column(0x17)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$511, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$511, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$512, DW_AT_name("buf")
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x126)
	.dwattr $C$DW$512, DW_AT_decl_column(0x1b)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$513, DW_AT_name("flags")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x127)
	.dwattr $C$DW$513, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$209)
	.dwattr $C$DW$514, DW_AT_name("RStatus")
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$514, DW_AT_decl_column(0x25)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$515, DW_AT_name("RPinPos")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$515, DW_AT_decl_column(0x17)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$209)
	.dwattr $C$DW$516, DW_AT_name("LStatus")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x130)
	.dwattr $C$DW$516, DW_AT_decl_column(0x25)

$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$517, DW_AT_name("LPinPos")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x131)
	.dwattr $C$DW$517, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$518, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x139)
	.dwattr $C$DW$518, DW_AT_decl_column(0x20)

$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$519, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$519, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0c)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$520, DW_AT_name("DataFromPd")
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x142)
	.dwattr $C$DW$520, DW_AT_decl_column(0x1f)

$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$521, DW_AT_name("Rsvd")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x143)
	.dwattr $C$DW$521, DW_AT_decl_column(0x17)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$522, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x144)
	.dwattr $C$DW$522, DW_AT_decl_column(0x18)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$523, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x145)
	.dwattr $C$DW$523, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$63	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$63

$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x10)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$524, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$524, DW_AT_decl_column(0x21)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$525, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$525, DW_AT_decl_column(0x20)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$526, DW_AT_name("EEFVer")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$526, DW_AT_decl_column(0x20)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$527, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x150)
	.dwattr $C$DW$527, DW_AT_decl_column(0x17)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$528, DW_AT_name("TrayRev")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x151)
	.dwattr $C$DW$528, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$63

	.dwendtag $C$DW$TU$63


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x40a)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$529, DW_AT_name("USlaveObject")
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x101)
	.dwattr $C$DW$529, DW_AT_decl_column(0x0a)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$530, DW_AT_name("ActStatus")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x123)
	.dwattr $C$DW$530, DW_AT_decl_column(0x0a)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$531, DW_AT_name("Records")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x128)
	.dwattr $C$DW$531, DW_AT_decl_column(0x0b)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$532, DW_AT_name("WheelArm")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x133)
	.dwattr $C$DW$532, DW_AT_decl_column(0x0b)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$533, DW_AT_name("UFlashToken")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$533, DW_AT_decl_column(0x0b)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$534, DW_AT_name("DataFromPd")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x147)
	.dwattr $C$DW$534, DW_AT_decl_column(0x0b)

$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$535, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x153)
	.dwattr $C$DW$535, DW_AT_decl_column(0x0b)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$536, DW_AT_name("RobotControl")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x158)
	.dwattr $C$DW$536, DW_AT_decl_column(0x0b)

$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$537, DW_AT_name("Spare")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$537, DW_AT_decl_column(0x0b)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$538, DW_AT_name("DataBlock")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x160)
	.dwattr $C$DW$538, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$539, DW_AT_name("WaitingForInitialGrip")
	.dwattr $C$DW$539, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$539, DW_AT_bit_size(0x01)
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$539, DW_AT_decl_column(0x20)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$540, DW_AT_name("WaitingForFullGrip")
	.dwattr $C$DW$540, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$540, DW_AT_bit_size(0x01)
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$540, DW_AT_decl_column(0x20)

$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$541, DW_AT_name("FullyGripped")
	.dwattr $C$DW$541, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$541, DW_AT_bit_size(0x01)
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$541, DW_AT_decl_column(0x20)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$542, DW_AT_name("WaitingForRelease")
	.dwattr $C$DW$542, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$542, DW_AT_bit_size(0x01)
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x29f)
	.dwattr $C$DW$542, DW_AT_decl_column(0x20)

$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$543, DW_AT_name("Fullyreleased")
	.dwattr $C$DW$543, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$543, DW_AT_bit_size(0x01)
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x2a0)
	.dwattr $C$DW$543, DW_AT_decl_column(0x20)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$544, DW_AT_name("GripError")
	.dwattr $C$DW$544, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$544, DW_AT_bit_size(0x01)
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x2a1)
	.dwattr $C$DW$544, DW_AT_decl_column(0x20)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$545, DW_AT_name("ReleaseError")
	.dwattr $C$DW$545, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$545, DW_AT_bit_size(0x01)
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x2a2)
	.dwattr $C$DW$545, DW_AT_decl_column(0x20)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$546, DW_AT_name("spare1")
	.dwattr $C$DW$546, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$546, DW_AT_bit_size(0x09)
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x2a3)
	.dwattr $C$DW$546, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$66	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$66

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$547, DW_AT_name("S_MAN_HOLDS_ACTIVE_STICKY")
	.dwattr $C$DW$547, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$547, DW_AT_bit_size(0x01)
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x2ab)
	.dwattr $C$DW$547, DW_AT_decl_column(0x20)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$548, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT")
	.dwattr $C$DW$548, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$548, DW_AT_bit_size(0x01)
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x2ac)
	.dwattr $C$DW$548, DW_AT_decl_column(0x20)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$549, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP")
	.dwattr $C$DW$549, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$549, DW_AT_bit_size(0x01)
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$549, DW_AT_decl_column(0x20)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$550, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_STICKY")
	.dwattr $C$DW$550, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$550, DW_AT_bit_size(0x01)
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x2ae)
	.dwattr $C$DW$550, DW_AT_decl_column(0x20)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$551, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP_STICKY")
	.dwattr $C$DW$551, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$551, DW_AT_bit_size(0x01)
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x2af)
	.dwattr $C$DW$551, DW_AT_decl_column(0x20)

$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$552, DW_AT_name("S_MAN_HOLDS_INACTIVE")
	.dwattr $C$DW$552, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$552, DW_AT_bit_size(0x01)
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x2b0)
	.dwattr $C$DW$552, DW_AT_decl_column(0x20)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$553, DW_AT_name("spare1")
	.dwattr $C$DW$553, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$553, DW_AT_bit_size(0x01)
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x2b1)
	.dwattr $C$DW$553, DW_AT_decl_column(0x20)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$554, DW_AT_name("spare2")
	.dwattr $C$DW$554, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$554, DW_AT_bit_size(0x09)
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$554, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x2aa)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$66

	.dwendtag $C$DW$TU$66


$C$DW$TU$67	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$67

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$555, DW_AT_name("LaserMedianValid")
	.dwattr $C$DW$555, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$555, DW_AT_bit_size(0x01)
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x2bb)
	.dwattr $C$DW$555, DW_AT_decl_column(0x20)

$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$556, DW_AT_name("LedOn")
	.dwattr $C$DW$556, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$556, DW_AT_bit_size(0x01)
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x2bc)
	.dwattr $C$DW$556, DW_AT_decl_column(0x20)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$557, DW_AT_name("LaserOn")
	.dwattr $C$DW$557, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$557, DW_AT_bit_size(0x01)
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x2bd)
	.dwattr $C$DW$557, DW_AT_decl_column(0x20)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$558, DW_AT_name("PumpsOn")
	.dwattr $C$DW$558, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$558, DW_AT_bit_size(0x01)
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x2be)
	.dwattr $C$DW$558, DW_AT_decl_column(0x20)

$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$559, DW_AT_name("ReleaseValvesOn")
	.dwattr $C$DW$559, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$559, DW_AT_bit_size(0x01)
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x2bf)
	.dwattr $C$DW$559, DW_AT_decl_column(0x20)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$560, DW_AT_name("SolenoidValveOn1")
	.dwattr $C$DW$560, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$560, DW_AT_bit_size(0x01)
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x2c0)
	.dwattr $C$DW$560, DW_AT_decl_column(0x20)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$561, DW_AT_name("SolenoidValveOn2")
	.dwattr $C$DW$561, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$561, DW_AT_bit_size(0x01)
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x2c1)
	.dwattr $C$DW$561, DW_AT_decl_column(0x20)

$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$562, DW_AT_name("SolenoidValveOn3")
	.dwattr $C$DW$562, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$562, DW_AT_bit_size(0x01)
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x2c2)
	.dwattr $C$DW$562, DW_AT_decl_column(0x20)

$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$563, DW_AT_name("SolenoidValveOn4")
	.dwattr $C$DW$563, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$563, DW_AT_bit_size(0x01)
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x2c3)
	.dwattr $C$DW$563, DW_AT_decl_column(0x20)

$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$564, DW_AT_name("SolenoidValveOn5")
	.dwattr $C$DW$564, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$564, DW_AT_bit_size(0x01)
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("..\Application\Structdef2.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x2c4)
