;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Thu Oct 31 13:36:38 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/TapeArmManState.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2R3\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("SetMotionMode")
	.dwattr $C$DW$1, DW_AT_linkage_name("SetMotionMode")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\Functions2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x152)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$8)

	.dwendtag $C$DW$1


$C$DW$3	.dwtag  DW_TAG_subprogram

	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "ForceMotorOffAndBrakeRelease", 1
	.gmember  ".text:ForceMotorOffAndBrakeRelease"
	.endgroup
	.group    "ForceMotorOnBrake", 1
	.gmember  ".text:ForceMotorOnBrake"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetPackageDistFromCups", 1
	.gmember  ".text:GetPackageDistFromCups"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "GetTapeArmExtFineApproach", 1
	.gmember  ".text:GetTapeArmExtFineApproach"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "InitSuctionNoMonitor", 1
	.gmember  ".text:InitSuctionNoMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsMotorReady", 1
	.gmember  ".text:IsMotorReady"
	.endgroup
	.group    "IsPackageMeasuredDistOK", 1
	.gmember  ".text:IsPackageMeasuredDistOK"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetBrakeActionAutomatic", 1
	.gmember  ".text:SetBrakeActionAutomatic"
	.endgroup
	.group    "SetCanAxisDisableAutoBrake", 1
	.gmember  ".text:SetCanAxisDisableAutoBrake"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetCanAxisReferenceMode", 1
	.gmember  ".text:SetCanAxisReferenceMode"
	.endgroup
	.group    "SetCanAxisWheelTracksSteering", 1
	.gmember  ".text:SetCanAxisWheelTracksSteering"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetUserManualSpeedTarget", 1
	.gmember  ".text:SetUserManualSpeedTarget"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "StopSuctionNoMonitor", 1
	.gmember  ".text:StopSuctionNoMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$1129	.dwtag  DW_TAG_member
	.dwattr $C$DW$1129, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1129, DW_AT_name("I2tCntr")
	.dwattr $C$DW$1129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1129, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1129, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1129, DW_AT_decl_column(0x18)

$C$DW$1130	.dwtag  DW_TAG_member
	.dwattr $C$DW$1130, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1130, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$1130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1130, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1130, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1130, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$1131	.dwtag  DW_TAG_member
	.dwattr $C$DW$1131, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1131, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$1131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1131, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1131, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1131, DW_AT_decl_column(0x0e)

$C$DW$1132	.dwtag  DW_TAG_member
	.dwattr $C$DW$1132, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1132, DW_AT_name("IPC_STS")
	.dwattr $C$DW$1132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1132, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1132, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1132, DW_AT_decl_column(0x0e)

$C$DW$1133	.dwtag  DW_TAG_member
	.dwattr $C$DW$1133, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1133, DW_AT_name("IPC_SET")
	.dwattr $C$DW$1133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1133, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1133, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1133, DW_AT_decl_column(0x0e)

$C$DW$1134	.dwtag  DW_TAG_member
	.dwattr $C$DW$1134, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1134, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$1134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1134, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1134, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1134, DW_AT_decl_column(0x0e)

$C$DW$1135	.dwtag  DW_TAG_member
	.dwattr $C$DW$1135, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1135, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$1135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1135, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1135, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1135, DW_AT_decl_column(0x0e)

$C$DW$1136	.dwtag  DW_TAG_member
	.dwattr $C$DW$1136, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1136, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$1136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1136, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1136, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1136, DW_AT_decl_column(0x0e)

$C$DW$1137	.dwtag  DW_TAG_member
	.dwattr $C$DW$1137, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1137, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$1137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1137, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1137, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1137, DW_AT_decl_column(0x0e)

$C$DW$1138	.dwtag  DW_TAG_member
	.dwattr $C$DW$1138, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1138, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$1138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1138, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1138, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1138, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$1139	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1139, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$1139)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$1140	.dwtag  DW_TAG_member
	.dwattr $C$DW$1140, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1140, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$1140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1140, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1140, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1140, DW_AT_decl_column(0x0e)

$C$DW$1141	.dwtag  DW_TAG_member
	.dwattr $C$DW$1141, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1141, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$1141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1141, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1141, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1141, DW_AT_decl_column(0x0e)

$C$DW$1142	.dwtag  DW_TAG_member
	.dwattr $C$DW$1142, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1142, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$1142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1142, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1142, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1142, DW_AT_decl_column(0x0e)

$C$DW$1143	.dwtag  DW_TAG_member
	.dwattr $C$DW$1143, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1143, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$1143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1143, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1143, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1143, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1143, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$1144	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1144, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$1144)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$1145	.dwtag  DW_TAG_member
	.dwattr $C$DW$1145, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1145, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$1145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1145, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1145, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1145, DW_AT_decl_column(0x0e)

$C$DW$1146	.dwtag  DW_TAG_member
	.dwattr $C$DW$1146, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1146, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$1146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1146, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1146, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1146, DW_AT_decl_column(0x0e)

$C$DW$1147	.dwtag  DW_TAG_member
	.dwattr $C$DW$1147, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1147, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$1147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1147, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1147, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1147, DW_AT_decl_column(0x0e)

$C$DW$1148	.dwtag  DW_TAG_member
	.dwattr $C$DW$1148, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1148, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$1148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1148, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1148, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1148, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$1149	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1149, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$1149)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$1150	.dwtag  DW_TAG_member
	.dwattr $C$DW$1150, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1150, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$1150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1150, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1150, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1150, DW_AT_decl_column(0x0e)

$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1151, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$1151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1151, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x0e)

$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1152, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1152, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$1153	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$1153)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$1154	.dwtag  DW_TAG_member
	.dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1154, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1154, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x23)

$C$DW$1155	.dwtag  DW_TAG_member
	.dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1155, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1155, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x23)

$C$DW$1156	.dwtag  DW_TAG_member
	.dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1156, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1156, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x23)

$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1157, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x23)

$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1158, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x23)

$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1159, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x23)

$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1160, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x23)

$C$DW$1161	.dwtag  DW_TAG_member
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1161, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$1161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1161, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1161, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1161, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$232	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$232
$C$DW$T$232	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$232, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$232, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$232, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$232, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$232


$C$DW$TU$233	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$233
$C$DW$1162	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$232)

$C$DW$T$233	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$233, DW_AT_type(*$C$DW$1162)

	.dwendtag $C$DW$TU$233


$C$DW$TU$234	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$234

$C$DW$T$234	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
	.dwattr $C$DW$T$234, DW_AT_byte_size(0x78)
$C$DW$1163	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1163, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$234

	.dwendtag $C$DW$TU$234


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1164, DW_AT_name("index")
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0x79)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x20)

$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1165, DW_AT_name("subindex")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x20)

$C$DW$1166	.dwtag  DW_TAG_member
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1166, DW_AT_name("data_type")
	.dwattr $C$DW$1166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1166, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1166, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1166, DW_AT_decl_column(0x20)

$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1167, DW_AT_name("data_len")
	.dwattr $C$DW$1167, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x17)

$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1168, DW_AT_name("isset")
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x17)

$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1169, DW_AT_name("unused")
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x17)

$C$DW$1170	.dwtag  DW_TAG_member
	.dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1170, DW_AT_name("counter")
	.dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1170, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x1f)

$C$DW$1171	.dwtag  DW_TAG_member
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1171, DW_AT_name("errcode")
	.dwattr $C$DW$1171, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1171, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1171, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1171, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1172, DW_AT_name("Unused")
	.dwattr $C$DW$1172, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1172, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0x58)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x16)

$C$DW$1173	.dwtag  DW_TAG_member
	.dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1173, DW_AT_name("RebootPsCntr")
	.dwattr $C$DW$1173, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1173, DW_AT_bit_size(0x04)
	.dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1173, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x16)

$C$DW$1174	.dwtag  DW_TAG_member
	.dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1174, DW_AT_name("ManipulatorAxesReboot")
	.dwattr $C$DW$1174, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1174, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1174, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x16)

$C$DW$1175	.dwtag  DW_TAG_member
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1175, DW_AT_name("Rsvd")
	.dwattr $C$DW$1175, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1175, DW_AT_bit_size(0x08)
	.dwattr $C$DW$1175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1175, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1175, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$1175, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$41

	.dwendtag $C$DW$TU$41


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1176, DW_AT_name("rsvd2")
	.dwattr $C$DW$1176, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1176, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x16)

$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1177, DW_AT_name("StoEnabled")
	.dwattr $C$DW$1177, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1177, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x16)

$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1178, DW_AT_name("StopCan")
	.dwattr $C$DW$1178, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1178, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x16)

$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1179, DW_AT_name("LeftPinCmd")
	.dwattr $C$DW$1179, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1179, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x20)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x16)

$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1180, DW_AT_name("RightPinCmd")
	.dwattr $C$DW$1180, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1180, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x21)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x16)

$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1181, DW_AT_name("CommRestart")
	.dwattr $C$DW$1181, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1181, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x22)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x16)

$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1182, DW_AT_name("ObsoleteLaserPsOn")
	.dwattr $C$DW$1182, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1182, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x16)

$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1183, DW_AT_name("RecorderTimeBasis")
	.dwattr $C$DW$1183, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1183, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x24)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x16)

$C$DW$1184	.dwtag  DW_TAG_member
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1184, DW_AT_name("testRs485")
	.dwattr $C$DW$1184, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1184, DW_AT_bit_size(0x02)
	.dwattr $C$DW$1184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1184, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1184, DW_AT_decl_line(0x25)
	.dwattr $C$DW$1184, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$1185	.dwtag  DW_TAG_member
	.dwattr $C$DW$1185, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1185, DW_AT_name("rsvd")
	.dwattr $C$DW$1185, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1185, DW_AT_bit_size(0x09)
	.dwattr $C$DW$1185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1185, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1185, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$1185, DW_AT_decl_column(0x16)

$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1186, DW_AT_name("WheelArmExist")
	.dwattr $C$DW$1186, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1186, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x16)

$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1187, DW_AT_name("ManipType")
	.dwattr $C$DW$1187, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1187, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x30)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$47	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$47

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x3e)
$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1188, DW_AT_name("AxesActive")
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x88)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x17)

$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1189, DW_AT_name("ObsoletePumpsOn")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x89)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x20)

$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1190, DW_AT_name("StateResetCnt")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x20)

$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1191, DW_AT_name("PackDir")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x20)

$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1192, DW_AT_name("ControlWord")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x20)

$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1193, DW_AT_name("ResetMotors")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x20)

$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1194, DW_AT_name("ForceManualBrakeMode")
	.dwattr $C$DW$1194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x20)

$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1195, DW_AT_name("ManualBrakeReleaseCmd")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x20)

$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1196, DW_AT_name("PinMotorCurrentAmp")
	.dwattr $C$DW$1196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x17)

$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1197, DW_AT_name("PalletAngle")
	.dwattr $C$DW$1197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x91)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x17)

$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1198, DW_AT_name("Flexmm")
	.dwattr $C$DW$1198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x92)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x17)

$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1199, DW_AT_name("DoorAngle")
	.dwattr $C$DW$1199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0x93)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x20)

$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1200, DW_AT_name("GoToCntr")
	.dwattr $C$DW$1200, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x94)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x17)

$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$224)
	.dwattr $C$DW$1201, DW_AT_name("PsCmd")
	.dwattr $C$DW$1201, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x95)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x1f)

$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1202, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$1202, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0x96)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x20)

$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1203, DW_AT_name("bSerialFlashOwner")
	.dwattr $C$DW$1203, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0x97)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x20)

$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1204, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0x98)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x20)

$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1205, DW_AT_name("MalinkiSetCmd")
	.dwattr $C$DW$1205, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0x99)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x17)

$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$1206, DW_AT_name("ObsoletePdCommandPdo")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x1f)

$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1207, DW_AT_name("AssumedPackagePositionX")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x0b)

$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1208, DW_AT_name("AssumedPackagePositionY")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x0b)

$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1209, DW_AT_name("bGrantNeckControl")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x0b)

$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1210, DW_AT_name("bGrantWheelControl")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x17)

$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1211, DW_AT_name("NeckAngle")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x17)

$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1212, DW_AT_name("PlatRoll")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x17)

$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1213, DW_AT_name("PlatPitch")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x17)

$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1214, DW_AT_name("RobotPositionM")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x17)

$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1215, DW_AT_name("NeckIncidenceAngle")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x17)

$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1216, DW_AT_name("WheelArmTiltCompensation")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x17)

$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1217, DW_AT_name("PackageSide")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x17)

$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$227)
	.dwattr $C$DW$1218, DW_AT_name("SlaveStatus")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x24)

$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1219, DW_AT_name("rsvd")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x17)

$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1220, DW_AT_name("LifeCheck")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x20)

$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$1221, DW_AT_name("ModeWord")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x21)

$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$1222, DW_AT_name("ConfigWord")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x23)

$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1223, DW_AT_name("Checksum")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0xab)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x20)

$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1224, DW_AT_name("InternalBufOffset")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x20)

$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1225, DW_AT_name("InterBufCnt")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0xad)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$47

	.dwendtag $C$DW$TU$47


$C$DW$TU$48	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$48

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x400)
$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$1226, DW_AT_name("USlaveObject")
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0x84)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x0a)

$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$1227, DW_AT_name("ActCmd")
	.dwattr $C$DW$1227, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x0a)

$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$1228, DW_AT_name("Spare")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x0b)

$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$1229, DW_AT_name("DataBlock")
	.dwattr $C$DW$1229, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$48

	.dwendtag $C$DW$TU$48


$C$DW$TU$49	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$49

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x0a)
$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1230, DW_AT_name("index")
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x20)

$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1231, DW_AT_name("subindex")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x20)

$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1232, DW_AT_name("data_type")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x17)

$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1233, DW_AT_name("data_len")
	.dwattr $C$DW$1233, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x17)

$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1234, DW_AT_name("isset")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x17)

$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1235, DW_AT_name("unused")
	.dwattr $C$DW$1235, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x17)

$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1236, DW_AT_name("counter")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x1f)

$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1237, DW_AT_name("errcode")
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$49

	.dwendtag $C$DW$TU$49


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x1a)
$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1238, DW_AT_name("msg")
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x0e)

$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1239, DW_AT_name("buf")
	.dwattr $C$DW$1239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1240, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$1240, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1240, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x1a)

$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1241, DW_AT_name("ManipType")
	.dwattr $C$DW$1241, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1241, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x1a)

$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1242, DW_AT_name("Homed")
	.dwattr $C$DW$1242, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1242, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x1a)

$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1243, DW_AT_name("Individual")
	.dwattr $C$DW$1243, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1243, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x1a)

$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1244, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$1244, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1244, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x1a)

$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1245, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$1245, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1245, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x1a)

$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1246, DW_AT_name("rsvd")
	.dwattr $C$DW$1246, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1246, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$53	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$53

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1247, DW_AT_name("lo")
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x18)

$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1248, DW_AT_name("hi")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$53

	.dwendtag $C$DW$TU$53


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1249, DW_AT_name("PumpCmd")
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x106)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x17)

$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1250, DW_AT_name("LaserCmd")
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x107)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x17)

$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$225)
	.dwattr $C$DW$1251, DW_AT_name("PsStatus")
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x21)

$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$218)
	.dwattr $C$DW$1252, DW_AT_name("CoreId")
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x1f)

$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1253, DW_AT_name("LaserDistance")
	.dwattr $C$DW$1253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x17)

$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1254, DW_AT_name("ManipulatorX")
	.dwattr $C$DW$1254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x17)

$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1255, DW_AT_name("ManipulatorY")
	.dwattr $C$DW$1255, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x17)

$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1256, DW_AT_name("ManipulatorAngleRad")
	.dwattr $C$DW$1256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x17)

$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1257, DW_AT_name("LifeTracker")
	.dwattr $C$DW$1257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x20)

$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1258, DW_AT_name("AxisReadout")
	.dwattr $C$DW$1258, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x17)

$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1259, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$1259, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x17)

$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1260, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$1260, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x17)

$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1261, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$1261, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x112)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x17)

$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1262, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$1262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x113)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x17)

$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1263, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$1263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0x114)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x17)

$C$DW$1264	.dwtag  DW_TAG_member
	.dwattr $C$DW$1264, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1264, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$1264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1264, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x115)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x17)

$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1265, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$1265, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x17)

$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1266, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$1266, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x117)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x17)

$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1267, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$1267, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x118)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x17)

$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1268, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$1268, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x119)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x17)

$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1269, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$1269, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x17)

$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$226)
	.dwattr $C$DW$1270, DW_AT_name("SlaveStat")
	.dwattr $C$DW$1270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x26)

$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1271, DW_AT_name("IsOperational")
	.dwattr $C$DW$1271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x17)

$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1272, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$1272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x17)

$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1273, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$1273, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$1274, DW_AT_name("buf")
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x1b)

$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1275, DW_AT_name("flags")
	.dwattr $C$DW$1275, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$229)
	.dwattr $C$DW$1276, DW_AT_name("RStatus")
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1276, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x25)

$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1277, DW_AT_name("RPinPos")
	.dwattr $C$DW$1277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1277, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x17)

$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$229)
	.dwattr $C$DW$1278, DW_AT_name("LStatus")
	.dwattr $C$DW$1278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x25)

$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1279, DW_AT_name("LPinPos")
	.dwattr $C$DW$1279, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1280, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0x139)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x20)

$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1281, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$1281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0c)
$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1282, DW_AT_name("DataFromPd")
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0x142)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x1f)

$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1283, DW_AT_name("Rsvd")
	.dwattr $C$DW$1283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0x143)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x17)

$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1284, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$1284, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0x144)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x18)

$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1285, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$1285, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0x145)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$63	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$63

$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x10)
$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1286, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x21)

$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1287, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$1287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x20)

$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1288, DW_AT_name("EEFVer")
	.dwattr $C$DW$1288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x20)

$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1289, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$1289, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0x150)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x17)

$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1290, DW_AT_name("TrayRev")
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0x151)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$63

	.dwendtag $C$DW$TU$63


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x40a)
$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1291, DW_AT_name("USlaveObject")
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x0a)

$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$1292, DW_AT_name("ActStatus")
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x0a)

$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1293, DW_AT_name("Records")
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x0b)

$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1294, DW_AT_name("WheelArm")
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0x133)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x0b)

$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$1295, DW_AT_name("UFlashToken")
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x0b)

$C$DW$1296	.dwtag  DW_TAG_member
	.dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1296, DW_AT_name("DataFromPd")
	.dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1296, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0x147)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x0b)

$C$DW$1297	.dwtag  DW_TAG_member
	.dwattr $C$DW$1297, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$1297, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$1297, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$1297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1297, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0x153)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x0b)

$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$1298, DW_AT_name("RobotControl")
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1298, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1298, DW_AT_decl_line(0x158)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x0b)

$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$1299, DW_AT_name("Spare")
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x0b)

$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1300, DW_AT_name("DataBlock")
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x160)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1301, DW_AT_name("WaitingForInitialGrip")
	.dwattr $C$DW$1301, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1301, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x20)

$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1302, DW_AT_name("WaitingForFullGrip")
	.dwattr $C$DW$1302, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1302, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1302, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x20)

$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1303, DW_AT_name("FullyGripped")
	.dwattr $C$DW$1303, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1303, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1303, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x20)

$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1304, DW_AT_name("WaitingForRelease")
	.dwattr $C$DW$1304, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1304, DW_AT_decl_line(0x29f)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x20)

$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1305, DW_AT_name("Fullyreleased")
	.dwattr $C$DW$1305, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1305, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1305, DW_AT_decl_line(0x2a0)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x20)

$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1306, DW_AT_name("GripError")
	.dwattr $C$DW$1306, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1306, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1306, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1306, DW_AT_decl_line(0x2a1)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x20)

$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1307, DW_AT_name("ReleaseError")
	.dwattr $C$DW$1307, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1307, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1307, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1307, DW_AT_decl_line(0x2a2)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x20)

$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1308, DW_AT_name("spare1")
	.dwattr $C$DW$1308, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1308, DW_AT_bit_size(0x09)
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1308, DW_AT_decl_line(0x2a3)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$66	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$66

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1309, DW_AT_name("S_MAN_HOLDS_ACTIVE_STICKY")
	.dwattr $C$DW$1309, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1309, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0x2ab)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x20)

$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1310, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT")
	.dwattr $C$DW$1310, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1310, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0x2ac)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x20)

$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1311, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP")
	.dwattr $C$DW$1311, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1311, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x20)

$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1312, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_STICKY")
	.dwattr $C$DW$1312, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1312, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0x2ae)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x20)

$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1313, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP_STICKY")
	.dwattr $C$DW$1313, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1313, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1313, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0x2af)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x20)

$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1314, DW_AT_name("S_MAN_HOLDS_INACTIVE")
	.dwattr $C$DW$1314, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1314, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1314, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1314, DW_AT_decl_line(0x2b0)
	.dwattr $C$DW$1314, DW_AT_decl_column(0x20)

$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1315, DW_AT_name("spare1")
	.dwattr $C$DW$1315, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1315, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1315, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1315, DW_AT_decl_line(0x2b1)
	.dwattr $C$DW$1315, DW_AT_decl_column(0x20)

$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1316, DW_AT_name("spare2")
	.dwattr $C$DW$1316, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1316, DW_AT_bit_size(0x09)
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1316, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1316, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$1316, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x2aa)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$66

	.dwendtag $C$DW$TU$66


$C$DW$TU$67	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$67

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1317, DW_AT_name("LaserMedianValid")
	.dwattr $C$DW$1317, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1317, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1317, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1317, DW_AT_decl_line(0x2bb)
	.dwattr $C$DW$1317, DW_AT_decl_column(0x20)

$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1318, DW_AT_name("LedOn")
	.dwattr $C$DW$1318, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1318, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1318, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1318, DW_AT_decl_line(0x2bc)
	.dwattr $C$DW$1318, DW_AT_decl_column(0x20)

$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1319, DW_AT_name("LaserOn")
	.dwattr $C$DW$1319, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1319, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1319, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1319, DW_AT_decl_line(0x2bd)
	.dwattr $C$DW$1319, DW_AT_decl_column(0x20)

$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1320, DW_AT_name("PumpsOn")
	.dwattr $C$DW$1320, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1320, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1320, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1320, DW_AT_decl_line(0x2be)
	.dwattr $C$DW$1320, DW_AT_decl_column(0x20)

$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1321, DW_AT_name("ReleaseValvesOn")
	.dwattr $C$DW$1321, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1321, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1321, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1321, DW_AT_decl_line(0x2bf)
	.dwattr $C$DW$1321, DW_AT_decl_column(0x20)

$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1322, DW_AT_name("SolenoidValveOn1")
	.dwattr $C$DW$1322, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1322, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1322, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1322, DW_AT_decl_line(0x2c0)
	.dwattr $C$DW$1322, DW_AT_decl_column(0x20)

$C$DW$1323	.dwtag  DW_TAG_member
	.dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1323, DW_AT_name("SolenoidValveOn2")
