;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Thu Oct 31 13:36:39 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/TimerArr2.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2R3\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("RestoreInts")
	.dwattr $C$DW$1, DW_AT_linkage_name("RestoreInts")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\SysUtils2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x36)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$9)

	.dwendtag $C$DW$1


$C$DW$3	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$3, DW_AT_name("BlockInts")

	.gmember  ".text:CanAxisIsPosition"
	.endgroup
	.group    "DisableRs485Tx_1", 1
	.gmember  ".text:DisableRs485Tx_1"
	.endgroup
	.group    "DisableRs485Tx_2", 1
	.gmember  ".text:DisableRs485Tx_2"
	.endgroup
	.group    "EnableRs485Tx_1", 1
	.gmember  ".text:EnableRs485Tx_1"
	.endgroup
	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "ForceMotorOffAndBrakeRelease", 1
	.gmember  ".text:ForceMotorOffAndBrakeRelease"
	.endgroup
	.group    "ForceMotorOnBrake", 1
	.gmember  ".text:ForceMotorOnBrake"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "InitSuctionNoMonitor", 1
	.gmember  ".text:InitSuctionNoMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsMotorReady", 1
	.gmember  ".text:IsMotorReady"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetBrakeActionAutomatic", 1
	.gmember  ".text:SetBrakeActionAutomatic"
	.endgroup
	.group    "SetCanAxisDisableAutoBrake", 1
	.gmember  ".text:SetCanAxisDisableAutoBrake"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetCanAxisReferenceMode", 1
	.gmember  ".text:SetCanAxisReferenceMode"
	.endgroup
	.group    "SetCanAxisWheelTracksSteering", 1
	.gmember  ".text:SetCanAxisWheelTracksSteering"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetUserManualSpeedTarget", 1
	.gmember  ".text:SetUserManualSpeedTarget"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "StopSuctionNoMonitor", 1
	.gmember  ".text:StopSuctionNoMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$456, DW_AT_name("I2tCntr")
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x108)
	.dwattr $C$DW$456, DW_AT_decl_column(0x18)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$457, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x109)
	.dwattr $C$DW$457, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x107)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$458, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0e)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$459, DW_AT_name("IPC_STS")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$459, DW_AT_decl_column(0x0e)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$460, DW_AT_name("IPC_SET")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$460, DW_AT_decl_column(0x0e)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$461, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$461, DW_AT_decl_column(0x0e)

$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$462, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$462, DW_AT_decl_column(0x0e)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$463, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$463, DW_AT_decl_column(0x0e)

$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$464, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$464, DW_AT_decl_column(0x0e)

$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$465, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$465, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$466	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$466)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$467, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0xed)
	.dwattr $C$DW$467, DW_AT_decl_column(0x0e)

$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$468, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0xee)
	.dwattr $C$DW$468, DW_AT_decl_column(0x0e)

$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$469, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0xef)
	.dwattr $C$DW$469, DW_AT_decl_column(0x0e)

$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$470, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$470, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$471	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$471)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$472, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$472, DW_AT_decl_column(0x0e)

$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$473, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$473, DW_AT_decl_column(0x0e)

$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$474, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$474, DW_AT_decl_column(0x0e)

$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$475, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$475, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$476	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$476)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$477, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$477, DW_AT_decl_column(0x0e)

$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$478, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$478, DW_AT_decl_column(0x0e)

$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$479, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0xff)
	.dwattr $C$DW$479, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$480	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$480)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$481, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x122)
	.dwattr $C$DW$481, DW_AT_decl_column(0x23)

$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$482, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x123)
	.dwattr $C$DW$482, DW_AT_decl_column(0x23)

$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$483, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x124)
	.dwattr $C$DW$483, DW_AT_decl_column(0x23)

$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$484, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x125)
	.dwattr $C$DW$484, DW_AT_decl_column(0x23)

$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$485, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x126)
	.dwattr $C$DW$485, DW_AT_decl_column(0x23)

$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$486, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x127)
	.dwattr $C$DW$486, DW_AT_decl_column(0x23)

$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$487, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x128)
	.dwattr $C$DW$487, DW_AT_decl_column(0x23)

$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$488, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x129)
	.dwattr $C$DW$488, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$228	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$228
$C$DW$T$228	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$228, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$228, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$228, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$228, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$228


$C$DW$TU$229	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$229
$C$DW$489	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$228)

$C$DW$T$229	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$229, DW_AT_type(*$C$DW$489)

	.dwendtag $C$DW$TU$229


$C$DW$TU$230	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$230

$C$DW$T$230	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
	.dwattr $C$DW$T$230, DW_AT_byte_size(0x78)
$C$DW$490	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$490, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$230

	.dwendtag $C$DW$TU$230


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$491, DW_AT_name("index")
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$491, DW_AT_decl_column(0x20)

$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$492, DW_AT_name("subindex")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$492, DW_AT_decl_column(0x20)

$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$493, DW_AT_name("data_type")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$493, DW_AT_decl_column(0x17)

$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$494, DW_AT_name("data_len")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$494, DW_AT_decl_column(0x17)

$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$495, DW_AT_name("isset")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$495, DW_AT_decl_column(0x17)

$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$496, DW_AT_name("unused")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$496, DW_AT_decl_column(0x17)

$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$497, DW_AT_name("counter")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$497, DW_AT_decl_column(0x1f)

$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$498, DW_AT_name("errcode")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$498, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x1a)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$499, DW_AT_name("msg")
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0xff)
	.dwattr $C$DW$499, DW_AT_decl_column(0x0e)

$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$500, DW_AT_name("buf")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x100)
	.dwattr $C$DW$500, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$501, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$501, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$501, DW_AT_bit_size(0x01)
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$501, DW_AT_decl_column(0x1a)

$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$502, DW_AT_name("ManipType")
	.dwattr $C$DW$502, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$502, DW_AT_bit_size(0x06)
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$502, DW_AT_decl_column(0x1a)

$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$503, DW_AT_name("Homed")
	.dwattr $C$DW$503, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$503, DW_AT_bit_size(0x01)
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$503, DW_AT_decl_column(0x1a)

$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$504, DW_AT_name("Individual")
	.dwattr $C$DW$504, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$504, DW_AT_bit_size(0x01)
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$504, DW_AT_decl_column(0x1a)

$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$505, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$505, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$505, DW_AT_bit_size(0x01)
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0xca)
	.dwattr $C$DW$505, DW_AT_decl_column(0x1a)

$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$506, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$506, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$506, DW_AT_bit_size(0x01)
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$506, DW_AT_decl_column(0x1a)

$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$507, DW_AT_name("rsvd")
	.dwattr $C$DW$507, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$507, DW_AT_bit_size(0x05)
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$507, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$44	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$44

$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$508, DW_AT_name("lo")
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$508, DW_AT_decl_column(0x18)

$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$509, DW_AT_name("hi")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$509, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$44, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$44

	.dwendtag $C$DW$TU$44


$C$DW$TU$46	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$46

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x40)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$510, DW_AT_name("PumpCmd")
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x106)
	.dwattr $C$DW$510, DW_AT_decl_column(0x17)

$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$511, DW_AT_name("LaserCmd")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x107)
	.dwattr $C$DW$511, DW_AT_decl_column(0x17)

$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$222)
	.dwattr $C$DW$512, DW_AT_name("PsStatus")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x108)
	.dwattr $C$DW$512, DW_AT_decl_column(0x21)

$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$218)
	.dwattr $C$DW$513, DW_AT_name("CoreId")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x109)
	.dwattr $C$DW$513, DW_AT_decl_column(0x1f)

$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$514, DW_AT_name("LaserDistance")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$514, DW_AT_decl_column(0x17)

$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$515, DW_AT_name("ManipulatorX")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$515, DW_AT_decl_column(0x17)

$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$516, DW_AT_name("ManipulatorY")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$516, DW_AT_decl_column(0x17)

$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$517, DW_AT_name("ManipulatorAngleRad")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$517, DW_AT_decl_column(0x17)

$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$518, DW_AT_name("LifeTracker")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$518, DW_AT_decl_column(0x20)

$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$519, DW_AT_name("AxisReadout")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$519, DW_AT_decl_column(0x17)

$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$520, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x110)
	.dwattr $C$DW$520, DW_AT_decl_column(0x17)

$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$521, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x111)
	.dwattr $C$DW$521, DW_AT_decl_column(0x17)

$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$522, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x112)
	.dwattr $C$DW$522, DW_AT_decl_column(0x17)

$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$523, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x113)
	.dwattr $C$DW$523, DW_AT_decl_column(0x17)

$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$524, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x114)
	.dwattr $C$DW$524, DW_AT_decl_column(0x17)

$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$525, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x115)
	.dwattr $C$DW$525, DW_AT_decl_column(0x17)

$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$526, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x116)
	.dwattr $C$DW$526, DW_AT_decl_column(0x17)

$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$527, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x117)
	.dwattr $C$DW$527, DW_AT_decl_column(0x17)

$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$528, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x118)
	.dwattr $C$DW$528, DW_AT_decl_column(0x17)

$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$529, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x119)
	.dwattr $C$DW$529, DW_AT_decl_column(0x17)

$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$530, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$530, DW_AT_decl_column(0x17)

$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$223)
	.dwattr $C$DW$531, DW_AT_name("SlaveStat")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$531, DW_AT_decl_column(0x26)

$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$532, DW_AT_name("IsOperational")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$532, DW_AT_decl_column(0x17)

$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$533, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$533, DW_AT_decl_column(0x17)

$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$534, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$534, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$46, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x105)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$46

	.dwendtag $C$DW$TU$46


$C$DW$TU$49	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$49

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x30)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$535, DW_AT_name("buf")
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x126)
	.dwattr $C$DW$535, DW_AT_decl_column(0x1b)

$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$536, DW_AT_name("flags")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x127)
	.dwattr $C$DW$536, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x125)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$49

	.dwendtag $C$DW$TU$49


$C$DW$TU$50	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$50

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$225)
	.dwattr $C$DW$537, DW_AT_name("RStatus")
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$537, DW_AT_decl_column(0x25)

$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$538, DW_AT_name("RPinPos")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$538, DW_AT_decl_column(0x17)

$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$225)
	.dwattr $C$DW$539, DW_AT_name("LStatus")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x130)
	.dwattr $C$DW$539, DW_AT_decl_column(0x25)

$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$540, DW_AT_name("LPinPos")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x131)
	.dwattr $C$DW$540, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$50

	.dwendtag $C$DW$TU$50


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$541, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x139)
	.dwattr $C$DW$541, DW_AT_decl_column(0x20)

$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$542, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$542, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x138)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$53	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$53

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$543, DW_AT_name("DataFromPd")
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x142)
	.dwattr $C$DW$543, DW_AT_decl_column(0x1f)

$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$544, DW_AT_name("Rsvd")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x143)
	.dwattr $C$DW$544, DW_AT_decl_column(0x17)

$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$545, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x144)
	.dwattr $C$DW$545, DW_AT_decl_column(0x18)

$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$546, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x145)
	.dwattr $C$DW$546, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$53

	.dwendtag $C$DW$TU$53


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$547, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$547, DW_AT_decl_column(0x21)

$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$548, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$548, DW_AT_decl_column(0x20)

$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$549, DW_AT_name("EEFVer")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$549, DW_AT_decl_column(0x20)

$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$550, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x150)
	.dwattr $C$DW$550, DW_AT_decl_column(0x17)

$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$551, DW_AT_name("TrayRev")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x151)
	.dwattr $C$DW$551, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$56	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$56

$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x40a)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$552, DW_AT_name("USlaveObject")
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x101)
	.dwattr $C$DW$552, DW_AT_decl_column(0x0a)

$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$553, DW_AT_name("ActStatus")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x123)
	.dwattr $C$DW$553, DW_AT_decl_column(0x0a)

$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$554, DW_AT_name("Records")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x128)
	.dwattr $C$DW$554, DW_AT_decl_column(0x0b)

$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$555, DW_AT_name("WheelArm")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x133)
	.dwattr $C$DW$555, DW_AT_decl_column(0x0b)

$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$556, DW_AT_name("UFlashToken")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$556, DW_AT_decl_column(0x0b)

$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$557, DW_AT_name("DataFromPd")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x147)
	.dwattr $C$DW$557, DW_AT_decl_column(0x0b)

$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$558, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x153)
	.dwattr $C$DW$558, DW_AT_decl_column(0x0b)

$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$559, DW_AT_name("RobotControl")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x158)
	.dwattr $C$DW$559, DW_AT_decl_column(0x0b)

$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$560, DW_AT_name("Spare")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$560, DW_AT_decl_column(0x0b)

$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$561, DW_AT_name("DataBlock")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x160)
	.dwattr $C$DW$561, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$56

	.dwendtag $C$DW$TU$56


$C$DW$TU$57	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$57

$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$562, DW_AT_name("WaitingForInitialGrip")
	.dwattr $C$DW$562, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$562, DW_AT_bit_size(0x01)
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$562, DW_AT_decl_column(0x20)

$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$563, DW_AT_name("WaitingForFullGrip")
	.dwattr $C$DW$563, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$563, DW_AT_bit_size(0x01)
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$563, DW_AT_decl_column(0x20)

$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$564, DW_AT_name("FullyGripped")
	.dwattr $C$DW$564, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$564, DW_AT_bit_size(0x01)
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x29e)
	.dwattr $C$DW$564, DW_AT_decl_column(0x20)

$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$565, DW_AT_name("WaitingForRelease")
	.dwattr $C$DW$565, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$565, DW_AT_bit_size(0x01)
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x29f)
	.dwattr $C$DW$565, DW_AT_decl_column(0x20)

$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$566, DW_AT_name("Fullyreleased")
	.dwattr $C$DW$566, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$566, DW_AT_bit_size(0x01)
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x2a0)
	.dwattr $C$DW$566, DW_AT_decl_column(0x20)

$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$567, DW_AT_name("GripError")
	.dwattr $C$DW$567, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$567, DW_AT_bit_size(0x01)
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x2a1)
	.dwattr $C$DW$567, DW_AT_decl_column(0x20)

$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$568, DW_AT_name("ReleaseError")
	.dwattr $C$DW$568, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$568, DW_AT_bit_size(0x01)
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x2a2)
	.dwattr $C$DW$568, DW_AT_decl_column(0x20)

$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$569, DW_AT_name("spare1")
	.dwattr $C$DW$569, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$569, DW_AT_bit_size(0x09)
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x2a3)
	.dwattr $C$DW$569, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$57

	.dwendtag $C$DW$TU$57


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$570, DW_AT_name("S_MAN_HOLDS_ACTIVE_STICKY")
	.dwattr $C$DW$570, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$570, DW_AT_bit_size(0x01)
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x2ab)
	.dwattr $C$DW$570, DW_AT_decl_column(0x20)

$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$571, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT")
	.dwattr $C$DW$571, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$571, DW_AT_bit_size(0x01)
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x2ac)
	.dwattr $C$DW$571, DW_AT_decl_column(0x20)

$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$572, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP")
	.dwattr $C$DW$572, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$572, DW_AT_bit_size(0x01)
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x2ad)
	.dwattr $C$DW$572, DW_AT_decl_column(0x20)

$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$573, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_STICKY")
	.dwattr $C$DW$573, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$573, DW_AT_bit_size(0x01)
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x2ae)
	.dwattr $C$DW$573, DW_AT_decl_column(0x20)

$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$574, DW_AT_name("S_MAN_HOLDS_SUSPECT_CONTACT_W_PUMP_STICKY")
	.dwattr $C$DW$574, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$574, DW_AT_bit_size(0x01)
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x2af)
	.dwattr $C$DW$574, DW_AT_decl_column(0x20)

$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$575, DW_AT_name("S_MAN_HOLDS_INACTIVE")
	.dwattr $C$DW$575, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$575, DW_AT_bit_size(0x01)
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x2b0)
	.dwattr $C$DW$575, DW_AT_decl_column(0x20)

$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$576, DW_AT_name("spare1")
	.dwattr $C$DW$576, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$576, DW_AT_bit_size(0x01)
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x2b1)
	.dwattr $C$DW$576, DW_AT_decl_column(0x20)

$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$577, DW_AT_name("spare2")
	.dwattr $C$DW$577, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$577, DW_AT_bit_size(0x09)
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x2b2)
	.dwattr $C$DW$577, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x2aa)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$578, DW_AT_name("LaserMedianValid")
	.dwattr $C$DW$578, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$578, DW_AT_bit_size(0x01)
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x2bb)
	.dwattr $C$DW$578, DW_AT_decl_column(0x20)

$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$579, DW_AT_name("LedOn")
	.dwattr $C$DW$579, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$579, DW_AT_bit_size(0x01)
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x2bc)
	.dwattr $C$DW$579, DW_AT_decl_column(0x20)

$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$580, DW_AT_name("LaserOn")
	.dwattr $C$DW$580, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$580, DW_AT_bit_size(0x01)
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x2bd)
	.dwattr $C$DW$580, DW_AT_decl_column(0x20)

$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$581, DW_AT_name("PumpsOn")
	.dwattr $C$DW$581, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$581, DW_AT_bit_size(0x01)
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x2be)
	.dwattr $C$DW$581, DW_AT_decl_column(0x20)

$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$582, DW_AT_name("ReleaseValvesOn")
	.dwattr $C$DW$582, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$582, DW_AT_bit_size(0x01)
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x2bf)
	.dwattr $C$DW$582, DW_AT_decl_column(0x20)

$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$583, DW_AT_name("SolenoidValveOn1")
	.dwattr $C$DW$583, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$583, DW_AT_bit_size(0x01)
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x2c0)
	.dwattr $C$DW$583, DW_AT_decl_column(0x20)

$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$584, DW_AT_name("SolenoidValveOn2")
	.dwattr $C$DW$584, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$584, DW_AT_bit_size(0x01)
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x2c1)
	.dwattr $C$DW$584, DW_AT_decl_column(0x20)

$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$585, DW_AT_name("SolenoidValveOn3")
	.dwattr $C$DW$585, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$585, DW_AT_bit_size(0x01)
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x2c2)
	.dwattr $C$DW$585, DW_AT_decl_column(0x20)

$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$586, DW_AT_name("SolenoidValveOn4")
	.dwattr $C$DW$586, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$586, DW_AT_bit_size(0x01)
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x2c3)
	.dwattr $C$DW$586, DW_AT_decl_column(0x20)

$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$587, DW_AT_name("SolenoidValveOn5")
	.dwattr $C$DW$587, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$587, DW_AT_bit_size(0x01)
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x2c4)
	.dwattr $C$DW$587, DW_AT_decl_column(0x20)

$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$588, DW_AT_name("SolenoidValveOn6")
	.dwattr $C$DW$588, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$588, DW_AT_bit_size(0x01)
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x2c5)
	.dwattr $C$DW$588, DW_AT_decl_column(0x20)

$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$589, DW_AT_name("spare1")
	.dwattr $C$DW$589, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$589, DW_AT_bit_size(0x01)
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x2c6)
	.dwattr $C$DW$589, DW_AT_decl_column(0x20)

$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$590, DW_AT_name("spare2")
	.dwattr $C$DW$590, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$590, DW_AT_bit_size(0x01)
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x2c7)
	.dwattr $C$DW$590, DW_AT_decl_column(0x20)

$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$591, DW_AT_name("ActivatePackageGrip")
	.dwattr $C$DW$591, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$591, DW_AT_bit_size(0x01)
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x2c8)
	.dwattr $C$DW$591, DW_AT_decl_column(0x20)

$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$592, DW_AT_name("CommandMissed")
	.dwattr $C$DW$592, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$592, DW_AT_bit_size(0x01)
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x2c9)
	.dwattr $C$DW$592, DW_AT_decl_column(0x20)

$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$593, DW_AT_name("LaserMedianFailed")
	.dwattr $C$DW$593, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$593, DW_AT_bit_size(0x01)
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x2ca)
	.dwattr $C$DW$593, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x2ba)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x06)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$594, DW_AT_name("GripState")
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x2a6)
	.dwattr $C$DW$594, DW_AT_decl_column(0x0a)

$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$595, DW_AT_name("PackageState")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x2b5)
	.dwattr $C$DW$595, DW_AT_decl_column(0x0a)

$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$596, DW_AT_name("ElementsStates")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x2cd)
	.dwattr $C$DW$596, DW_AT_decl_column(0x0a)

$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$597, DW_AT_name("LaserMedianM")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x2ce)
	.dwattr $C$DW$597, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x297)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$61	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$61

$C$DW$T$61	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$598, DW_AT_name("ActivatePackageGrip")
	.dwattr $C$DW$598, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$598, DW_AT_bit_size(0x01)
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x2d5)
	.dwattr $C$DW$598, DW_AT_decl_column(0x1c)

$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$599, DW_AT_name("LedOnCmd")
	.dwattr $C$DW$599, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$599, DW_AT_bit_size(0x01)
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x2d6)
	.dwattr $C$DW$599, DW_AT_decl_column(0x1c)

$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$600, DW_AT_name("LaserOnCmd")
	.dwattr $C$DW$600, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$600, DW_AT_bit_size(0x01)
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0x2d7)
	.dwattr $C$DW$600, DW_AT_decl_column(0x1c)

$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$601, DW_AT_name("DirectActivationPump")
	.dwattr $C$DW$601, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$601, DW_AT_bit_size(0x01)
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0x2d8)
	.dwattr $C$DW$601, DW_AT_decl_column(0x1c)

$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$602, DW_AT_name("DirectActivationReleaseValves")
	.dwattr $C$DW$602, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$602, DW_AT_bit_size(0x01)
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0x2d9)
	.dwattr $C$DW$602, DW_AT_decl_column(0x1c)

$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$603, DW_AT_name("DirectActivationSolenoidValve1")
	.dwattr $C$DW$603, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$603, DW_AT_bit_size(0x01)
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0x2da)
	.dwattr $C$DW$603, DW_AT_decl_column(0x1c)

$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$604, DW_AT_name("DirectActivationSolenoidValve2")
	.dwattr $C$DW$604, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$604, DW_AT_bit_size(0x01)
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0x2db)
	.dwattr $C$DW$604, DW_AT_decl_column(0x1c)

$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$605, DW_AT_name("DirectActivationSolenoidValve3")
	.dwattr $C$DW$605, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$605, DW_AT_bit_size(0x01)
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0x2dc)
	.dwattr $C$DW$605, DW_AT_decl_column(0x1c)

$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$606, DW_AT_name("DirectActivationSolenoidValve4")
	.dwattr $C$DW$606, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$606, DW_AT_bit_size(0x01)
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0x2dd)
	.dwattr $C$DW$606, DW_AT_decl_column(0x1c)

$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$607, DW_AT_name("DirectActivationSolenoidValve5")
	.dwattr $C$DW$607, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$607, DW_AT_bit_size(0x01)
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0x2de)
	.dwattr $C$DW$607, DW_AT_decl_column(0x1c)

$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$608, DW_AT_name("DirectActivationSolenoidValve6")
	.dwattr $C$DW$608, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$608, DW_AT_bit_size(0x01)
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0x2df)
	.dwattr $C$DW$608, DW_AT_decl_column(0x1c)

$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$609, DW_AT_name("DoNotLookForPackage")
	.dwattr $C$DW$609, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$609, DW_AT_bit_size(0x01)
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0x2e0)
	.dwattr $C$DW$609, DW_AT_decl_column(0x1c)

$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$610, DW_AT_name("DoNotTestSuction")
	.dwattr $C$DW$610, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$610, DW_AT_bit_size(0x01)
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0x2e1)
	.dwattr $C$DW$610, DW_AT_decl_column(0x1c)

$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$611, DW_AT_name("spare3")
	.dwattr $C$DW$611, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$611, DW_AT_bit_size(0x01)
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0x2e2)
	.dwattr $C$DW$611, DW_AT_decl_column(0x1c)

$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$612, DW_AT_name("spare4")
	.dwattr $C$DW$612, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$612, DW_AT_bit_size(0x01)
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0x2e3)
	.dwattr $C$DW$612, DW_AT_decl_column(0x1c)

$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$613, DW_AT_name("DirectElementsActivationFlag")
	.dwattr $C$DW$613, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$613, DW_AT_bit_size(0x01)
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0x2e4)
	.dwattr $C$DW$613, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$61, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x2d4)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$61

	.dwendtag $C$DW$TU$61


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x01)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$614, DW_AT_name("MotionFatal")
	.dwattr $C$DW$614, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$614, DW_AT_bit_size(0x01)
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0x2ff)
	.dwattr $C$DW$614, DW_AT_decl_column(0x1e)

$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$615, DW_AT_name("PackHandleFail")
	.dwattr $C$DW$615, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$615, DW_AT_bit_size(0x01)
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0x300)
	.dwattr $C$DW$615, DW_AT_decl_column(0x1e)

$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$616, DW_AT_name("PDAbsent")
	.dwattr $C$DW$616, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$616, DW_AT_bit_size(0x01)
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0x301)
	.dwattr $C$DW$616, DW_AT_decl_column(0x1e)

$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$617, DW_AT_name("OverNeckStretch")
	.dwattr $C$DW$617, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$617, DW_AT_bit_size(0x01)
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0x302)
	.dwattr $C$DW$617, DW_AT_decl_column(0x1e)

$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$618, DW_AT_name("OnDebugWait")
	.dwattr $C$DW$618, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$618, DW_AT_bit_size(0x08)
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0x303)
	.dwattr $C$DW$618, DW_AT_decl_column(0x1e)

$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$619, DW_AT_name("DebugHoldEnabled")
	.dwattr $C$DW$619, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$619, DW_AT_bit_size(0x01)
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0x304)
	.dwattr $C$DW$619, DW_AT_decl_column(0x1e)

$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$620, DW_AT_name("IsWakeStateFault")
	.dwattr $C$DW$620, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$620, DW_AT_bit_size(0x01)
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0x305)
	.dwattr $C$DW$620, DW_AT_decl_column(0x1e)

$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$621, DW_AT_name("SerialFlashFault")
	.dwattr $C$DW$621, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$621, DW_AT_bit_size(0x01)
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0x306)
	.dwattr $C$DW$621, DW_AT_decl_column(0x1e)

$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$622, DW_AT_name("Reserved")
	.dwattr $C$DW$622, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$622, DW_AT_bit_size(0x01)
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0x307)
	.dwattr $C$DW$622, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x2fe)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x40)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$623, DW_AT_name("stat")
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0x121)
	.dwattr $C$DW$623, DW_AT_decl_column(0x0e)

$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$624, DW_AT_name("buf")
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0x122)
	.dwattr $C$DW$624, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x103)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$625, DW_AT_name("buf")
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$625, DW_AT_decl_column(0x12)

$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$626, DW_AT_name("stat")
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0x132)
	.dwattr $C$DW$626, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$67	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$67

$C$DW$T$67	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$627, DW_AT_name("buf")
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0x136)
	.dwattr $C$DW$627, DW_AT_decl_column(0x12)

$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$628, DW_AT_name("item")
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$628, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$67, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x135)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$67

	.dwendtag $C$DW$TU$67


$C$DW$TU$69	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$69

$C$DW$T$69	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x0c)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$629, DW_AT_name("buf")
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$629, DW_AT_decl_column(0x12)

$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$630, DW_AT_name("item")
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0x146)
	.dwattr $C$DW$630, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$69, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$69

	.dwendtag $C$DW$TU$69


$C$DW$TU$70	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$70

$C$DW$T$70	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x10)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$631, DW_AT_name("buf")
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$631, DW_AT_decl_column(0x12)

$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$632, DW_AT_name("item")
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0x152)
	.dwattr $C$DW$632, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$70, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x149)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$70

	.dwendtag $C$DW$TU$70


$C$DW$TU$71	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$71

$C$DW$T$71	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x10)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$633, DW_AT_name("RemoteCommand")
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0x156)
	.dwattr $C$DW$633, DW_AT_decl_column(0x23)

$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$634, DW_AT_name("buf")
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0x157)
	.dwattr $C$DW$634, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$71, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x155)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$71

	.dwendtag $C$DW$TU$71


$C$DW$TU$73	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$73

$C$DW$T$73	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x140)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$635, DW_AT_name("buf")
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0x15b)
	.dwattr $C$DW$635, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$73, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$73

	.dwendtag $C$DW$TU$73


$C$DW$TU$75	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$75

$C$DW$T$75	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x200)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$636, DW_AT_name("buf")
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$636, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$75, DW_AT_decl_file("..\Application\..\..\BHAxes\M2S_S2M.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$75

	.dwendtag $C$DW$TU$75


$C$DW$TU$76	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$76

$C$DW$T$76	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x01)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$637, DW_AT_name("bits")
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0x2a4)
	.dwattr $C$DW$637, DW_AT_decl_column(0x0f)

$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$638, DW_AT_name("all")
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0x2a5)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$76, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x299)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$76

	.dwendtag $C$DW$TU$76


$C$DW$TU$77	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$77

$C$DW$T$77	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x01)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$639, DW_AT_name("bits")
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0x2b3)
	.dwattr $C$DW$639, DW_AT_decl_column(0x0f)

$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$640, DW_AT_name("all")
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0x2b4)
	.dwattr $C$DW$640, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$77, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x2a8)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$77

	.dwendtag $C$DW$TU$77


$C$DW$TU$78	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$78

$C$DW$T$78	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$641, DW_AT_name("bits")
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0x2cb)
	.dwattr $C$DW$641, DW_AT_decl_column(0x0f)

$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$642, DW_AT_name("all")
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0x2cc)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x2b8)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$78

	.dwendtag $C$DW$TU$78


$C$DW$TU$79	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$79

$C$DW$T$79	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x01)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$643, DW_AT_name("all")
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0x2fc)
	.dwattr $C$DW$643, DW_AT_decl_column(0x19)

$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$644, DW_AT_name("bit")
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0x308)
	.dwattr $C$DW$644, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x2fb)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$79

	.dwendtag $C$DW$TU$79


$C$DW$TU$80	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$80

$C$DW$T$80	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$80, DW_AT_name("CAxisCBit")
	.dwattr $C$DW$T$80, DW_AT_byte_size(0x02)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$645, DW_AT_name("MotorOn")
	.dwattr $C$DW$645, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$645, DW_AT_bit_size(0x01)
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$645, DW_AT_decl_column(0x12)

$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$646, DW_AT_name("MotorReady")
	.dwattr $C$DW$646, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$646, DW_AT_bit_size(0x01)
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$646, DW_AT_decl_column(0x12)

$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$647, DW_AT_name("StoEvent")
	.dwattr $C$DW$647, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$647, DW_AT_bit_size(0x01)
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$647, DW_AT_decl_column(0x12)

$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$648, DW_AT_name("ProfileConverged")
	.dwattr $C$DW$648, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$648, DW_AT_bit_size(0x01)
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$648, DW_AT_decl_column(0x12)

$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$11)
