;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Wed May 15 14:56:49 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/AppIsr2.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("RtRecorder")
	.dwattr $C$DW$1, DW_AT_linkage_name("RtRecorder")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\Functions2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
	.dwendtag $C$DW$1


$C$DW$2	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$2, DW_AT_name("DealDynamixel24")
	.dwattr $C$DW$2, DW_AT_linkage_name("DealDynamixel24")

	.global	||Core2CanHandlerTx||
	.global	||Core2CanHandler||
	.global	||IsrTimer||
	.global	||PduRxPdoBitStr||
	.global	||EEFRxPdoBitStr||
	.global	||TxPdoBitStr||
	.global	||ManTxPdoBitStr||
	.global	||PieCtrlRegs||
	.global	||GpioDataRegs||
	.global	||IPC_Instance||
	.global	||ManGeo||
	.global	||EPwm3Regs||
	.global	||S2M||
	.global	||SysState||
	.global	||M2S||
	.global	||__c28xabi_cmpull||
;**************************************************************
;* SECTION GROUPS                                             *
;**************************************************************
	.group    "CanAxisIsPosition", 1
	.gmember  ".text:CanAxisIsPosition"
	.endgroup
	.group    "DisableRs485Tx_1", 1
	.gmember  ".text:DisableRs485Tx_1"
	.endgroup
	.group    "DisableRs485Tx_2", 1
	.gmember  ".text:DisableRs485Tx_2"
	.endgroup
	.group    "EnableRs485Tx_1", 1
	.gmember  ".text:EnableRs485Tx_1"
	.endgroup
	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "InitSuctionImmediate", 1
	.gmember  ".text:InitSuctionImmediate"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetMotorOff", 1
	.gmember  ".text:SetMotorOff"
	.endgroup
	.group    "SetMotorOn", 1
	.gmember  ".text:SetMotorOn"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionImmediate", 1
	.gmember  ".text:StopSuctionImmediate"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$250, DW_AT_name("I2tCntr")
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$250, DW_AT_decl_column(0x18)

$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$251, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$251, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$252, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0e)

$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$253, DW_AT_name("IPC_STS")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$253, DW_AT_decl_column(0x0e)

$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$254, DW_AT_name("IPC_SET")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$254, DW_AT_decl_column(0x0e)

$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$255, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$255, DW_AT_decl_column(0x0e)

$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$256, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$256, DW_AT_decl_column(0x0e)

$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$257, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$257, DW_AT_decl_column(0x0e)

$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$258, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$258, DW_AT_decl_column(0x0e)

$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$259, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$259, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$260	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$260)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$261, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0xed)
	.dwattr $C$DW$261, DW_AT_decl_column(0x0e)

$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$262, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0xee)
	.dwattr $C$DW$262, DW_AT_decl_column(0x0e)

$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$263, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0xef)
	.dwattr $C$DW$263, DW_AT_decl_column(0x0e)

$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$264, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$264, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$265	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$265)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$266, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$266, DW_AT_decl_column(0x0e)

$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$267, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$267, DW_AT_decl_column(0x0e)

$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$268, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$268, DW_AT_decl_column(0x0e)

$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$269, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$269, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$270	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$270)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$271, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$271, DW_AT_decl_column(0x0e)

$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$272, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$272, DW_AT_decl_column(0x0e)

$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$273, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0xff)
	.dwattr $C$DW$273, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$274	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$274)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$275, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x122)
	.dwattr $C$DW$275, DW_AT_decl_column(0x23)

$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$276, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x123)
	.dwattr $C$DW$276, DW_AT_decl_column(0x23)

$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$277, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x124)
	.dwattr $C$DW$277, DW_AT_decl_column(0x23)

$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$278, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x125)
	.dwattr $C$DW$278, DW_AT_decl_column(0x23)

$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$279, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x126)
	.dwattr $C$DW$279, DW_AT_decl_column(0x23)

$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$280, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x127)
	.dwattr $C$DW$280, DW_AT_decl_column(0x23)

$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$281, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x128)
	.dwattr $C$DW$281, DW_AT_decl_column(0x23)

$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$282, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x129)
	.dwattr $C$DW$282, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$406	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$406
$C$DW$T$406	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$406, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$406, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$406, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$406, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$406, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$406


$C$DW$TU$407	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$407
$C$DW$283	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$406)

$C$DW$T$407	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$407, DW_AT_type(*$C$DW$283)

	.dwendtag $C$DW$TU$407


$C$DW$TU$408	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$408

$C$DW$T$408	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$408, DW_AT_type(*$C$DW$T$407)
	.dwattr $C$DW$T$408, DW_AT_byte_size(0x78)
$C$DW$284	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$284, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$408

	.dwendtag $C$DW$TU$408


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$285, DW_AT_name("index")
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$285, DW_AT_decl_column(0x20)

$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$286, DW_AT_name("subindex")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x150)
	.dwattr $C$DW$286, DW_AT_decl_column(0x20)

$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$287, DW_AT_name("data_type")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x151)
	.dwattr $C$DW$287, DW_AT_decl_column(0x20)

$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$288, DW_AT_name("data_len")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x152)
	.dwattr $C$DW$288, DW_AT_decl_column(0x17)

$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$289, DW_AT_name("isset")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x153)
	.dwattr $C$DW$289, DW_AT_decl_column(0x17)

$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$290, DW_AT_name("unused")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x154)
	.dwattr $C$DW$290, DW_AT_decl_column(0x17)

$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$291, DW_AT_name("counter")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x155)
	.dwattr $C$DW$291, DW_AT_decl_column(0x1f)

$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$292, DW_AT_name("errcode")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x156)
	.dwattr $C$DW$292, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$41	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$41

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$293, DW_AT_name("UnusedSleepRequest")
	.dwattr $C$DW$293, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$293, DW_AT_bit_size(0x01)
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$293, DW_AT_decl_column(0x16)

$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$294, DW_AT_name("RebootPsCntr")
	.dwattr $C$DW$294, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$294, DW_AT_bit_size(0x04)
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$294, DW_AT_decl_column(0x16)

$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$295, DW_AT_name("ManipulatorAxesReboot")
	.dwattr $C$DW$295, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$295, DW_AT_bit_size(0x03)
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x140)
	.dwattr $C$DW$295, DW_AT_decl_column(0x16)

$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$296, DW_AT_name("Rsvd")
	.dwattr $C$DW$296, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$296, DW_AT_bit_size(0x08)
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x141)
	.dwattr $C$DW$296, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$41

	.dwendtag $C$DW$TU$41


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$297, DW_AT_name("rsvd2")
	.dwattr $C$DW$297, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$297, DW_AT_bit_size(0x05)
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x123)
	.dwattr $C$DW$297, DW_AT_decl_column(0x16)

$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$298, DW_AT_name("StoEnabled")
	.dwattr $C$DW$298, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$298, DW_AT_bit_size(0x01)
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x124)
	.dwattr $C$DW$298, DW_AT_decl_column(0x16)

$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$299, DW_AT_name("StopCan")
	.dwattr $C$DW$299, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$299, DW_AT_bit_size(0x01)
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x125)
	.dwattr $C$DW$299, DW_AT_decl_column(0x16)

$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$300, DW_AT_name("LeftPinCmd")
	.dwattr $C$DW$300, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$300, DW_AT_bit_size(0x02)
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x126)
	.dwattr $C$DW$300, DW_AT_decl_column(0x16)

$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$301, DW_AT_name("RightPinCmd")
	.dwattr $C$DW$301, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$301, DW_AT_bit_size(0x02)
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x127)
	.dwattr $C$DW$301, DW_AT_decl_column(0x16)

$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$302, DW_AT_name("CommRestart")
	.dwattr $C$DW$302, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$302, DW_AT_bit_size(0x01)
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x128)
	.dwattr $C$DW$302, DW_AT_decl_column(0x16)

$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$303, DW_AT_name("LaserPsOn")
	.dwattr $C$DW$303, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$303, DW_AT_bit_size(0x01)
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x129)
	.dwattr $C$DW$303, DW_AT_decl_column(0x16)

$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$304, DW_AT_name("RecorderTimeBasis")
	.dwattr $C$DW$304, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$304, DW_AT_decl_column(0x16)

$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$305, DW_AT_name("testRs485")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$305, DW_AT_bit_size(0x02)
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$305, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x122)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$306, DW_AT_name("rsvd")
	.dwattr $C$DW$306, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$306, DW_AT_bit_size(0x09)
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x134)
	.dwattr $C$DW$306, DW_AT_decl_column(0x16)

$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$307, DW_AT_name("NoElbowExist")
	.dwattr $C$DW$307, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$307, DW_AT_bit_size(0x01)
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x135)
	.dwattr $C$DW$307, DW_AT_decl_column(0x16)

$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$308, DW_AT_name("ManipType")
	.dwattr $C$DW$308, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$308, DW_AT_bit_size(0x06)
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x136)
	.dwattr $C$DW$308, DW_AT_decl_column(0x16)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$46	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$46

$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$309, DW_AT_name("AxesActive")
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$309, DW_AT_decl_column(0x1b)

$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$310, DW_AT_name("PumpsOn")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$310, DW_AT_decl_column(0x24)

$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$311, DW_AT_name("StateResetCnt")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x160)
	.dwattr $C$DW$311, DW_AT_decl_column(0x24)

$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$312, DW_AT_name("PackDir")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x161)
	.dwattr $C$DW$312, DW_AT_decl_column(0x24)

$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$313, DW_AT_name("ControlWord")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x162)
	.dwattr $C$DW$313, DW_AT_decl_column(0x24)

$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$314, DW_AT_name("ResetMotors")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x163)
	.dwattr $C$DW$314, DW_AT_decl_column(0x24)

$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$315, DW_AT_name("LaserDistMeter")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x164)
	.dwattr $C$DW$315, DW_AT_decl_column(0x1b)

$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$316, DW_AT_name("PinMotorCurrentAmp")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x165)
	.dwattr $C$DW$316, DW_AT_decl_column(0x1b)

$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$317, DW_AT_name("PalletAngle")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x166)
	.dwattr $C$DW$317, DW_AT_decl_column(0x1b)

$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$318, DW_AT_name("Flexmm")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x167)
	.dwattr $C$DW$318, DW_AT_decl_column(0x1b)

$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$319, DW_AT_name("DoorAngle")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x168)
	.dwattr $C$DW$319, DW_AT_decl_column(0x24)

$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$320, DW_AT_name("GoToCntr")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x169)
	.dwattr $C$DW$320, DW_AT_decl_column(0x1b)

$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$395)
	.dwattr $C$DW$321, DW_AT_name("PsCmd")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$321, DW_AT_decl_column(0x22)

$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$322, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x16b)
	.dwattr $C$DW$322, DW_AT_decl_column(0x24)

$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$323, DW_AT_name("bSerialFlashOwner")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x16c)
	.dwattr $C$DW$323, DW_AT_decl_column(0x24)

$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$324, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x16d)
	.dwattr $C$DW$324, DW_AT_decl_column(0x24)

$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$325, DW_AT_name("MalinkiSetCmd")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$325, DW_AT_decl_column(0x1b)

$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$326, DW_AT_name("PdCommandPdo")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$326, DW_AT_decl_column(0x23)

$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$327, DW_AT_name("rsvd")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x170)
	.dwattr $C$DW$327, DW_AT_decl_column(0x1a)

$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$394)
	.dwattr $C$DW$328, DW_AT_name("ModeWord")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x171)
	.dwattr $C$DW$328, DW_AT_decl_column(0x25)

$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$387)
	.dwattr $C$DW$329, DW_AT_name("ConfigWord")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x172)
	.dwattr $C$DW$329, DW_AT_decl_column(0x27)

$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$330, DW_AT_name("Checksum")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x173)
	.dwattr $C$DW$330, DW_AT_decl_column(0x24)

$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$331, DW_AT_name("InternalBufOffset")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x174)
	.dwattr $C$DW$331, DW_AT_decl_column(0x24)

$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$332, DW_AT_name("InterBufCnt")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x175)
	.dwattr $C$DW$332, DW_AT_decl_column(0x24)

	.dwattr $C$DW$T$46, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$46

	.dwendtag $C$DW$TU$46


$C$DW$TU$47	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$47

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x400)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$333, DW_AT_name("USlaveObject")
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$333, DW_AT_decl_column(0x0a)

$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$334, DW_AT_name("ActCmd")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x179)
	.dwattr $C$DW$334, DW_AT_decl_column(0x0a)

$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$335, DW_AT_name("Spare")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x17d)
	.dwattr $C$DW$335, DW_AT_decl_column(0x0b)

$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$336, DW_AT_name("DataBlock")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x181)
	.dwattr $C$DW$336, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$47

	.dwendtag $C$DW$TU$47


$C$DW$TU$48	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$48

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x0a)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$337, DW_AT_name("index")
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$337, DW_AT_decl_column(0x20)

$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$338, DW_AT_name("subindex")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$338, DW_AT_decl_column(0x20)

$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$339, DW_AT_name("data_type")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$339, DW_AT_decl_column(0x17)

$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$340, DW_AT_name("data_len")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$340, DW_AT_decl_column(0x17)

$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$341, DW_AT_name("isset")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$341, DW_AT_decl_column(0x17)

$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$342, DW_AT_name("unused")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$342, DW_AT_decl_column(0x17)

$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$343, DW_AT_name("counter")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$343, DW_AT_decl_column(0x1f)

$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$344, DW_AT_name("errcode")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$344, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$48

	.dwendtag $C$DW$TU$48


$C$DW$TU$50	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$50

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x1a)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$345, DW_AT_name("msg")
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$345, DW_AT_decl_column(0x0e)

$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$346, DW_AT_name("buf")
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$346, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$50

	.dwendtag $C$DW$TU$50


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$347, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$347, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$347, DW_AT_bit_size(0x01)
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$347, DW_AT_decl_column(0x1a)

$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$348, DW_AT_name("ManipType")
	.dwattr $C$DW$348, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$348, DW_AT_bit_size(0x06)
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x190)
	.dwattr $C$DW$348, DW_AT_decl_column(0x1a)

$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$349, DW_AT_name("Homed")
	.dwattr $C$DW$349, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$349, DW_AT_bit_size(0x01)
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x191)
	.dwattr $C$DW$349, DW_AT_decl_column(0x1a)

$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$350, DW_AT_name("Individual")
	.dwattr $C$DW$350, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$350, DW_AT_bit_size(0x01)
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x192)
	.dwattr $C$DW$350, DW_AT_decl_column(0x1a)

$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$351, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$351, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$351, DW_AT_bit_size(0x01)
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x193)
	.dwattr $C$DW$351, DW_AT_decl_column(0x1a)

$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$352, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$352, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$352, DW_AT_bit_size(0x01)
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x194)
	.dwattr $C$DW$352, DW_AT_decl_column(0x1a)

$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$353, DW_AT_name("rsvd")
	.dwattr $C$DW$353, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$353, DW_AT_bit_size(0x05)
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x195)
	.dwattr $C$DW$353, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$354, DW_AT_name("lo")
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$354, DW_AT_decl_column(0x18)

$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$355, DW_AT_name("hi")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x196)
	.dwattr $C$DW$355, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x40)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$356, DW_AT_name("PumpCmd")
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$356, DW_AT_decl_column(0x17)

$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$357, DW_AT_name("LaserCmd")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$357, DW_AT_decl_column(0x17)

$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$396)
	.dwattr $C$DW$358, DW_AT_name("PsStatus")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$358, DW_AT_decl_column(0x21)

$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$388)
	.dwattr $C$DW$359, DW_AT_name("CoreId")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$359, DW_AT_decl_column(0x1f)

$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$360, DW_AT_name("LaserVolts")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$360, DW_AT_decl_column(0x17)

$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$361, DW_AT_name("Rsvd")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$361, DW_AT_decl_column(0x17)

$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$362, DW_AT_name("AxisReadout")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$362, DW_AT_decl_column(0x17)

$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$363, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$363, DW_AT_decl_column(0x17)

$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$364, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$364, DW_AT_decl_column(0x17)

$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$365, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$365, DW_AT_decl_column(0x17)

$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$366, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$366, DW_AT_decl_column(0x17)

$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$367, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$367, DW_AT_decl_column(0x17)

$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$368, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$368, DW_AT_decl_column(0x17)

$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$369, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$369, DW_AT_decl_column(0x17)

$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$370, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$370, DW_AT_decl_column(0x17)

$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$371, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$371, DW_AT_decl_column(0x17)

$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$372, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$372, DW_AT_decl_column(0x17)

$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$373, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$373, DW_AT_decl_column(0x17)

$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$397)
	.dwattr $C$DW$374, DW_AT_name("SlaveStat")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$374, DW_AT_decl_column(0x26)

$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$375, DW_AT_name("IsOperational")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$375, DW_AT_decl_column(0x17)

$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$376, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$376, DW_AT_decl_column(0x17)

$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$377, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$377, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$58	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$58

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x30)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$378, DW_AT_name("buf")
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$378, DW_AT_decl_column(0x1b)

$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$379, DW_AT_name("flags")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x200)
	.dwattr $C$DW$379, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$58

	.dwendtag $C$DW$TU$58


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$399)
	.dwattr $C$DW$380, DW_AT_name("RStatus")
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x207)
	.dwattr $C$DW$380, DW_AT_decl_column(0x25)

$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$381, DW_AT_name("RightPinPos")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x208)
	.dwattr $C$DW$381, DW_AT_decl_column(0x17)

$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$399)
	.dwattr $C$DW$382, DW_AT_name("LStatus")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x209)
	.dwattr $C$DW$382, DW_AT_decl_column(0x25)

$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$383, DW_AT_name("LeftPinPos")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$383, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x206)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$384, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x213)
	.dwattr $C$DW$384, DW_AT_decl_column(0x20)

$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$385, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x214)
	.dwattr $C$DW$385, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x212)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x0c)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$386, DW_AT_name("DataFromPd")
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x21c)
	.dwattr $C$DW$386, DW_AT_decl_column(0x1f)

$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$387, DW_AT_name("Rsvd")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x21d)
	.dwattr $C$DW$387, DW_AT_decl_column(0x16)

$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$388, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$388, DW_AT_decl_column(0x17)

$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$389, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x21f)
	.dwattr $C$DW$389, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$63	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$63

$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x10)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$390, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x227)
	.dwattr $C$DW$390, DW_AT_decl_column(0x21)

$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$391, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x228)
	.dwattr $C$DW$391, DW_AT_decl_column(0x20)

$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$392, DW_AT_name("EEFVer")
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x229)
	.dwattr $C$DW$392, DW_AT_decl_column(0x20)

$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$393, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x22a)
	.dwattr $C$DW$393, DW_AT_decl_column(0x17)

$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$394, DW_AT_name("TrayRev")
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x22b)
	.dwattr $C$DW$394, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$63, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x226)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$63

	.dwendtag $C$DW$TU$63


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x40a)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$395, DW_AT_name("USlaveObject")
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$395, DW_AT_decl_column(0x0a)

$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$396, DW_AT_name("ActStatus")
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$396, DW_AT_decl_column(0x0a)

$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$397, DW_AT_name("Records")
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x201)
	.dwattr $C$DW$397, DW_AT_decl_column(0x0b)

$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$398, DW_AT_name("WheelArm")
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$398, DW_AT_decl_column(0x0b)

$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$399, DW_AT_name("UFlashToken")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x216)
	.dwattr $C$DW$399, DW_AT_decl_column(0x0b)

$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$400, DW_AT_name("DataFromPd")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x221)
	.dwattr $C$DW$400, DW_AT_decl_column(0x0b)

$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$401, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$401, DW_AT_decl_column(0x0b)

$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$402, DW_AT_name("Spare")
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x231)
	.dwattr $C$DW$402, DW_AT_decl_column(0x0b)

$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$403, DW_AT_name("DataBlock")
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x236)
	.dwattr $C$DW$403, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$404, DW_AT_name("MotionFatal")
	.dwattr $C$DW$404, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$404, DW_AT_bit_size(0x01)
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$404, DW_AT_decl_column(0x1e)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$405, DW_AT_name("PackHandleFail")
	.dwattr $C$DW$405, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$405, DW_AT_bit_size(0x01)
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$405, DW_AT_decl_column(0x1e)

$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$406, DW_AT_name("PDAbsent")
	.dwattr $C$DW$406, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$406, DW_AT_bit_size(0x01)
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$406, DW_AT_decl_column(0x1e)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$407, DW_AT_name("OverNeckStretch")
	.dwattr $C$DW$407, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$407, DW_AT_bit_size(0x01)
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$407, DW_AT_decl_column(0x1e)

$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$408, DW_AT_name("OnDebugWait")
	.dwattr $C$DW$408, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$408, DW_AT_bit_size(0x08)
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x3aa)
	.dwattr $C$DW$408, DW_AT_decl_column(0x1e)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$409, DW_AT_name("DebugHoldEnabled")
	.dwattr $C$DW$409, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$409, DW_AT_bit_size(0x01)
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x3ab)
	.dwattr $C$DW$409, DW_AT_decl_column(0x1e)

$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$410, DW_AT_name("IsWakeStateFault")
	.dwattr $C$DW$410, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$410, DW_AT_bit_size(0x01)
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x3ac)
	.dwattr $C$DW$410, DW_AT_decl_column(0x1e)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$411, DW_AT_name("SerialFlashFault")
	.dwattr $C$DW$411, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$411, DW_AT_bit_size(0x01)
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x3ad)
	.dwattr $C$DW$411, DW_AT_decl_column(0x1e)

$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$412, DW_AT_name("Reserved")
	.dwattr $C$DW$412, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$412, DW_AT_bit_size(0x01)
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x3ae)
	.dwattr $C$DW$412, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$66	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$66

$C$DW$T$66	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$413, DW_AT_name("msg")
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x158)
	.dwattr $C$DW$413, DW_AT_decl_column(0x0e)

$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$414, DW_AT_name("buf")
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x159)
	.dwattr $C$DW$414, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$66, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$66

	.dwendtag $C$DW$TU$66


$C$DW$TU$68	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$68

$C$DW$T$68	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x40)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$415, DW_AT_name("cmd")
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x176)
	.dwattr $C$DW$415, DW_AT_decl_column(0x13)

$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$416, DW_AT_name("buf")
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x178)
	.dwattr $C$DW$416, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$68, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x15c)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$68

	.dwendtag $C$DW$TU$68


$C$DW$TU$70	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$70

$C$DW$T$70	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x1b0)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$417, DW_AT_name("buf")
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x17c)
	.dwattr $C$DW$417, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$70, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$70

	.dwendtag $C$DW$TU$70


$C$DW$TU$72	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$72

$C$DW$T$72	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x200)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$418, DW_AT_name("buf")
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x180)
	.dwattr $C$DW$418, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$72, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$72

	.dwendtag $C$DW$TU$72


$C$DW$TU$73	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$73

$C$DW$T$73	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x40)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$419, DW_AT_name("stat")
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$419, DW_AT_decl_column(0x0e)

$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$420, DW_AT_name("buf")
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$420, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$73, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$73

	.dwendtag $C$DW$TU$73


$C$DW$TU$74	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$74

$C$DW$T$74	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x10)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$421, DW_AT_name("buf")
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x204)
	.dwattr $C$DW$421, DW_AT_decl_column(0x12)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$422, DW_AT_name("stat")
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$422, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$74, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x203)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$74

	.dwendtag $C$DW$TU$74


$C$DW$TU$76	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$76

$C$DW$T$76	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$423, DW_AT_name("buf")
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x210)
	.dwattr $C$DW$423, DW_AT_decl_column(0x12)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$424, DW_AT_name("item")
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x215)
	.dwattr $C$DW$424, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$76, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x20f)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$76

	.dwendtag $C$DW$TU$76


$C$DW$TU$78	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$78

$C$DW$T$78	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$425, DW_AT_name("buf")
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x219)
	.dwattr $C$DW$425, DW_AT_decl_column(0x12)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$426, DW_AT_name("item")
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x220)
	.dwattr $C$DW$426, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$78, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x218)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$78

	.dwendtag $C$DW$TU$78


$C$DW$TU$79	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$79

$C$DW$T$79	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x10)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$427, DW_AT_name("buf")
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x224)
	.dwattr $C$DW$427, DW_AT_decl_column(0x12)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$428, DW_AT_name("item")
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x22c)
	.dwattr $C$DW$428, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$79, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x223)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$79

	.dwendtag $C$DW$TU$79


$C$DW$TU$81	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$81

$C$DW$T$81	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x150)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$429, DW_AT_name("buf")
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x230)
	.dwattr $C$DW$429, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$81, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$81, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$T$81, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$81

	.dwendtag $C$DW$TU$81


$C$DW$TU$82	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$82

$C$DW$T$82	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x200)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$430, DW_AT_name("buf")
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0x235)
	.dwattr $C$DW$430, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$82, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x234)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$82

	.dwendtag $C$DW$TU$82


$C$DW$TU$83	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$83

$C$DW$T$83	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x01)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$431, DW_AT_name("all")
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$431, DW_AT_decl_column(0x19)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$432, DW_AT_name("bit")
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x3af)
	.dwattr $C$DW$432, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$83, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$83

	.dwendtag $C$DW$TU$83


$C$DW$TU$85	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$85

$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_name("AQCSFRC_BITS")
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x01)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$433, DW_AT_name("CSFA")
	.dwattr $C$DW$433, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$433, DW_AT_bit_size(0x02)
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$433, DW_AT_decl_column(0x0c)

$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$434, DW_AT_name("CSFB")
	.dwattr $C$DW$434, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$434, DW_AT_bit_size(0x02)
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$434, DW_AT_decl_column(0x0c)

$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$435, DW_AT_name("rsvd1")
	.dwattr $C$DW$435, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$435, DW_AT_bit_size(0x0c)
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$435, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$85, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$85

	.dwendtag $C$DW$TU$85


$C$DW$TU$86	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$86

$C$DW$T$86	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$86, DW_AT_name("AQCSFRC_REG")
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x01)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$436, DW_AT_name("all")
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$436, DW_AT_decl_column(0x0d)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$437, DW_AT_name("bit")
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x1e1)
	.dwattr $C$DW$437, DW_AT_decl_column(0x1b)

	.dwattr $C$DW$T$86, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x07)
	.dwendtag $C$DW$T$86

	.dwendtag $C$DW$TU$86


$C$DW$TU$87	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$87

$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_name("AQCTLA2_BITS")
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x01)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$438, DW_AT_name("T1U")
	.dwattr $C$DW$438, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$438, DW_AT_bit_size(0x02)
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$438, DW_AT_decl_column(0x0c)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$439, DW_AT_name("T1D")
	.dwattr $C$DW$439, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$439, DW_AT_bit_size(0x02)
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x1a4)
	.dwattr $C$DW$439, DW_AT_decl_column(0x0c)

$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$440, DW_AT_name("T2U")
	.dwattr $C$DW$440, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$440, DW_AT_bit_size(0x02)
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x1a5)
	.dwattr $C$DW$440, DW_AT_decl_column(0x0c)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$441, DW_AT_name("T2D")
	.dwattr $C$DW$441, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$441, DW_AT_bit_size(0x02)
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$441, DW_AT_decl_column(0x0c)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$442, DW_AT_name("rsvd1")
	.dwattr $C$DW$442, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$442, DW_AT_bit_size(0x08)
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$442, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$87, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_utils\f2838x_epwm.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$87

	.dwendtag $C$DW$TU$87


$C$DW$TU$88	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$88

$C$DW$T$88	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$88, DW_AT_name("AQCTLA2_REG")
	.dwattr $C$DW$T$88, DW_AT_byte_size(0x01)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$443, DW_AT_name("all")
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
