;***************************************************************
;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
;* Date/Time created: Wed May 15 14:56:58 2024                 *
;***************************************************************
	.compiler_opts --abi=eabi --cla_support=cla0 --float_support=fpu64 --hll_source=on --idiv_support=idiv0 --issue_remarks --mem_model:code=flat --mem_model:data=large --object_format=elf --quiet --silicon_errata_fpu1_workaround=off --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=4 --tmu_support=tmu0 
	.asg	XAR2, FP

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Application/ManState.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("C:\Yahali\Nimrod\Sw3\BolshoyManipCpu2\CPU2")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("ResetProfiler")
	.dwattr $C$DW$1, DW_AT_linkage_name("ResetProfiler")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\Application\TrapezeProfiler2.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x23)
	.dwattr $C$DW$1, DW_AT_decl_column(0x06)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$225)

$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$16)


	.global	||ManControlCbitCntr||
	.global	||XYTraj||
	.global	||GpioDataRegs||
	.global	||XProfile||
	.global	||IPC_Instance||
	.global	||ManGeo||
	.global	||DynStat24||
	.global	||DynStat12||
	.global	||Dynamixel24||
	.global	||SysTimerStr||
	.global	||S2M||
	.global	||vvec||
	.global	||avec||
	.global	||SysState||
	.global	||ManCmd||
	.global	||__c28xabi_cmpull||
;**************************************************************
;* SECTION GROUPS                                             *
;**************************************************************
	.group    "CanAxisIsPosition", 1
	.gmember  ".text:CanAxisIsPosition"
	.endgroup
	.group    "DisableRs485Tx_1", 1
	.gmember  ".text:DisableRs485Tx_1"
	.endgroup
	.group    "DisableRs485Tx_2", 1
	.gmember  ".text:DisableRs485Tx_2"
	.endgroup
	.group    "EnableRs485Tx_1", 1
	.gmember  ".text:EnableRs485Tx_1"
	.endgroup
	.group    "EnableRs485Tx_2", 1
	.gmember  ".text:EnableRs485Tx_2"
	.endgroup
	.group    "Flash_RelinquishPumpSemaphore", 1
	.gmember  ".text:Flash_RelinquishPumpSemaphore"
	.endgroup
	.group    "GetCanAxisPosTarget", 1
	.gmember  ".text:GetCanAxisPosTarget"
	.endgroup
	.group    "GetSemaphore", 1
	.gmember  ".text:GetSemaphore"
	.endgroup
	.group    "InitSuctionImmediate", 1
	.gmember  ".text:InitSuctionImmediate"
	.endgroup
	.group    "InitSuctionMonitor", 1
	.gmember  ".text:InitSuctionMonitor"
	.endgroup
	.group    "IsAtFault", 1
	.gmember  ".text:IsAtFault"
	.endgroup
	.group    "IsFaultFree", 1
	.gmember  ".text:IsFaultFree"
	.endgroup
	.group    "IsGen3", 1
	.gmember  ".text:IsGen3"
	.endgroup
	.group    "IsMotorOn", 1
	.gmember  ".text:IsMotorOn"
	.endgroup
	.group    "IsPsActive", 1
	.gmember  ".text:IsPsActive"
	.endgroup
	.group    "IsSpeedCmdZero", 1
	.gmember  ".text:IsSpeedCmdZero"
	.endgroup
	.group    "ResetAxisFaults", 1
	.gmember  ".text:ResetAxisFaults"
	.endgroup
	.group    "SetCanAxisPosTarget", 1
	.gmember  ".text:SetCanAxisPosTarget"
	.endgroup
	.group    "SetMotorOff", 1
	.gmember  ".text:SetMotorOff"
	.endgroup
	.group    "SetMotorOn", 1
	.gmember  ".text:SetMotorOn"
	.endgroup
	.group    "SetPosCmd2PosFeedback", 1
	.gmember  ".text:SetPosCmd2PosFeedback"
	.endgroup
	.group    "SetWheelSpeedCmd", 1
	.gmember  ".text:SetWheelSpeedCmd"
	.endgroup
	.group    "StopSuctionImmediate", 1
	.gmember  ".text:StopSuctionImmediate"
	.endgroup
	.group    "StopSuctionMonitor", 1
	.gmember  ".text:StopSuctionMonitor"
	.endgroup
	.group    "__fpclassify", 1
	.gmember  ".text:__fpclassify"
	.endgroup
	.group    "__fpclassifyf", 1
	.gmember  ".text:__fpclassifyf"
	.endgroup
	.group    "__fpclassifyl", 1
	.gmember  ".text:__fpclassifyl"
	.endgroup
	.group    "__isfinite", 1
	.gmember  ".text:__isfinite"
	.endgroup
	.group    "__isfinitef", 1
	.gmember  ".text:__isfinitef"
	.endgroup
	.group    "__isfinitel", 1
	.gmember  ".text:__isfinitel"
	.endgroup
	.group    "__isinf", 1
	.gmember  ".text:__isinf"
	.endgroup
	.group    "__isinff", 1
	.gmember  ".text:__isinff"
	.endgroup
	.group    "__isinfl", 1
	.gmember  ".text:__isinfl"
	.endgroup
	.group    "__isnan", 1
	.gmember  ".text:__isnan"
	.endgroup
	.group    "__isnanf", 1
	.gmember  ".text:__isnanf"
	.endgroup
	.group    "__isnanl", 1
	.gmember  ".text:__isnanl"
	.endgroup
	.group    "__isnormal", 1
	.gmember  ".text:__isnormal"
	.endgroup
	.group    "__isnormalf", 1
	.gmember  ".text:__isnormalf"
	.endgroup
	.group    "__isnormall", 1
	.gmember  ".text:__isnormall"
	.endgroup
	.group    "__relaxed_atan2f", 1
	.gmember  ".text:__relaxed_atan2f"
	.endgroup
	.group    "__relaxed_atanf", 1
	.gmember  ".text:__relaxed_atanf"
	.endgroup
	.group    "__relaxed_cosf", 1
	.gmember  ".text:__relaxed_cosf"
	.endgroup
	.group    "__relaxed_fmaxf", 1
	.gmember  ".text:__relaxed_fmaxf"
	.endgroup
	.group    "__relaxed_fminf", 1
	.gmember  ".text:__relaxed_fminf"
	.endgroup
	.group    "__relaxed_fmodf", 1
	.gmember  ".text:__relaxed_fmodf"
	.endgroup
	.group    "__relaxed_sinf", 1
	.gmember  ".text:__relaxed_sinf"
	.endgroup
	.group    "__relaxed_sqrtf", 1
	.gmember  ".text:__relaxed_sqrtf"
	.endgroup
	.group    "__signbit", 1
	.gmember  ".text:__signbit"
	.endgroup
	.group    "__signbitf", 1
	.gmember  ".text:__signbitf"
	.endgroup
	.group    "__signbitl", 1
	.gmember  ".text:__signbitl"
	.endgroup


;***************************************************************
;* BUILD ATTRIBUTES                                            *
;***************************************************************
	.battr "c28xabi", Tag_File, 1, Tag_float_args(1)
	.battr "c28xabi", Tag_File, 1, Tag_double_args(1)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	same_value, 28
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	same_value, 59
	.dwcfi	same_value, 63
	.dwcfi	same_value, 67
	.dwcfi	same_value, 71
	.dwendentry
	.dwendtag $C$DW$CU


;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$TU$19	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$19

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x02)
$C$DW$1151	.dwtag  DW_TAG_member
	.dwattr $C$DW$1151, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1151, DW_AT_name("I2tCntr")
	.dwattr $C$DW$1151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1151, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1151, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$1151, DW_AT_decl_column(0x18)

$C$DW$1152	.dwtag  DW_TAG_member
	.dwattr $C$DW$1152, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1152, DW_AT_name("I2tBeanCntr")
	.dwattr $C$DW$1152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1152, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1152, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1152, DW_AT_decl_column(0x18)

	.dwattr $C$DW$T$19, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$19

	.dwendtag $C$DW$TU$19


$C$DW$TU$22	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$22

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
$C$DW$1153	.dwtag  DW_TAG_member
	.dwattr $C$DW$1153, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1153, DW_AT_name("IPC_ACK")
	.dwattr $C$DW$1153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1153, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1153, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1153, DW_AT_decl_column(0x0e)

$C$DW$1154	.dwtag  DW_TAG_member
	.dwattr $C$DW$1154, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1154, DW_AT_name("IPC_STS")
	.dwattr $C$DW$1154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1154, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1154, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1154, DW_AT_decl_column(0x0e)

$C$DW$1155	.dwtag  DW_TAG_member
	.dwattr $C$DW$1155, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1155, DW_AT_name("IPC_SET")
	.dwattr $C$DW$1155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1155, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1155, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1155, DW_AT_decl_column(0x0e)

$C$DW$1156	.dwtag  DW_TAG_member
	.dwattr $C$DW$1156, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1156, DW_AT_name("IPC_CLR")
	.dwattr $C$DW$1156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1156, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1156, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1156, DW_AT_decl_column(0x0e)

$C$DW$1157	.dwtag  DW_TAG_member
	.dwattr $C$DW$1157, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1157, DW_AT_name("IPC_FLG")
	.dwattr $C$DW$1157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1157, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1157, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1157, DW_AT_decl_column(0x0e)

$C$DW$1158	.dwtag  DW_TAG_member
	.dwattr $C$DW$1158, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1158, DW_AT_name("IPC_RSVDREG")
	.dwattr $C$DW$1158, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1158, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1158, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$1158, DW_AT_decl_column(0x0e)

$C$DW$1159	.dwtag  DW_TAG_member
	.dwattr $C$DW$1159, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1159, DW_AT_name("IPC_COUNTERL")
	.dwattr $C$DW$1159, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1159, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1159, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1159, DW_AT_decl_column(0x0e)

$C$DW$1160	.dwtag  DW_TAG_member
	.dwattr $C$DW$1160, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1160, DW_AT_name("IPC_COUNTERH")
	.dwattr $C$DW$1160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1160, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1160, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1160, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$22

	.dwendtag $C$DW$TU$22


$C$DW$TU$26	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$26
$C$DW$T$26	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$26, DW_AT_name("IPC_Flag_Ctr_Reg_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$26


$C$DW$TU$27	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$27
$C$DW$1161	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1161, DW_AT_type(*$C$DW$T$26)

$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$1161)

	.dwendtag $C$DW$TU$27


$C$DW$TU$28	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$28
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$28


$C$DW$TU$23	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$23

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x08)
$C$DW$1162	.dwtag  DW_TAG_member
	.dwattr $C$DW$1162, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1162, DW_AT_name("IPC_SENDCOM")
	.dwattr $C$DW$1162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1162, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1162, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1162, DW_AT_decl_column(0x0e)

$C$DW$1163	.dwtag  DW_TAG_member
	.dwattr $C$DW$1163, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1163, DW_AT_name("IPC_SENDADDR")
	.dwattr $C$DW$1163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1163, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1163, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1163, DW_AT_decl_column(0x0e)

$C$DW$1164	.dwtag  DW_TAG_member
	.dwattr $C$DW$1164, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1164, DW_AT_name("IPC_SENDDATA")
	.dwattr $C$DW$1164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1164, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1164, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1164, DW_AT_decl_column(0x0e)

$C$DW$1165	.dwtag  DW_TAG_member
	.dwattr $C$DW$1165, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1165, DW_AT_name("IPC_REMOTEREPLY")
	.dwattr $C$DW$1165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1165, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1165, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1165, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$23

	.dwendtag $C$DW$TU$23


$C$DW$TU$29	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$29
$C$DW$T$29	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$29, DW_AT_name("IPC_SendCmd_Reg_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$29


$C$DW$TU$30	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$30
$C$DW$1166	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1166, DW_AT_type(*$C$DW$T$29)

$C$DW$T$30	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$1166)

	.dwendtag $C$DW$TU$30


$C$DW$TU$31	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$31
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$31


$C$DW$TU$24	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$24

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
$C$DW$1167	.dwtag  DW_TAG_member
	.dwattr $C$DW$1167, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1167, DW_AT_name("IPC_RECVCOM")
	.dwattr $C$DW$1167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1167, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1167, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$1167, DW_AT_decl_column(0x0e)

$C$DW$1168	.dwtag  DW_TAG_member
	.dwattr $C$DW$1168, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1168, DW_AT_name("IPC_RECVADDR")
	.dwattr $C$DW$1168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1168, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1168, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$1168, DW_AT_decl_column(0x0e)

$C$DW$1169	.dwtag  DW_TAG_member
	.dwattr $C$DW$1169, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1169, DW_AT_name("IPC_RECVDATA")
	.dwattr $C$DW$1169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1169, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1169, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$1169, DW_AT_decl_column(0x0e)

$C$DW$1170	.dwtag  DW_TAG_member
	.dwattr $C$DW$1170, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1170, DW_AT_name("IPC_LOCALREPLY")
	.dwattr $C$DW$1170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1170, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1170, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$1170, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

	.dwendtag $C$DW$TU$24


$C$DW$TU$32	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$32
$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("IPC_RecvCmd_Reg_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$32


$C$DW$TU$33	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$33
$C$DW$1171	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1171, DW_AT_type(*$C$DW$T$32)

$C$DW$T$33	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$1171)

	.dwendtag $C$DW$TU$33


$C$DW$TU$34	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$34
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$34


$C$DW$TU$25	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$25

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x06)
$C$DW$1172	.dwtag  DW_TAG_member
	.dwattr $C$DW$1172, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1172, DW_AT_name("IPC_BOOTSTS")
	.dwattr $C$DW$1172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1172, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1172, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$1172, DW_AT_decl_column(0x0e)

$C$DW$1173	.dwtag  DW_TAG_member
	.dwattr $C$DW$1173, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1173, DW_AT_name("IPC_BOOTMODE")
	.dwattr $C$DW$1173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1173, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1173, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$1173, DW_AT_decl_column(0x0e)

$C$DW$1174	.dwtag  DW_TAG_member
	.dwattr $C$DW$1174, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1174, DW_AT_name("IPC_PUMPREQUEST")
	.dwattr $C$DW$1174, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1174, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1174, DW_AT_decl_line(0xff)
	.dwattr $C$DW$1174, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

	.dwendtag $C$DW$TU$25


$C$DW$TU$35	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$35
$C$DW$T$35	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$35, DW_AT_name("IPC_Boot_Pump_Reg_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x100)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$35


$C$DW$TU$36	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$36
$C$DW$1175	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1175, DW_AT_type(*$C$DW$T$35)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$1175)

	.dwendtag $C$DW$TU$36


$C$DW$TU$37	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$37
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x20)

	.dwendtag $C$DW$TU$37


$C$DW$TU$39	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$39

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1e)
$C$DW$1176	.dwtag  DW_TAG_member
	.dwattr $C$DW$1176, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1176, DW_AT_name("IPC_Flag_Ctr_Reg")
	.dwattr $C$DW$1176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1176, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1176, DW_AT_decl_line(0x122)
	.dwattr $C$DW$1176, DW_AT_decl_column(0x23)

$C$DW$1177	.dwtag  DW_TAG_member
	.dwattr $C$DW$1177, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$1177, DW_AT_name("IPC_SendCmd_Reg")
	.dwattr $C$DW$1177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1177, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1177, DW_AT_decl_line(0x123)
	.dwattr $C$DW$1177, DW_AT_decl_column(0x23)

$C$DW$1178	.dwtag  DW_TAG_member
	.dwattr $C$DW$1178, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$1178, DW_AT_name("IPC_RecvCmd_Reg")
	.dwattr $C$DW$1178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1178, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1178, DW_AT_decl_line(0x124)
	.dwattr $C$DW$1178, DW_AT_decl_column(0x23)

$C$DW$1179	.dwtag  DW_TAG_member
	.dwattr $C$DW$1179, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$1179, DW_AT_name("IPC_Boot_Pump_Reg")
	.dwattr $C$DW$1179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1179, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1179, DW_AT_decl_line(0x125)
	.dwattr $C$DW$1179, DW_AT_decl_column(0x23)

$C$DW$1180	.dwtag  DW_TAG_member
	.dwattr $C$DW$1180, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$1180, DW_AT_name("IPC_IntNum")
	.dwattr $C$DW$1180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1180, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1180, DW_AT_decl_line(0x126)
	.dwattr $C$DW$1180, DW_AT_decl_column(0x23)

$C$DW$1181	.dwtag  DW_TAG_member
	.dwattr $C$DW$1181, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1181, DW_AT_name("IPC_MsgRam_LtoR")
	.dwattr $C$DW$1181, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1181, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1181, DW_AT_decl_line(0x127)
	.dwattr $C$DW$1181, DW_AT_decl_column(0x23)

$C$DW$1182	.dwtag  DW_TAG_member
	.dwattr $C$DW$1182, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1182, DW_AT_name("IPC_MsgRam_RtoL")
	.dwattr $C$DW$1182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1182, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1182, DW_AT_decl_line(0x128)
	.dwattr $C$DW$1182, DW_AT_decl_column(0x23)

$C$DW$1183	.dwtag  DW_TAG_member
	.dwattr $C$DW$1183, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$1183, DW_AT_name("IPC_Offset_Corr")
	.dwattr $C$DW$1183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1183, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$1183, DW_AT_decl_line(0x129)
	.dwattr $C$DW$1183, DW_AT_decl_column(0x23)

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x121)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

	.dwendtag $C$DW$TU$39


$C$DW$TU$213	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$213
$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("IPC_Instance_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$213, DW_AT_decl_file("..\Application\..\Drivers\..\F2838x_driverlib\driverlib\ipc.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x02)

	.dwendtag $C$DW$TU$213


$C$DW$TU$214	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$214
$C$DW$1184	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$1184, DW_AT_type(*$C$DW$T$213)

$C$DW$T$214	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$1184)

	.dwendtag $C$DW$TU$214


$C$DW$TU$215	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$215

$C$DW$T$215	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
	.dwattr $C$DW$T$215, DW_AT_byte_size(0x78)
$C$DW$1185	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$1185, DW_AT_upper_bound(0x03)

	.dwendtag $C$DW$T$215

	.dwendtag $C$DW$TU$215


$C$DW$TU$40	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$40

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
$C$DW$1186	.dwtag  DW_TAG_member
	.dwattr $C$DW$1186, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1186, DW_AT_name("index")
	.dwattr $C$DW$1186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1186, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1186, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$1186, DW_AT_decl_column(0x20)

$C$DW$1187	.dwtag  DW_TAG_member
	.dwattr $C$DW$1187, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1187, DW_AT_name("subindex")
	.dwattr $C$DW$1187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1187, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1187, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$1187, DW_AT_decl_column(0x20)

$C$DW$1188	.dwtag  DW_TAG_member
	.dwattr $C$DW$1188, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1188, DW_AT_name("data_type")
	.dwattr $C$DW$1188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1188, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1188, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$1188, DW_AT_decl_column(0x17)

$C$DW$1189	.dwtag  DW_TAG_member
	.dwattr $C$DW$1189, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1189, DW_AT_name("data_len")
	.dwattr $C$DW$1189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1189, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1189, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$1189, DW_AT_decl_column(0x17)

$C$DW$1190	.dwtag  DW_TAG_member
	.dwattr $C$DW$1190, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1190, DW_AT_name("isset")
	.dwattr $C$DW$1190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1190, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1190, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$1190, DW_AT_decl_column(0x17)

$C$DW$1191	.dwtag  DW_TAG_member
	.dwattr $C$DW$1191, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1191, DW_AT_name("unused")
	.dwattr $C$DW$1191, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$1191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1191, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1191, DW_AT_decl_line(0x1d8)
	.dwattr $C$DW$1191, DW_AT_decl_column(0x17)

$C$DW$1192	.dwtag  DW_TAG_member
	.dwattr $C$DW$1192, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1192, DW_AT_name("counter")
	.dwattr $C$DW$1192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1192, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1192, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$1192, DW_AT_decl_column(0x1f)

$C$DW$1193	.dwtag  DW_TAG_member
	.dwattr $C$DW$1193, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1193, DW_AT_name("errcode")
	.dwattr $C$DW$1193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1193, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1193, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$1193, DW_AT_decl_column(0x1f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x1d2)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$40

	.dwendtag $C$DW$TU$40


$C$DW$TU$42	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$42

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x1a)
$C$DW$1194	.dwtag  DW_TAG_member
	.dwattr $C$DW$1194, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$1194, DW_AT_name("msg")
	.dwattr $C$DW$1194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1194, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1194, DW_AT_decl_line(0x1dc)
	.dwattr $C$DW$1194, DW_AT_decl_column(0x0e)

$C$DW$1195	.dwtag  DW_TAG_member
	.dwattr $C$DW$1195, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1195, DW_AT_name("buf")
	.dwattr $C$DW$1195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1195, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1195, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$1195, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1d0)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$42

	.dwendtag $C$DW$TU$42


$C$DW$TU$43	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$43

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$1196	.dwtag  DW_TAG_member
	.dwattr $C$DW$1196, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1196, DW_AT_name("RecorderUpdating")
	.dwattr $C$DW$1196, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1196, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1196, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1196, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$1196, DW_AT_decl_column(0x1a)

$C$DW$1197	.dwtag  DW_TAG_member
	.dwattr $C$DW$1197, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1197, DW_AT_name("ManipType")
	.dwattr $C$DW$1197, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1197, DW_AT_bit_size(0x06)
	.dwattr $C$DW$1197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1197, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1197, DW_AT_decl_line(0x190)
	.dwattr $C$DW$1197, DW_AT_decl_column(0x1a)

$C$DW$1198	.dwtag  DW_TAG_member
	.dwattr $C$DW$1198, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1198, DW_AT_name("Homed")
	.dwattr $C$DW$1198, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1198, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1198, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1198, DW_AT_decl_line(0x191)
	.dwattr $C$DW$1198, DW_AT_decl_column(0x1a)

$C$DW$1199	.dwtag  DW_TAG_member
	.dwattr $C$DW$1199, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1199, DW_AT_name("Individual")
	.dwattr $C$DW$1199, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1199, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1199, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1199, DW_AT_decl_line(0x192)
	.dwattr $C$DW$1199, DW_AT_decl_column(0x1a)

$C$DW$1200	.dwtag  DW_TAG_member
	.dwattr $C$DW$1200, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1200, DW_AT_name("FlexArmHomed")
	.dwattr $C$DW$1200, DW_AT_bit_offset(0x06)
	.dwattr $C$DW$1200, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1200, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1200, DW_AT_decl_line(0x193)
	.dwattr $C$DW$1200, DW_AT_decl_column(0x1a)

$C$DW$1201	.dwtag  DW_TAG_member
	.dwattr $C$DW$1201, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1201, DW_AT_name("SpacerHomed")
	.dwattr $C$DW$1201, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1201, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1201, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1201, DW_AT_decl_line(0x194)
	.dwattr $C$DW$1201, DW_AT_decl_column(0x1a)

$C$DW$1202	.dwtag  DW_TAG_member
	.dwattr $C$DW$1202, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1202, DW_AT_name("rsvd")
	.dwattr $C$DW$1202, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1202, DW_AT_bit_size(0x05)
	.dwattr $C$DW$1202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1202, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1202, DW_AT_decl_line(0x195)
	.dwattr $C$DW$1202, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$43

	.dwendtag $C$DW$TU$43


$C$DW$TU$44	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$44

$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
$C$DW$1203	.dwtag  DW_TAG_member
	.dwattr $C$DW$1203, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1203, DW_AT_name("lo")
	.dwattr $C$DW$1203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1203, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1203, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$1203, DW_AT_decl_column(0x18)

$C$DW$1204	.dwtag  DW_TAG_member
	.dwattr $C$DW$1204, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$1204, DW_AT_name("hi")
	.dwattr $C$DW$1204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1204, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1204, DW_AT_decl_line(0x196)
	.dwattr $C$DW$1204, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$44, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x18b)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$44

	.dwendtag $C$DW$TU$44


$C$DW$TU$47	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$47

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x40)
$C$DW$1205	.dwtag  DW_TAG_member
	.dwattr $C$DW$1205, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1205, DW_AT_name("PumpCmd")
	.dwattr $C$DW$1205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1205, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1205, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$1205, DW_AT_decl_column(0x17)

$C$DW$1206	.dwtag  DW_TAG_member
	.dwattr $C$DW$1206, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1206, DW_AT_name("LaserCmd")
	.dwattr $C$DW$1206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1206, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1206, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$1206, DW_AT_decl_column(0x17)

$C$DW$1207	.dwtag  DW_TAG_member
	.dwattr $C$DW$1207, DW_AT_type(*$C$DW$T$207)
	.dwattr $C$DW$1207, DW_AT_name("PsStatus")
	.dwattr $C$DW$1207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1207, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1207, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$1207, DW_AT_decl_column(0x21)

$C$DW$1208	.dwtag  DW_TAG_member
	.dwattr $C$DW$1208, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$1208, DW_AT_name("CoreId")
	.dwattr $C$DW$1208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1208, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1208, DW_AT_decl_line(0x1e6)
	.dwattr $C$DW$1208, DW_AT_decl_column(0x1f)

$C$DW$1209	.dwtag  DW_TAG_member
	.dwattr $C$DW$1209, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1209, DW_AT_name("LaserVolts")
	.dwattr $C$DW$1209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1209, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1209, DW_AT_decl_line(0x1e7)
	.dwattr $C$DW$1209, DW_AT_decl_column(0x17)

$C$DW$1210	.dwtag  DW_TAG_member
	.dwattr $C$DW$1210, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1210, DW_AT_name("Rsvd")
	.dwattr $C$DW$1210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1210, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1210, DW_AT_decl_line(0x1e8)
	.dwattr $C$DW$1210, DW_AT_decl_column(0x17)

$C$DW$1211	.dwtag  DW_TAG_member
	.dwattr $C$DW$1211, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$1211, DW_AT_name("AxisReadout")
	.dwattr $C$DW$1211, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1211, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1211, DW_AT_decl_line(0x1e9)
	.dwattr $C$DW$1211, DW_AT_decl_column(0x17)

$C$DW$1212	.dwtag  DW_TAG_member
	.dwattr $C$DW$1212, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1212, DW_AT_name("ManipData1_L")
	.dwattr $C$DW$1212, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1212, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1212, DW_AT_decl_line(0x1ea)
	.dwattr $C$DW$1212, DW_AT_decl_column(0x17)

$C$DW$1213	.dwtag  DW_TAG_member
	.dwattr $C$DW$1213, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1213, DW_AT_name("ManipData1_H")
	.dwattr $C$DW$1213, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1213, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1213, DW_AT_decl_line(0x1eb)
	.dwattr $C$DW$1213, DW_AT_decl_column(0x17)

$C$DW$1214	.dwtag  DW_TAG_member
	.dwattr $C$DW$1214, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1214, DW_AT_name("ManipData1_HH")
	.dwattr $C$DW$1214, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1214, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1214, DW_AT_decl_line(0x1ec)
	.dwattr $C$DW$1214, DW_AT_decl_column(0x17)

$C$DW$1215	.dwtag  DW_TAG_member
	.dwattr $C$DW$1215, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1215, DW_AT_name("ManipData2_L")
	.dwattr $C$DW$1215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1215, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1215, DW_AT_decl_line(0x1ed)
	.dwattr $C$DW$1215, DW_AT_decl_column(0x17)

$C$DW$1216	.dwtag  DW_TAG_member
	.dwattr $C$DW$1216, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1216, DW_AT_name("ManipData2_H")
	.dwattr $C$DW$1216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1216, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1216, DW_AT_decl_line(0x1ee)
	.dwattr $C$DW$1216, DW_AT_decl_column(0x17)

$C$DW$1217	.dwtag  DW_TAG_member
	.dwattr $C$DW$1217, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1217, DW_AT_name("ManipData3_L")
	.dwattr $C$DW$1217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1217, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1217, DW_AT_decl_line(0x1ef)
	.dwattr $C$DW$1217, DW_AT_decl_column(0x17)

$C$DW$1218	.dwtag  DW_TAG_member
	.dwattr $C$DW$1218, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1218, DW_AT_name("ManipData3_H")
	.dwattr $C$DW$1218, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1218, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1218, DW_AT_decl_line(0x1f0)
	.dwattr $C$DW$1218, DW_AT_decl_column(0x17)

$C$DW$1219	.dwtag  DW_TAG_member
	.dwattr $C$DW$1219, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1219, DW_AT_name("ManipData4_L")
	.dwattr $C$DW$1219, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$1219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1219, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1219, DW_AT_decl_line(0x1f1)
	.dwattr $C$DW$1219, DW_AT_decl_column(0x17)

$C$DW$1220	.dwtag  DW_TAG_member
	.dwattr $C$DW$1220, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1220, DW_AT_name("ManipData4_H")
	.dwattr $C$DW$1220, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1220, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1220, DW_AT_decl_line(0x1f2)
	.dwattr $C$DW$1220, DW_AT_decl_column(0x17)

$C$DW$1221	.dwtag  DW_TAG_member
	.dwattr $C$DW$1221, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1221, DW_AT_name("ManipData5_L")
	.dwattr $C$DW$1221, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1221, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1221, DW_AT_decl_line(0x1f3)
	.dwattr $C$DW$1221, DW_AT_decl_column(0x17)

$C$DW$1222	.dwtag  DW_TAG_member
	.dwattr $C$DW$1222, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1222, DW_AT_name("ManipData5_H")
	.dwattr $C$DW$1222, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$1222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1222, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1222, DW_AT_decl_line(0x1f4)
	.dwattr $C$DW$1222, DW_AT_decl_column(0x17)

$C$DW$1223	.dwtag  DW_TAG_member
	.dwattr $C$DW$1223, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$1223, DW_AT_name("SlaveStat")
	.dwattr $C$DW$1223, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$1223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1223, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1223, DW_AT_decl_line(0x1f6)
	.dwattr $C$DW$1223, DW_AT_decl_column(0x26)

$C$DW$1224	.dwtag  DW_TAG_member
	.dwattr $C$DW$1224, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1224, DW_AT_name("IsOperational")
	.dwattr $C$DW$1224, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1224, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1224, DW_AT_decl_line(0x1f7)
	.dwattr $C$DW$1224, DW_AT_decl_column(0x17)

$C$DW$1225	.dwtag  DW_TAG_member
	.dwattr $C$DW$1225, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1225, DW_AT_name("RecorderTrigger")
	.dwattr $C$DW$1225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$1225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1225, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1225, DW_AT_decl_line(0x1f8)
	.dwattr $C$DW$1225, DW_AT_decl_column(0x17)

$C$DW$1226	.dwtag  DW_TAG_member
	.dwattr $C$DW$1226, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1226, DW_AT_name("FlashPumpRequest")
	.dwattr $C$DW$1226, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$1226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1226, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1226, DW_AT_decl_line(0x1f9)
	.dwattr $C$DW$1226, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x1e2)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$47

	.dwendtag $C$DW$TU$47


$C$DW$TU$50	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$50

$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x30)
$C$DW$1227	.dwtag  DW_TAG_member
	.dwattr $C$DW$1227, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1227, DW_AT_name("buf")
	.dwattr $C$DW$1227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1227, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1227, DW_AT_decl_line(0x1ff)
	.dwattr $C$DW$1227, DW_AT_decl_column(0x1b)

$C$DW$1228	.dwtag  DW_TAG_member
	.dwattr $C$DW$1228, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$1228, DW_AT_name("flags")
	.dwattr $C$DW$1228, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$1228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1228, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1228, DW_AT_decl_line(0x200)
	.dwattr $C$DW$1228, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x1fe)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$50

	.dwendtag $C$DW$TU$50


$C$DW$TU$51	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$51

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
$C$DW$1229	.dwtag  DW_TAG_member
	.dwattr $C$DW$1229, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$1229, DW_AT_name("RStatus")
	.dwattr $C$DW$1229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1229, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1229, DW_AT_decl_line(0x207)
	.dwattr $C$DW$1229, DW_AT_decl_column(0x25)

$C$DW$1230	.dwtag  DW_TAG_member
	.dwattr $C$DW$1230, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1230, DW_AT_name("RightPinPos")
	.dwattr $C$DW$1230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1230, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1230, DW_AT_decl_line(0x208)
	.dwattr $C$DW$1230, DW_AT_decl_column(0x17)

$C$DW$1231	.dwtag  DW_TAG_member
	.dwattr $C$DW$1231, DW_AT_type(*$C$DW$T$210)
	.dwattr $C$DW$1231, DW_AT_name("LStatus")
	.dwattr $C$DW$1231, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1231, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1231, DW_AT_decl_line(0x209)
	.dwattr $C$DW$1231, DW_AT_decl_column(0x25)

$C$DW$1232	.dwtag  DW_TAG_member
	.dwattr $C$DW$1232, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1232, DW_AT_name("LeftPinPos")
	.dwattr $C$DW$1232, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1232, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1232, DW_AT_decl_line(0x20a)
	.dwattr $C$DW$1232, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x206)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$51

	.dwendtag $C$DW$TU$51


$C$DW$TU$52	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$52

$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
$C$DW$1233	.dwtag  DW_TAG_member
	.dwattr $C$DW$1233, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1233, DW_AT_name("bUnusedSerialFlashOwner")
	.dwattr $C$DW$1233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1233, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1233, DW_AT_decl_line(0x213)
	.dwattr $C$DW$1233, DW_AT_decl_column(0x20)

$C$DW$1234	.dwtag  DW_TAG_member
	.dwattr $C$DW$1234, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1234, DW_AT_name("bSerialFlashRequest")
	.dwattr $C$DW$1234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1234, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1234, DW_AT_decl_line(0x214)
	.dwattr $C$DW$1234, DW_AT_decl_column(0x20)

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x212)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$52

	.dwendtag $C$DW$TU$52


$C$DW$TU$54	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$54

$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
$C$DW$1235	.dwtag  DW_TAG_member
	.dwattr $C$DW$1235, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$1235, DW_AT_name("DataFromPd")
	.dwattr $C$DW$1235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1235, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1235, DW_AT_decl_line(0x21c)
	.dwattr $C$DW$1235, DW_AT_decl_column(0x1f)

$C$DW$1236	.dwtag  DW_TAG_member
	.dwattr $C$DW$1236, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1236, DW_AT_name("Rsvd")
	.dwattr $C$DW$1236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1236, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1236, DW_AT_decl_line(0x21d)
	.dwattr $C$DW$1236, DW_AT_decl_column(0x16)

$C$DW$1237	.dwtag  DW_TAG_member
	.dwattr $C$DW$1237, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1237, DW_AT_name("DataFromPdCtr")
	.dwattr $C$DW$1237, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1237, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1237, DW_AT_decl_line(0x21e)
	.dwattr $C$DW$1237, DW_AT_decl_column(0x17)

$C$DW$1238	.dwtag  DW_TAG_member
	.dwattr $C$DW$1238, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1238, DW_AT_name("ScoreBoard")
	.dwattr $C$DW$1238, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$1238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1238, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1238, DW_AT_decl_line(0x21f)
	.dwattr $C$DW$1238, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$54, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x21b)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$54

	.dwendtag $C$DW$TU$54


$C$DW$TU$55	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$55

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
$C$DW$1239	.dwtag  DW_TAG_member
	.dwattr $C$DW$1239, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1239, DW_AT_name("PdVerSubverPatch")
	.dwattr $C$DW$1239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1239, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1239, DW_AT_decl_line(0x227)
	.dwattr $C$DW$1239, DW_AT_decl_column(0x21)

$C$DW$1240	.dwtag  DW_TAG_member
	.dwattr $C$DW$1240, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1240, DW_AT_name("MalinkiVerSubverPatch")
	.dwattr $C$DW$1240, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1240, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1240, DW_AT_decl_line(0x228)
	.dwattr $C$DW$1240, DW_AT_decl_column(0x20)

$C$DW$1241	.dwtag  DW_TAG_member
	.dwattr $C$DW$1241, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1241, DW_AT_name("EEFVer")
	.dwattr $C$DW$1241, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1241, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1241, DW_AT_decl_line(0x229)
	.dwattr $C$DW$1241, DW_AT_decl_column(0x20)

$C$DW$1242	.dwtag  DW_TAG_member
	.dwattr $C$DW$1242, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1242, DW_AT_name("RotaryDriverVer")
	.dwattr $C$DW$1242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1242, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1242, DW_AT_decl_line(0x22a)
	.dwattr $C$DW$1242, DW_AT_decl_column(0x17)

$C$DW$1243	.dwtag  DW_TAG_member
	.dwattr $C$DW$1243, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1243, DW_AT_name("TrayRev")
	.dwattr $C$DW$1243, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1243, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1243, DW_AT_decl_line(0x22b)
	.dwattr $C$DW$1243, DW_AT_decl_column(0x17)

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x226)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$55

	.dwendtag $C$DW$TU$55


$C$DW$TU$56	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$56

$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x40a)
$C$DW$1244	.dwtag  DW_TAG_member
	.dwattr $C$DW$1244, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$1244, DW_AT_name("USlaveObject")
	.dwattr $C$DW$1244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1244, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1244, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$1244, DW_AT_decl_column(0x0a)

$C$DW$1245	.dwtag  DW_TAG_member
	.dwattr $C$DW$1245, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$1245, DW_AT_name("ActStatus")
	.dwattr $C$DW$1245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1245, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1245, DW_AT_decl_line(0x1fc)
	.dwattr $C$DW$1245, DW_AT_decl_column(0x0a)

$C$DW$1246	.dwtag  DW_TAG_member
	.dwattr $C$DW$1246, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$1246, DW_AT_name("Records")
	.dwattr $C$DW$1246, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$1246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1246, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1246, DW_AT_decl_line(0x201)
	.dwattr $C$DW$1246, DW_AT_decl_column(0x0b)

$C$DW$1247	.dwtag  DW_TAG_member
	.dwattr $C$DW$1247, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$1247, DW_AT_name("WheelArm")
	.dwattr $C$DW$1247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$1247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1247, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1247, DW_AT_decl_line(0x20c)
	.dwattr $C$DW$1247, DW_AT_decl_column(0x0b)

$C$DW$1248	.dwtag  DW_TAG_member
	.dwattr $C$DW$1248, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1248, DW_AT_name("UFlashToken")
	.dwattr $C$DW$1248, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$1248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1248, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1248, DW_AT_decl_line(0x216)
	.dwattr $C$DW$1248, DW_AT_decl_column(0x0b)

$C$DW$1249	.dwtag  DW_TAG_member
	.dwattr $C$DW$1249, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1249, DW_AT_name("DataFromPd")
	.dwattr $C$DW$1249, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$1249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1249, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1249, DW_AT_decl_line(0x221)
	.dwattr $C$DW$1249, DW_AT_decl_column(0x0b)

$C$DW$1250	.dwtag  DW_TAG_member
	.dwattr $C$DW$1250, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$1250, DW_AT_name("SlaveRevisions")
	.dwattr $C$DW$1250, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$1250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1250, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1250, DW_AT_decl_line(0x22d)
	.dwattr $C$DW$1250, DW_AT_decl_column(0x0b)

$C$DW$1251	.dwtag  DW_TAG_member
	.dwattr $C$DW$1251, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1251, DW_AT_name("Spare")
	.dwattr $C$DW$1251, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$1251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1251, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1251, DW_AT_decl_line(0x231)
	.dwattr $C$DW$1251, DW_AT_decl_column(0x0b)

$C$DW$1252	.dwtag  DW_TAG_member
	.dwattr $C$DW$1252, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1252, DW_AT_name("DataBlock")
	.dwattr $C$DW$1252, DW_AT_data_member_location[DW_OP_plus_uconst 0x20a]
	.dwattr $C$DW$1252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1252, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1252, DW_AT_decl_line(0x236)
	.dwattr $C$DW$1252, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x1ce)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$56

	.dwendtag $C$DW$TU$56


$C$DW$TU$57	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$57

$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$1253	.dwtag  DW_TAG_member
	.dwattr $C$DW$1253, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1253, DW_AT_name("MotionFatal")
	.dwattr $C$DW$1253, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1253, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1253, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1253, DW_AT_decl_line(0x3a6)
	.dwattr $C$DW$1253, DW_AT_decl_column(0x1e)

$C$DW$1254	.dwtag  DW_TAG_member
	.dwattr $C$DW$1254, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1254, DW_AT_name("PackHandleFail")
	.dwattr $C$DW$1254, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1254, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1254, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1254, DW_AT_decl_line(0x3a7)
	.dwattr $C$DW$1254, DW_AT_decl_column(0x1e)

$C$DW$1255	.dwtag  DW_TAG_member
	.dwattr $C$DW$1255, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1255, DW_AT_name("PDAbsent")
	.dwattr $C$DW$1255, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1255, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1255, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1255, DW_AT_decl_line(0x3a8)
	.dwattr $C$DW$1255, DW_AT_decl_column(0x1e)

$C$DW$1256	.dwtag  DW_TAG_member
	.dwattr $C$DW$1256, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1256, DW_AT_name("OverNeckStretch")
	.dwattr $C$DW$1256, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1256, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1256, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1256, DW_AT_decl_line(0x3a9)
	.dwattr $C$DW$1256, DW_AT_decl_column(0x1e)

$C$DW$1257	.dwtag  DW_TAG_member
	.dwattr $C$DW$1257, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1257, DW_AT_name("OnDebugWait")
	.dwattr $C$DW$1257, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1257, DW_AT_bit_size(0x08)
	.dwattr $C$DW$1257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1257, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1257, DW_AT_decl_line(0x3aa)
	.dwattr $C$DW$1257, DW_AT_decl_column(0x1e)

$C$DW$1258	.dwtag  DW_TAG_member
	.dwattr $C$DW$1258, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1258, DW_AT_name("DebugHoldEnabled")
	.dwattr $C$DW$1258, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1258, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1258, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1258, DW_AT_decl_line(0x3ab)
	.dwattr $C$DW$1258, DW_AT_decl_column(0x1e)

$C$DW$1259	.dwtag  DW_TAG_member
	.dwattr $C$DW$1259, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1259, DW_AT_name("IsWakeStateFault")
	.dwattr $C$DW$1259, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1259, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1259, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1259, DW_AT_decl_line(0x3ac)
	.dwattr $C$DW$1259, DW_AT_decl_column(0x1e)

$C$DW$1260	.dwtag  DW_TAG_member
	.dwattr $C$DW$1260, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1260, DW_AT_name("SerialFlashFault")
	.dwattr $C$DW$1260, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1260, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1260, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1260, DW_AT_decl_line(0x3ad)
	.dwattr $C$DW$1260, DW_AT_decl_column(0x1e)

$C$DW$1261	.dwtag  DW_TAG_member
	.dwattr $C$DW$1261, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1261, DW_AT_name("Reserved")
	.dwattr $C$DW$1261, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1261, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1261, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1261, DW_AT_decl_line(0x3ae)
	.dwattr $C$DW$1261, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x3a5)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$57

	.dwendtag $C$DW$TU$57


$C$DW$TU$59	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$59

$C$DW$T$59	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x40)
$C$DW$1262	.dwtag  DW_TAG_member
	.dwattr $C$DW$1262, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$1262, DW_AT_name("stat")
	.dwattr $C$DW$1262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1262, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1262, DW_AT_decl_line(0x1fa)
	.dwattr $C$DW$1262, DW_AT_decl_column(0x0e)

$C$DW$1263	.dwtag  DW_TAG_member
	.dwattr $C$DW$1263, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1263, DW_AT_name("buf")
	.dwattr $C$DW$1263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1263, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1263, DW_AT_decl_line(0x1fb)
	.dwattr $C$DW$1263, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$59, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$59

	.dwendtag $C$DW$TU$59


$C$DW$TU$60	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$60

$C$DW$T$60	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x10)
$C$DW$1264	.dwtag  DW_TAG_member
	.dwattr $C$DW$1264, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1264, DW_AT_name("buf")
	.dwattr $C$DW$1264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1264, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1264, DW_AT_decl_line(0x204)
	.dwattr $C$DW$1264, DW_AT_decl_column(0x12)

$C$DW$1265	.dwtag  DW_TAG_member
	.dwattr $C$DW$1265, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$1265, DW_AT_name("stat")
	.dwattr $C$DW$1265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1265, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1265, DW_AT_decl_line(0x20b)
	.dwattr $C$DW$1265, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$60, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x203)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$60

	.dwendtag $C$DW$TU$60


$C$DW$TU$62	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$62

$C$DW$T$62	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x04)
$C$DW$1266	.dwtag  DW_TAG_member
	.dwattr $C$DW$1266, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$1266, DW_AT_name("buf")
	.dwattr $C$DW$1266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1266, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1266, DW_AT_decl_line(0x210)
	.dwattr $C$DW$1266, DW_AT_decl_column(0x12)

$C$DW$1267	.dwtag  DW_TAG_member
	.dwattr $C$DW$1267, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$1267, DW_AT_name("item")
	.dwattr $C$DW$1267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1267, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1267, DW_AT_decl_line(0x215)
	.dwattr $C$DW$1267, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$62, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x20f)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$62

	.dwendtag $C$DW$TU$62


$C$DW$TU$64	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$64

$C$DW$T$64	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x0c)
$C$DW$1268	.dwtag  DW_TAG_member
	.dwattr $C$DW$1268, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$1268, DW_AT_name("buf")
	.dwattr $C$DW$1268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1268, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1268, DW_AT_decl_line(0x219)
	.dwattr $C$DW$1268, DW_AT_decl_column(0x12)

$C$DW$1269	.dwtag  DW_TAG_member
	.dwattr $C$DW$1269, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$1269, DW_AT_name("item")
	.dwattr $C$DW$1269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1269, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1269, DW_AT_decl_line(0x220)
	.dwattr $C$DW$1269, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$64, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x218)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$64

	.dwendtag $C$DW$TU$64


$C$DW$TU$65	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$65

$C$DW$T$65	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
$C$DW$1270	.dwtag  DW_TAG_member
	.dwattr $C$DW$1270, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1270, DW_AT_name("buf")
	.dwattr $C$DW$1270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1270, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1270, DW_AT_decl_line(0x224)
	.dwattr $C$DW$1270, DW_AT_decl_column(0x12)

$C$DW$1271	.dwtag  DW_TAG_member
	.dwattr $C$DW$1271, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$1271, DW_AT_name("item")
	.dwattr $C$DW$1271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1271, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1271, DW_AT_decl_line(0x22c)
	.dwattr $C$DW$1271, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$65, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x223)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$65

	.dwendtag $C$DW$TU$65


$C$DW$TU$67	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$67

$C$DW$T$67	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x150)
$C$DW$1272	.dwtag  DW_TAG_member
	.dwattr $C$DW$1272, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$1272, DW_AT_name("buf")
	.dwattr $C$DW$1272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1272, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1272, DW_AT_decl_line(0x230)
	.dwattr $C$DW$1272, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$67, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x22f)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$67

	.dwendtag $C$DW$TU$67


$C$DW$TU$69	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$69

$C$DW$T$69	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x200)
$C$DW$1273	.dwtag  DW_TAG_member
	.dwattr $C$DW$1273, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$1273, DW_AT_name("buf")
	.dwattr $C$DW$1273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1273, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1273, DW_AT_decl_line(0x235)
	.dwattr $C$DW$1273, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$69, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x234)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$69

	.dwendtag $C$DW$TU$69


$C$DW$TU$70	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$70

$C$DW$T$70	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
$C$DW$1274	.dwtag  DW_TAG_member
	.dwattr $C$DW$1274, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1274, DW_AT_name("all")
	.dwattr $C$DW$1274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1274, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1274, DW_AT_decl_line(0x3a4)
	.dwattr $C$DW$1274, DW_AT_decl_column(0x19)

$C$DW$1275	.dwtag  DW_TAG_member
	.dwattr $C$DW$1275, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$1275, DW_AT_name("bit")
	.dwattr $C$DW$1275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1275, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$1275, DW_AT_decl_line(0x3af)
	.dwattr $C$DW$1275, DW_AT_decl_column(0x13)

	.dwattr $C$DW$T$70, DW_AT_decl_file("..\Application\StructDef2.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x3a3)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$70

	.dwendtag $C$DW$TU$70


$C$DW$TU$71	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$71

$C$DW$T$71	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x01)
$C$DW$1276	.dwtag  DW_TAG_member
	.dwattr $C$DW$1276, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$1276, DW_AT_name("cw")
	.dwattr $C$DW$1276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1276, DW_AT_decl_file("../Application/ManState.c")
	.dwattr $C$DW$1276, DW_AT_decl_line(0x28e)
	.dwattr $C$DW$1276, DW_AT_decl_column(0x22)

$C$DW$1277	.dwtag  DW_TAG_member
	.dwattr $C$DW$1277, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1277, DW_AT_name("us")
	.dwattr $C$DW$1277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1277, DW_AT_decl_file("../Application/ManState.c")
	.dwattr $C$DW$1277, DW_AT_decl_line(0x28f)
	.dwattr $C$DW$1277, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$71, DW_AT_decl_file("../Application/ManState.c")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x28d)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$71

	.dwendtag $C$DW$TU$71


$C$DW$TU$72	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$72

$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_name("CAxisCBit")
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x02)
$C$DW$1278	.dwtag  DW_TAG_member
	.dwattr $C$DW$1278, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1278, DW_AT_name("MotorOn")
	.dwattr $C$DW$1278, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1278, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1278, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1278, DW_AT_decl_line(0x68)
	.dwattr $C$DW$1278, DW_AT_decl_column(0x12)

$C$DW$1279	.dwtag  DW_TAG_member
	.dwattr $C$DW$1279, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1279, DW_AT_name("MotorReady")
	.dwattr $C$DW$1279, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1279, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1279, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1279, DW_AT_decl_line(0x69)
	.dwattr $C$DW$1279, DW_AT_decl_column(0x12)

$C$DW$1280	.dwtag  DW_TAG_member
	.dwattr $C$DW$1280, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1280, DW_AT_name("StoEvent")
	.dwattr $C$DW$1280, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1280, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1280, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1280, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1280, DW_AT_decl_column(0x12)

$C$DW$1281	.dwtag  DW_TAG_member
	.dwattr $C$DW$1281, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1281, DW_AT_name("ProfileConverged")
	.dwattr $C$DW$1281, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1281, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1281, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1281, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$1281, DW_AT_decl_column(0x12)

$C$DW$1282	.dwtag  DW_TAG_member
	.dwattr $C$DW$1282, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1282, DW_AT_name("MotionConverged")
	.dwattr $C$DW$1282, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1282, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1282, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1282, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$1282, DW_AT_decl_column(0x12)

$C$DW$1283	.dwtag  DW_TAG_member
	.dwattr $C$DW$1283, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1283, DW_AT_name("MotorFault")
	.dwattr $C$DW$1283, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1283, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1283, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1283, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$1283, DW_AT_decl_column(0x12)

$C$DW$1284	.dwtag  DW_TAG_member
	.dwattr $C$DW$1284, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1284, DW_AT_name("QuickStop")
	.dwattr $C$DW$1284, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1284, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1284, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1284, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$1284, DW_AT_decl_column(0x12)

$C$DW$1285	.dwtag  DW_TAG_member
	.dwattr $C$DW$1285, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1285, DW_AT_name("BrakesReleaseCmd")
	.dwattr $C$DW$1285, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1285, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1285, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1285, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$1285, DW_AT_decl_column(0x12)

$C$DW$1286	.dwtag  DW_TAG_member
	.dwattr $C$DW$1286, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1286, DW_AT_name("PotRefFail")
	.dwattr $C$DW$1286, DW_AT_bit_offset(0x07)
	.dwattr $C$DW$1286, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1286, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1286, DW_AT_decl_line(0x70)
	.dwattr $C$DW$1286, DW_AT_decl_column(0x12)

$C$DW$1287	.dwtag  DW_TAG_member
	.dwattr $C$DW$1287, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1287, DW_AT_name("LoopClosureMode")
	.dwattr $C$DW$1287, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1287, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1287, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1287, DW_AT_decl_line(0x71)
	.dwattr $C$DW$1287, DW_AT_decl_column(0x12)

$C$DW$1288	.dwtag  DW_TAG_member
	.dwattr $C$DW$1288, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1288, DW_AT_name("SystemMode")
	.dwattr $C$DW$1288, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1288, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1288, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1288, DW_AT_decl_line(0x72)
	.dwattr $C$DW$1288, DW_AT_decl_column(0x12)

$C$DW$1289	.dwtag  DW_TAG_member
	.dwattr $C$DW$1289, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1289, DW_AT_name("CurrentLimit")
	.dwattr $C$DW$1289, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1289, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1289, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1289, DW_AT_decl_line(0x73)
	.dwattr $C$DW$1289, DW_AT_decl_column(0x12)

$C$DW$1290	.dwtag  DW_TAG_member
	.dwattr $C$DW$1290, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1290, DW_AT_name("NoCalib")
	.dwattr $C$DW$1290, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1290, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1290, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1290, DW_AT_decl_line(0x74)
	.dwattr $C$DW$1290, DW_AT_decl_column(0x12)

$C$DW$1291	.dwtag  DW_TAG_member
	.dwattr $C$DW$1291, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1291, DW_AT_name("GyroNotReady")
	.dwattr $C$DW$1291, DW_AT_bit_offset(0x0e)
	.dwattr $C$DW$1291, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1291, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1291, DW_AT_decl_line(0x75)
	.dwattr $C$DW$1291, DW_AT_decl_column(0x12)

$C$DW$1292	.dwtag  DW_TAG_member
	.dwattr $C$DW$1292, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1292, DW_AT_name("RecorderWaitTrigger")
	.dwattr $C$DW$1292, DW_AT_bit_offset(0x0d)
	.dwattr $C$DW$1292, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1292, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1292, DW_AT_decl_line(0x76)
	.dwattr $C$DW$1292, DW_AT_decl_column(0x12)

$C$DW$1293	.dwtag  DW_TAG_member
	.dwattr $C$DW$1293, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1293, DW_AT_name("RecorderActive")
	.dwattr $C$DW$1293, DW_AT_bit_offset(0x0c)
	.dwattr $C$DW$1293, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1293, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1293, DW_AT_decl_line(0x77)
	.dwattr $C$DW$1293, DW_AT_decl_column(0x12)

$C$DW$1294	.dwtag  DW_TAG_member
	.dwattr $C$DW$1294, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1294, DW_AT_name("RecorderReady")
	.dwattr $C$DW$1294, DW_AT_bit_offset(0x0b)
	.dwattr $C$DW$1294, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1294, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1294, DW_AT_decl_line(0x78)
	.dwattr $C$DW$1294, DW_AT_decl_column(0x12)

$C$DW$1295	.dwtag  DW_TAG_member
	.dwattr $C$DW$1295, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1295, DW_AT_name("RefGenOn")
	.dwattr $C$DW$1295, DW_AT_bit_offset(0x0a)
	.dwattr $C$DW$1295, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1295, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1295, DW_AT_decl_line(0x79)
	.dwattr $C$DW$1295, DW_AT_decl_column(0x12)

$C$DW$1296	.dwtag  DW_TAG_member
	.dwattr $C$DW$1296, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1296, DW_AT_name("TRefGenOn")
	.dwattr $C$DW$1296, DW_AT_bit_offset(0x09)
	.dwattr $C$DW$1296, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1296, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1296, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$1296, DW_AT_decl_column(0x12)

$C$DW$1297	.dwtag  DW_TAG_member
	.dwattr $C$DW$1297, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1297, DW_AT_name("GyroAbsent")
	.dwattr $C$DW$1297, DW_AT_bit_offset(0x08)
	.dwattr $C$DW$1297, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1297, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1297, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$1297, DW_AT_decl_column(0x12)

$C$DW$1298	.dwtag  DW_TAG_member
	.dwattr $C$DW$1298, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1298, DW_AT_name("ReferenceMode")
	.dwattr $C$DW$1298, DW_AT_bit_offset(0x05)
	.dwattr $C$DW$1298, DW_AT_bit_size(0x03)
	.dwattr $C$DW$1298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1298, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1298, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$1298, DW_AT_decl_column(0x12)

$C$DW$1299	.dwtag  DW_TAG_member
	.dwattr $C$DW$1299, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1299, DW_AT_name("Pdo3IsPotDiff")
	.dwattr $C$DW$1299, DW_AT_bit_offset(0x04)
	.dwattr $C$DW$1299, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1299, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1299, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1299, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$1299, DW_AT_decl_column(0x12)

$C$DW$1300	.dwtag  DW_TAG_member
	.dwattr $C$DW$1300, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1300, DW_AT_name("Configured")
	.dwattr $C$DW$1300, DW_AT_bit_offset(0x03)
	.dwattr $C$DW$1300, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1300, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1300, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$1300, DW_AT_decl_column(0x12)

$C$DW$1301	.dwtag  DW_TAG_member
	.dwattr $C$DW$1301, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1301, DW_AT_name("Homed")
	.dwattr $C$DW$1301, DW_AT_bit_offset(0x02)
	.dwattr $C$DW$1301, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1301, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1301, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1301, DW_AT_decl_column(0x12)

$C$DW$1302	.dwtag  DW_TAG_member
	.dwattr $C$DW$1302, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1302, DW_AT_name("Din1")
	.dwattr $C$DW$1302, DW_AT_bit_offset(0x01)
	.dwattr $C$DW$1302, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1302, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1302, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1302, DW_AT_decl_column(0x12)

$C$DW$1303	.dwtag  DW_TAG_member
	.dwattr $C$DW$1303, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1303, DW_AT_name("Din2")
	.dwattr $C$DW$1303, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1303, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1303, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1303, DW_AT_decl_line(0x81)
	.dwattr $C$DW$1303, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$72, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$72

	.dwendtag $C$DW$TU$72


$C$DW$TU$73	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$73

$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_name("CAxisCBit2")
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x01)
$C$DW$1304	.dwtag  DW_TAG_member
	.dwattr $C$DW$1304, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1304, DW_AT_name("bAutoBlocked")
	.dwattr $C$DW$1304, DW_AT_bit_offset(0x0f)
	.dwattr $C$DW$1304, DW_AT_bit_size(0x01)
	.dwattr $C$DW$1304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1304, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1304, DW_AT_decl_line(0x90)
	.dwattr $C$DW$1304, DW_AT_decl_column(0x12)

$C$DW$1305	.dwtag  DW_TAG_member
	.dwattr $C$DW$1305, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$1305, DW_AT_name("bRsvd")
	.dwattr $C$DW$1305, DW_AT_bit_offset(0x00)
	.dwattr $C$DW$1305, DW_AT_bit_size(0x0f)
	.dwattr $C$DW$1305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1305, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1305, DW_AT_decl_line(0x91)
	.dwattr $C$DW$1305, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$73, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$73

	.dwendtag $C$DW$TU$73


$C$DW$TU$74	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$74

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_name("CAxisSim")
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x06)
$C$DW$1306	.dwtag  DW_TAG_member
	.dwattr $C$DW$1306, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1306, DW_AT_name("SimPositionCnt")
	.dwattr $C$DW$1306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1306, DW_AT_decl_file("..\Application\Dynamixel.h")
	.dwattr $C$DW$1306, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$1306, DW_AT_decl_column(0x0b)

$C$DW$1307	.dwtag  DW_TAG_member
	.dwattr $C$DW$1307, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1307, DW_AT_name("SimSpeedCnt")
	.dwattr $C$DW$1307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1307, DW_AT_decl_file("..\Application\Dynamixel.h")
	.dwattr $C$DW$1307, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1307, DW_AT_decl_column(0x0b)

$C$DW$1308	.dwtag  DW_TAG_member
	.dwattr $C$DW$1308, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1308, DW_AT_name("SimMotorOn")
	.dwattr $C$DW$1308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1308, DW_AT_decl_file("..\Application\Dynamixel.h")
	.dwattr $C$DW$1308, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1308, DW_AT_decl_column(0x14)

	.dwattr $C$DW$T$74, DW_AT_decl_file("..\Application\Dynamixel.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$74

	.dwendtag $C$DW$TU$74


$C$DW$TU$78	.dwtag  DW_TAG_type_unit
	.dwmtype  $C$DW$T$78

$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_name("CBH")
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x72)
$C$DW$1309	.dwtag  DW_TAG_member
	.dwattr $C$DW$1309, DW_AT_type(*$C$DW$T$201)
	.dwattr $C$DW$1309, DW_AT_name("BhCw")
	.dwattr $C$DW$1309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1309, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1309, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1309, DW_AT_decl_column(0x15)

$C$DW$1310	.dwtag  DW_TAG_member
	.dwattr $C$DW$1310, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1310, DW_AT_name("UserSpeed")
	.dwattr $C$DW$1310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1310, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1310, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$1310, DW_AT_decl_column(0x0b)

$C$DW$1311	.dwtag  DW_TAG_member
	.dwattr $C$DW$1311, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1311, DW_AT_name("UserPos")
	.dwattr $C$DW$1311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1311, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1311, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$1311, DW_AT_decl_column(0x0b)

$C$DW$1312	.dwtag  DW_TAG_member
	.dwattr $C$DW$1312, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1312, DW_AT_name("CurrentUseRatio")
	.dwattr $C$DW$1312, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1312, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1312, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$1312, DW_AT_decl_column(0x0b)

$C$DW$1313	.dwtag  DW_TAG_member
	.dwattr $C$DW$1313, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1313, DW_AT_name("UserSpeedCmd")
	.dwattr $C$DW$1313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1313, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1313, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$1313, DW_AT_decl_column(0x0b)

$C$DW$1314	.dwtag  DW_TAG_member
	.dwattr $C$DW$1314, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1314, DW_AT_name("UserPosCmd")
	.dwattr $C$DW$1314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1314, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1314, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$1314, DW_AT_decl_column(0x0b)

$C$DW$1315	.dwtag  DW_TAG_member
	.dwattr $C$DW$1315, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1315, DW_AT_name("CurrentCmd")
	.dwattr $C$DW$1315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1315, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1315, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$1315, DW_AT_decl_column(0x0b)

$C$DW$1316	.dwtag  DW_TAG_member
	.dwattr $C$DW$1316, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1316, DW_AT_name("PotMean")
	.dwattr $C$DW$1316, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1316, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1316, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1316, DW_AT_decl_column(0x0b)

$C$DW$1317	.dwtag  DW_TAG_member
	.dwattr $C$DW$1317, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1317, DW_AT_name("PotDifference")
	.dwattr $C$DW$1317, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1317, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1317, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$1317, DW_AT_decl_column(0x0b)

$C$DW$1318	.dwtag  DW_TAG_member
	.dwattr $C$DW$1318, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1318, DW_AT_name("ReportPosCmd")
	.dwattr $C$DW$1318, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$1318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1318, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1318, DW_AT_decl_line(0xda)
	.dwattr $C$DW$1318, DW_AT_decl_column(0x0b)

$C$DW$1319	.dwtag  DW_TAG_member
	.dwattr $C$DW$1319, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1319, DW_AT_name("ReportSpeedCmd")
	.dwattr $C$DW$1319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1319, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1319, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$1319, DW_AT_decl_column(0x0b)

$C$DW$1320	.dwtag  DW_TAG_member
	.dwattr $C$DW$1320, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$1320, DW_AT_name("ModalCmdPtr")
	.dwattr $C$DW$1320, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1320, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1320, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$1320, DW_AT_decl_column(0x0c)

$C$DW$1321	.dwtag  DW_TAG_member
	.dwattr $C$DW$1321, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1321, DW_AT_name("PosError")
	.dwattr $C$DW$1321, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$1321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1321, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1321, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$1321, DW_AT_decl_column(0x0b)

$C$DW$1322	.dwtag  DW_TAG_member
	.dwattr $C$DW$1322, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1322, DW_AT_name("PosEncoder")
	.dwattr $C$DW$1322, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1322, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1322, DW_AT_decl_line(0xde)
	.dwattr $C$DW$1322, DW_AT_decl_column(0x0b)

$C$DW$1323	.dwtag  DW_TAG_member
	.dwattr $C$DW$1323, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1323, DW_AT_name("IndividualPosCmd")
	.dwattr $C$DW$1323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$1323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1323, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1323, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$1323, DW_AT_decl_column(0x0b)

$C$DW$1324	.dwtag  DW_TAG_member
	.dwattr $C$DW$1324, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1324, DW_AT_name("IndividualSpeedCmd")
	.dwattr $C$DW$1324, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1324, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1324, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$1324, DW_AT_decl_column(0x0b)

$C$DW$1325	.dwtag  DW_TAG_member
	.dwattr $C$DW$1325, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1325, DW_AT_name("Torque")
	.dwattr $C$DW$1325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$1325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1325, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1325, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$1325, DW_AT_decl_column(0x0b)

$C$DW$1326	.dwtag  DW_TAG_member
	.dwattr $C$DW$1326, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$1326, DW_AT_name("TorqueFilt")
	.dwattr $C$DW$1326, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$1326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1326, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1326, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$1326, DW_AT_decl_column(0x0b)

$C$DW$1327	.dwtag  DW_TAG_member
	.dwattr $C$DW$1327, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$1327, DW_AT_name("WheelEncoderCnt")
	.dwattr $C$DW$1327, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$1327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1327, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1327, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$1327, DW_AT_decl_column(0x0b)

$C$DW$1328	.dwtag  DW_TAG_member
	.dwattr $C$DW$1328, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1328, DW_AT_name("FaultCode")
	.dwattr $C$DW$1328, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$1328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1328, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1328, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1328, DW_AT_decl_column(0x14)

$C$DW$1329	.dwtag  DW_TAG_member
	.dwattr $C$DW$1329, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1329, DW_AT_name("ComCbit")
	.dwattr $C$DW$1329, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$1329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1329, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1329, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$1329, DW_AT_decl_column(0x19)

$C$DW$1330	.dwtag  DW_TAG_member
	.dwattr $C$DW$1330, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$1330, DW_AT_name("AxisCbit")
	.dwattr $C$DW$1330, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$1330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1330, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1330, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$1330, DW_AT_decl_column(0x15)

$C$DW$1331	.dwtag  DW_TAG_member
	.dwattr $C$DW$1331, DW_AT_type(*$C$DW$T$200)
	.dwattr $C$DW$1331, DW_AT_name("AxisCbit2")
	.dwattr $C$DW$1331, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$1331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1331, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1331, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$1331, DW_AT_decl_column(0x16)

$C$DW$1332	.dwtag  DW_TAG_member
	.dwattr $C$DW$1332, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$1332, DW_AT_name("LimitSw")
	.dwattr $C$DW$1332, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$1332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1332, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1332, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1332, DW_AT_decl_column(0x17)

$C$DW$1333	.dwtag  DW_TAG_member
	.dwattr $C$DW$1333, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1333, DW_AT_name("LoopClosureMode")
	.dwattr $C$DW$1333, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$1333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1333, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1333, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1333, DW_AT_decl_column(0x14)

$C$DW$1334	.dwtag  DW_TAG_member
	.dwattr $C$DW$1334, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1334, DW_AT_name("IndividualMode")
	.dwattr $C$DW$1334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$1334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1334, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1334, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1334, DW_AT_decl_column(0x14)

$C$DW$1335	.dwtag  DW_TAG_member
	.dwattr $C$DW$1335, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1335, DW_AT_name("IndividualMotorOnCmd")
	.dwattr $C$DW$1335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$1335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1335, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1335, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1335, DW_AT_decl_column(0x14)

$C$DW$1336	.dwtag  DW_TAG_member
	.dwattr $C$DW$1336, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1336, DW_AT_name("NewCmdCnt")
	.dwattr $C$DW$1336, DW_AT_data_member_location[DW_OP_plus_uconst 0x4f]
	.dwattr $C$DW$1336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1336, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1336, DW_AT_decl_line(0xee)
	.dwattr $C$DW$1336, DW_AT_decl_column(0x0b)

$C$DW$1337	.dwtag  DW_TAG_member
	.dwattr $C$DW$1337, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1337, DW_AT_name("PositionLoopClosureMode")
	.dwattr $C$DW$1337, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1337, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1337, DW_AT_decl_line(0xef)
	.dwattr $C$DW$1337, DW_AT_decl_column(0x14)

$C$DW$1338	.dwtag  DW_TAG_member
	.dwattr $C$DW$1338, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1338, DW_AT_name("ResetFailRequestCnt")
	.dwattr $C$DW$1338, DW_AT_data_member_location[DW_OP_plus_uconst 0x51]
	.dwattr $C$DW$1338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1338, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1338, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$1338, DW_AT_decl_column(0x14)

$C$DW$1339	.dwtag  DW_TAG_member
	.dwattr $C$DW$1339, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1339, DW_AT_name("KillHomeRequestCnt")
	.dwattr $C$DW$1339, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$1339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1339, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1339, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$1339, DW_AT_decl_column(0x14)

$C$DW$1340	.dwtag  DW_TAG_member
	.dwattr $C$DW$1340, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1340, DW_AT_name("ResetFailUseCnt")
	.dwattr $C$DW$1340, DW_AT_data_member_location[DW_OP_plus_uconst 0x53]
	.dwattr $C$DW$1340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1340, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1340, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1340, DW_AT_decl_column(0x14)

$C$DW$1341	.dwtag  DW_TAG_member
	.dwattr $C$DW$1341, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1341, DW_AT_name("KillHomeUseCnt")
	.dwattr $C$DW$1341, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$1341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1341, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1341, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1341, DW_AT_decl_column(0x14)

$C$DW$1342	.dwtag  DW_TAG_member
	.dwattr $C$DW$1342, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1342, DW_AT_name("PDO3ReportStyle")
	.dwattr $C$DW$1342, DW_AT_data_member_location[DW_OP_plus_uconst 0x55]
	.dwattr $C$DW$1342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1342, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
	.dwattr $C$DW$1342, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1342, DW_AT_decl_column(0x14)

$C$DW$1343	.dwtag  DW_TAG_member
	.dwattr $C$DW$1343, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1343, DW_AT_name("IsPosition")
	.dwattr $C$DW$1343, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$1343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1343, DW_AT_decl_file("..\Application\..\..\BHAxes\BhAxes.h")
